[Survived] StringLiteral
src/core/lspCallGraphParsing.ts:6:50
  * No VS Code dependency — safe for unit testing with vitest.
  */
 
-export const supportedSchemes = new Set(["file", "untitled"]);
+export const supportedSchemes = new Set(["file", ""]);
 
 /** Parse a symbolId of the form "uri#line:character" into its parts. Returns undefined for malformed ids. */

[Killed] BlockStatement
src/core/lspCallGraphParsing.ts:9:112
 export const supportedSchemes = new Set(["file", "untitled"]);
 
 /** Parse a symbolId of the form "uri#line:character" into its parts. Returns undefined for malformed ids. */
-export function parseSymbolIdParts(symbolId: string): { uriStr: string; line: number; ch: number } | undefined {
-  const hash = symbolId.indexOf("#");
-  if (hash <= 0) {
-    return undefined;
-  }
-  const uriStr = symbolId.slice(0, hash);
-  const rest = symbolId.slice(hash + 1);
-  const parts = rest.split(":");
-  const line = Number.parseInt(parts[0] ?? "", 10);
-  const ch = Number.parseInt(parts[1] ?? "", 10);
-  if (Number.isNaN(line) || Number.isNaN(ch)) {
-    return undefined;
-  }
-  return { uriStr, line, ch };
-}
+export function parseSymbolIdParts(symbolId: string): { uriStr: string; line: number; ch: number } | undefined {}
 
killedBy: parseSymbolIdParts returns uri, line, and character for a valid symbolId
statusReason: expected undefined to deeply equal { uriStr: 'file:///a.ts', …(2) }

[Killed] ConditionalExpression
src/core/lspCallGraphParsing.ts:11:7
 /** Parse a symbolId of the form "uri#line:character" into its parts. Returns undefined for malformed ids. */
 export function parseSymbolIdParts(symbolId: string): { uriStr: string; line: number; ch: number } | undefined {
   const hash = symbolId.indexOf("#");
-  if (hash <= 0) {
+  if (false) {
     return undefined;
   }
killedBy: parseSymbolIdParts returns undefined when hash is at position 0
statusReason: expected { uriStr: '', line: +0, ch: +0 } to be undefined

[Killed] ConditionalExpression
src/core/lspCallGraphParsing.ts:11:7
 /** Parse a symbolId of the form "uri#line:character" into its parts. Returns undefined for malformed ids. */
 export function parseSymbolIdParts(symbolId: string): { uriStr: string; line: number; ch: number } | undefined {
   const hash = symbolId.indexOf("#");
-  if (hash <= 0) {
+  if (true) {
     return undefined;
   }
killedBy: parseSymbolIdParts returns uri, line, and character for a valid symbolId
statusReason: expected undefined to deeply equal { uriStr: 'file:///a.ts', …(2) }

[Killed] MethodExpression
src/core/lspCallGraphParsing.ts:14:18
   if (hash <= 0) {
     return undefined;
   }
-  const uriStr = symbolId.slice(0, hash);
+  const uriStr = symbolId;
   const rest = symbolId.slice(hash + 1);
   const parts = rest.split(":");
killedBy: parseSymbolIdParts returns uri, line, and character for a valid symbolId
statusReason: expected { uriStr: 'file:///a.ts#10:5', …(2) } to deeply equal { uriStr: 'file:///a.ts', …(2) }

[Killed] ArithmeticOperator
src/core/lspCallGraphParsing.ts:15:31
     return undefined;
   }
   const uriStr = symbolId.slice(0, hash);
-  const rest = symbolId.slice(hash + 1);
+  const rest = symbolId.slice(hash - 1);
   const parts = rest.split(":");
   const line = Number.parseInt(parts[0] ?? "", 10);
killedBy: parseSymbolIdParts returns uri, line, and character for a valid symbolId
statusReason: expected undefined to deeply equal { uriStr: 'file:///a.ts', …(2) }

[Killed] MethodExpression
src/core/lspCallGraphParsing.ts:15:16
     return undefined;
   }
   const uriStr = symbolId.slice(0, hash);
-  const rest = symbolId.slice(hash + 1);
+  const rest = symbolId;
   const parts = rest.split(":");
   const line = Number.parseInt(parts[0] ?? "", 10);
killedBy: parseSymbolIdParts returns uri, line, and character for a valid symbolId
statusReason: expected undefined to deeply equal { uriStr: 'file:///a.ts', …(2) }

[Killed] StringLiteral
src/core/lspCallGraphParsing.ts:16:28
   }
   const uriStr = symbolId.slice(0, hash);
   const rest = symbolId.slice(hash + 1);
-  const parts = rest.split(":");
+  const parts = rest.split("");
   const line = Number.parseInt(parts[0] ?? "", 10);
   const ch = Number.parseInt(parts[1] ?? "", 10);
killedBy: parseSymbolIdParts returns uri, line, and character for a valid symbolId
statusReason: expected { uriStr: 'file:///a.ts', …(2) } to deeply equal { uriStr: 'file:///a.ts', …(2) }

[Killed] LogicalOperator
src/core/lspCallGraphParsing.ts:17:32
   const uriStr = symbolId.slice(0, hash);
   const rest = symbolId.slice(hash + 1);
   const parts = rest.split(":");
-  const line = Number.parseInt(parts[0] ?? "", 10);
+  const line = Number.parseInt(parts[0] && "", 10);
   const ch = Number.parseInt(parts[1] ?? "", 10);
   if (Number.isNaN(line) || Number.isNaN(ch)) {
killedBy: parseSymbolIdParts returns uri, line, and character for a valid symbolId
statusReason: expected undefined to deeply equal { uriStr: 'file:///a.ts', …(2) }

[Killed] LogicalOperator
src/core/lspCallGraphParsing.ts:18:30
   const rest = symbolId.slice(hash + 1);
   const parts = rest.split(":");
   const line = Number.parseInt(parts[0] ?? "", 10);
-  const ch = Number.parseInt(parts[1] ?? "", 10);
+  const ch = Number.parseInt(parts[1] && "", 10);
   if (Number.isNaN(line) || Number.isNaN(ch)) {
     return undefined;
killedBy: parseSymbolIdParts returns uri, line, and character for a valid symbolId
statusReason: expected undefined to deeply equal { uriStr: 'file:///a.ts', …(2) }

[Killed] ConditionalExpression
src/core/lspCallGraphParsing.ts:19:7
   const parts = rest.split(":");
   const line = Number.parseInt(parts[0] ?? "", 10);
   const ch = Number.parseInt(parts[1] ?? "", 10);
-  if (Number.isNaN(line) || Number.isNaN(ch)) {
+  if (true) {
     return undefined;
   }
killedBy: parseSymbolIdParts returns uri, line, and character for a valid symbolId
statusReason: expected undefined to deeply equal { uriStr: 'file:///a.ts', …(2) }

[Killed] BlockStatement
src/core/lspCallGraphParsing.ts:19:47
   const parts = rest.split(":");
   const line = Number.parseInt(parts[0] ?? "", 10);
   const ch = Number.parseInt(parts[1] ?? "", 10);
-  if (Number.isNaN(line) || Number.isNaN(ch)) {
-    return undefined;
-  }
+  if (Number.isNaN(line) || Number.isNaN(ch)) {}
   return { uriStr, line, ch };
 }
killedBy: parseSymbolIdParts returns undefined when line is non-numeric
statusReason: expected { uriStr: 'file:///a.ts', …(2) } to be undefined
