[NoCoverage] ObjectLiteral
src/core/ports.ts:93:35
 }
 
 /** No-op logger for tests and contexts where logging isn't needed. */
-export const nullLogger: Logger = {
-  info() {},
-  warn() {},
-  error() {},
-};
+export const nullLogger: Logger = {};
 
