[Killed] BlockStatement
src/ddp/cc/eslintParse.ts:5:7
 
 export function parseEslintComplexityJson(jsonText: string): Map<number, number> {
   const byLine = new Map<number, number>();
-  try {
-    const arr = JSON.parse(jsonText) as EslintJson[];
-    if (!Array.isArray(arr)) {
-      return byLine;
-    }
-    for (const file of arr) {
-      for (const msg of file.messages ?? []) {
-        const rid = msg.ruleId ?? "";
-        if (
-          (rid !== "complexity" && rid !== "@typescript-eslint/complexity") ||
-          typeof msg.line !== "number"
-        ) {
-          continue;
-        }
-        const n = parseComplexityFromMessage(msg.message ?? "");
-        if (n !== undefined) {
-          const prev = byLine.get(msg.line) ?? 0;
-          byLine.set(msg.line, Math.max(prev, n));
-        }
-      }
-    }
-  } catch {
+  try {} catch {
     /* ignore */
   }
killedBy: runEslintComplexity returns parsed map when ESLint produces valid JSON output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/eslintParse.ts:7:9
   const byLine = new Map<number, number>();
   try {
     const arr = JSON.parse(jsonText) as EslintJson[];
-    if (!Array.isArray(arr)) {
+    if (true) {
       return byLine;
     }
killedBy: runEslintComplexity returns parsed map when ESLint produces valid JSON output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] BooleanLiteral
src/ddp/cc/eslintParse.ts:7:9
   const byLine = new Map<number, number>();
   try {
     const arr = JSON.parse(jsonText) as EslintJson[];
-    if (!Array.isArray(arr)) {
+    if (Array.isArray(arr)) {
       return byLine;
     }
killedBy: runEslintComplexity returns parsed map when ESLint produces valid JSON output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] BlockStatement
src/ddp/cc/eslintParse.ts:10:29
     if (!Array.isArray(arr)) {
       return byLine;
     }
-    for (const file of arr) {
-      for (const msg of file.messages ?? []) {
-        const rid = msg.ruleId ?? "";
-        if (
-          (rid !== "complexity" && rid !== "@typescript-eslint/complexity") ||
-          typeof msg.line !== "number"
-        ) {
-          continue;
-        }
-        const n = parseComplexityFromMessage(msg.message ?? "");
-        if (n !== undefined) {
-          const prev = byLine.get(msg.line) ?? 0;
-          byLine.set(msg.line, Math.max(prev, n));
-        }
-      }
-    }
+    for (const file of arr) {}
   } catch {
     /* ignore */
killedBy: runEslintComplexity returns parsed map when ESLint produces valid JSON output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] LogicalOperator
src/ddp/cc/eslintParse.ts:11:25
       return byLine;
     }
     for (const file of arr) {
-      for (const msg of file.messages ?? []) {
+      for (const msg of file.messages && []) {
         const rid = msg.ruleId ?? "";
         if (
killedBy: runEslintComplexity returns parsed map when ESLint produces valid JSON output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] BlockStatement
src/ddp/cc/eslintParse.ts:11:46
       return byLine;
     }
     for (const file of arr) {
-      for (const msg of file.messages ?? []) {
-        const rid = msg.ruleId ?? "";
-        if (
-          (rid !== "complexity" && rid !== "@typescript-eslint/complexity") ||
-          typeof msg.line !== "number"
-        ) {
-          continue;
-        }
-        const n = parseComplexityFromMessage(msg.message ?? "");
-        if (n !== undefined) {
-          const prev = byLine.get(msg.line) ?? 0;
-          byLine.set(msg.line, Math.max(prev, n));
-        }
-      }
+      for (const msg of file.messages ?? []) {}
     }
   } catch {
killedBy: runEslintComplexity returns parsed map when ESLint produces valid JSON output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] LogicalOperator
src/ddp/cc/eslintParse.ts:12:21
     }
     for (const file of arr) {
       for (const msg of file.messages ?? []) {
-        const rid = msg.ruleId ?? "";
+        const rid = msg.ruleId && "";
         if (
           (rid !== "complexity" && rid !== "@typescript-eslint/complexity") ||
killedBy: runEslintComplexity returns parsed map when ESLint produces valid JSON output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/eslintParse.ts:14:11
       for (const msg of file.messages ?? []) {
         const rid = msg.ruleId ?? "";
         if (
-          (rid !== "complexity" && rid !== "@typescript-eslint/complexity") ||
-          typeof msg.line !== "number"
+          false
         ) {
           continue;
killedBy: parseEslintComplexityJson skips messages with non-complexity ruleId
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/eslintParse.ts:14:12
       for (const msg of file.messages ?? []) {
         const rid = msg.ruleId ?? "";
         if (
-          (rid !== "complexity" && rid !== "@typescript-eslint/complexity") ||
+          (false) ||
           typeof msg.line !== "number"
         ) {
killedBy: parseEslintComplexityJson skips messages with non-complexity ruleId
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/ddp/cc/eslintParse.ts:15:11
         const rid = msg.ruleId ?? "";
         if (
           (rid !== "complexity" && rid !== "@typescript-eslint/complexity") ||
-          typeof msg.line !== "number"
+          typeof msg.line === "number"
         ) {
           continue;
killedBy: parseEslintComplexityJson maps line to complexity from complexity rule
statusReason: expected undefined to be 7 // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/eslintParse.ts:15:11
         const rid = msg.ruleId ?? "";
         if (
           (rid !== "complexity" && rid !== "@typescript-eslint/complexity") ||
-          typeof msg.line !== "number"
+          false
         ) {
           continue;
killedBy: parseEslintComplexityJson skips messages with non-number line
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/ddp/cc/eslintParse.ts:16:11
         if (
           (rid !== "complexity" && rid !== "@typescript-eslint/complexity") ||
           typeof msg.line !== "number"
-        ) {
-          continue;
-        }
+        ) {}
         const n = parseComplexityFromMessage(msg.message ?? "");
         if (n !== undefined) {
killedBy: parseEslintComplexityJson skips messages with non-complexity ruleId
statusReason: expected 1 to be +0 // Object.is equality

[Killed] LogicalOperator
src/ddp/cc/eslintParse.ts:19:46
         ) {
           continue;
         }
-        const n = parseComplexityFromMessage(msg.message ?? "");
+        const n = parseComplexityFromMessage(msg.message && "");
         if (n !== undefined) {
           const prev = byLine.get(msg.line) ?? 0;
killedBy: parseEslintComplexityJson maps line to complexity from complexity rule
statusReason: expected undefined to be 7 // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/eslintParse.ts:20:13
           continue;
         }
         const n = parseComplexityFromMessage(msg.message ?? "");
-        if (n !== undefined) {
+        if (true) {
           const prev = byLine.get(msg.line) ?? 0;
           byLine.set(msg.line, Math.max(prev, n));
killedBy: parseEslintComplexityJson skips messages where complexity cannot be parsed from text
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/ddp/cc/eslintParse.ts:20:30
           continue;
         }
         const n = parseComplexityFromMessage(msg.message ?? "");
-        if (n !== undefined) {
-          const prev = byLine.get(msg.line) ?? 0;
-          byLine.set(msg.line, Math.max(prev, n));
-        }
+        if (n !== undefined) {}
       }
     }
killedBy: parseEslintComplexityJson maps line to complexity from complexity rule
statusReason: expected undefined to be 7 // Object.is equality

[Killed] LogicalOperator
src/ddp/cc/eslintParse.ts:21:24
         }
         const n = parseComplexityFromMessage(msg.message ?? "");
         if (n !== undefined) {
-          const prev = byLine.get(msg.line) ?? 0;
+          const prev = byLine.get(msg.line) && 0;
           byLine.set(msg.line, Math.max(prev, n));
         }
killedBy: parseEslintComplexityJson maps line to complexity from complexity rule
statusReason: expected NaN to be 7 // Object.is equality

[Killed] MethodExpression
src/ddp/cc/eslintParse.ts:22:32
         const n = parseComplexityFromMessage(msg.message ?? "");
         if (n !== undefined) {
           const prev = byLine.get(msg.line) ?? 0;
-          byLine.set(msg.line, Math.max(prev, n));
+          byLine.set(msg.line, Math.min(prev, n));
         }
       }
killedBy: parseEslintComplexityJson maps line to complexity from complexity rule
statusReason: expected +0 to be 7 // Object.is equality

[Killed] BlockStatement
src/ddp/cc/eslintParse.ts:33:81
 }
 
 /** ESLint complexity message often like "Function 'foo' has a complexity of 12." */
-export function parseComplexityFromMessage(message: string): number | undefined {
-  const m = message.match(/complexity of (\d+)/i);
-  if (m) {
-    return parseInt(m[1], 10);
-  }
-  return undefined;
-}
+export function parseComplexityFromMessage(message: string): number | undefined {}
 
killedBy: parseComplexityFromMessage extracts complexity number
statusReason: expected undefined to be 12 // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/eslintParse.ts:35:7
 /** ESLint complexity message often like "Function 'foo' has a complexity of 12." */
 export function parseComplexityFromMessage(message: string): number | undefined {
   const m = message.match(/complexity of (\d+)/i);
-  if (m) {
+  if (false) {
     return parseInt(m[1], 10);
   }
killedBy: parseComplexityFromMessage extracts complexity number
statusReason: expected undefined to be 12 // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/eslintParse.ts:35:7
 /** ESLint complexity message often like "Function 'foo' has a complexity of 12." */
 export function parseComplexityFromMessage(message: string): number | undefined {
   const m = message.match(/complexity of (\d+)/i);
-  if (m) {
+  if (true) {
     return parseInt(m[1], 10);
   }
killedBy: parseComplexityFromMessage returns undefined for non-matching message
statusReason: Cannot read properties of null (reading '1')
