[Killed] BlockStatement
src/ddp/coverageStore.ts:9:97
 
 export { CoverageStore } from "../core/coverageStore";
 
-function resolveLcovSfToUri(folder: vscode.WorkspaceFolder, sf: string): vscode.Uri | undefined {
-  const trimmed = sf.trim();
-  if (!trimmed) {
-    return undefined;
-  }
-  const normalized = trimmed.replaceAll("\\", "/");
-  try {
-    if (/^[A-Za-z]:\//u.exec(normalized)) {
-      return vscode.Uri.file(normalized.replaceAll("/", "\\"));
-    }
-    if (normalized.startsWith("/")) {
-      return vscode.Uri.file(trimmed);
-    }
-  } catch (e) {
-    console.debug(`[DDP] Failed to parse LCOV path '${sf}':`, e);
-  }
-  return normalizeLcovPathToUri(folder, trimmed);
-}
+function resolveLcovSfToUri(folder: vscode.WorkspaceFolder, sf: string): vscode.Uri | undefined {}
 
 export async function loadLcovIntoStore(
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: expected undefined to be defined

[Survived] MethodExpression
src/ddp/coverageStore.ts:10:19
 export { CoverageStore } from "../core/coverageStore";
 
 function resolveLcovSfToUri(folder: vscode.WorkspaceFolder, sf: string): vscode.Uri | undefined {
-  const trimmed = sf.trim();
+  const trimmed = sf;
   if (!trimmed) {
     return undefined;

[Killed] ConditionalExpression
src/ddp/coverageStore.ts:11:7
 
 function resolveLcovSfToUri(folder: vscode.WorkspaceFolder, sf: string): vscode.Uri | undefined {
   const trimmed = sf.trim();
-  if (!trimmed) {
+  if (true) {
     return undefined;
   }
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/ddp/coverageStore.ts:11:7
 
 function resolveLcovSfToUri(folder: vscode.WorkspaceFolder, sf: string): vscode.Uri | undefined {
   const trimmed = sf.trim();
-  if (!trimmed) {
+  if (trimmed) {
     return undefined;
   }
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/ddp/coverageStore.ts:14:41
   if (!trimmed) {
     return undefined;
   }
-  const normalized = trimmed.replaceAll("\\", "/");
+  const normalized = trimmed.replaceAll("", "/");
   try {
     if (/^[A-Za-z]:\//u.exec(normalized)) {
killedBy: loadLcovIntoStore resolves relative path via normalizeLcovPathToUri fallback
statusReason: expected "vi.fn()" to be called with arguments: [ { uri: Uri{ …(3) }, …(2) }, …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/ddp/coverageStore.ts:15:7
     return undefined;
   }
   const normalized = trimmed.replaceAll("\\", "/");
-  try {
-    if (/^[A-Za-z]:\//u.exec(normalized)) {
-      return vscode.Uri.file(normalized.replaceAll("/", "\\"));
-    }
-    if (normalized.startsWith("/")) {
-      return vscode.Uri.file(trimmed);
-    }
-  } catch (e) {
+  try {} catch (e) {
     console.debug(`[DDP] Failed to parse LCOV path '${sf}':`, e);
   }
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/ddp/coverageStore.ts:16:9
   }
   const normalized = trimmed.replaceAll("\\", "/");
   try {
-    if (/^[A-Za-z]:\//u.exec(normalized)) {
+    if (true) {
       return vscode.Uri.file(normalized.replaceAll("/", "\\"));
     }
killedBy: loadLcovIntoStore resolves relative path via normalizeLcovPathToUri fallback
statusReason: expected "vi.fn()" to be called with arguments: [ { uri: Uri{ …(3) }, …(2) }, …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/ddp/coverageStore.ts:16:43
   }
   const normalized = trimmed.replaceAll("\\", "/");
   try {
-    if (/^[A-Za-z]:\//u.exec(normalized)) {
-      return vscode.Uri.file(normalized.replaceAll("/", "\\"));
-    }
+    if (/^[A-Za-z]:\//u.exec(normalized)) {}
     if (normalized.startsWith("/")) {
       return vscode.Uri.file(trimmed);
killedBy: loadLcovIntoStore resolves Windows absolute path (C:\src\a.ts) to Uri.file
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/ddp/coverageStore.ts:17:52
   const normalized = trimmed.replaceAll("\\", "/");
   try {
     if (/^[A-Za-z]:\//u.exec(normalized)) {
-      return vscode.Uri.file(normalized.replaceAll("/", "\\"));
+      return vscode.Uri.file(normalized.replaceAll("", "\\"));
     }
     if (normalized.startsWith("/")) {
killedBy: loadLcovIntoStore resolves Windows absolute path (C:\src\a.ts) to Uri.file
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/ddp/coverageStore.ts:17:57
   const normalized = trimmed.replaceAll("\\", "/");
   try {
     if (/^[A-Za-z]:\//u.exec(normalized)) {
-      return vscode.Uri.file(normalized.replaceAll("/", "\\"));
+      return vscode.Uri.file(normalized.replaceAll("/", ""));
     }
     if (normalized.startsWith("/")) {
killedBy: loadLcovIntoStore resolves Windows absolute path (C:\src\a.ts) to Uri.file
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/ddp/coverageStore.ts:19:9
     if (/^[A-Za-z]:\//u.exec(normalized)) {
       return vscode.Uri.file(normalized.replaceAll("/", "\\"));
     }
-    if (normalized.startsWith("/")) {
+    if (true) {
       return vscode.Uri.file(trimmed);
     }
killedBy: loadLcovIntoStore resolves relative path via normalizeLcovPathToUri fallback
statusReason: expected "vi.fn()" to be called with arguments: [ { uri: Uri{ …(3) }, …(2) }, …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/ddp/coverageStore.ts:19:37
     if (/^[A-Za-z]:\//u.exec(normalized)) {
       return vscode.Uri.file(normalized.replaceAll("/", "\\"));
     }
-    if (normalized.startsWith("/")) {
-      return vscode.Uri.file(trimmed);
-    }
+    if (normalized.startsWith("/")) {}
   } catch (e) {
     console.debug(`[DDP] Failed to parse LCOV path '${sf}':`, e);
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: expected undefined to be defined

[NoCoverage] BlockStatement
src/ddp/coverageStore.ts:22:15
     if (normalized.startsWith("/")) {
       return vscode.Uri.file(trimmed);
     }
-  } catch (e) {
-    console.debug(`[DDP] Failed to parse LCOV path '${sf}':`, e);
-  }
+  } catch (e) {}
   return normalizeLcovPathToUri(folder, trimmed);
 }

[Killed] BlockStatement
src/ddp/coverageStore.ts:32:18
   store: CoverageStore,
   pattern: string,
   token: vscode.CancellationToken
-): Promise<void> {
-  const folders = vscode.workspace.workspaceFolders;
-  if (!folders?.length) {
-    return;
-  }
-  const maps: Map<string, StatementCover[]>[] = [];
-  for (const folder of folders) {
-    if (token.isCancellationRequested) {
-      break;
-    }
-    const folderMaps = await loadLcovFromFolder(folder, pattern, token);
-    maps.push(...folderMaps);
-  }
-  const merged = mergeLcovMaps(maps);
-  for (const [k, v] of merged) {
-    store.ingestStatementCovers(vscode.Uri.parse(k).toString(), v);
-  }
-}
+): Promise<void> {}
 
 async function loadLcovFromFolder(
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/ddp/coverageStore.ts:34:25
   token: vscode.CancellationToken
 ): Promise<void> {
   const folders = vscode.workspace.workspaceFolders;
-  if (!folders?.length) {
-    return;
-  }
+  if (!folders?.length) {}
   const maps: Map<string, StatementCover[]>[] = [];
   for (const folder of folders) {
killedBy: loadLcovIntoStore does not clear store before loading (caller responsibility)
statusReason: folders is not iterable

[Killed] ConditionalExpression
src/ddp/coverageStore.ts:34:7
   token: vscode.CancellationToken
 ): Promise<void> {
   const folders = vscode.workspace.workspaceFolders;
-  if (!folders?.length) {
+  if (false) {
     return;
   }
killedBy: loadLcovIntoStore does not clear store before loading (caller responsibility)
statusReason: folders is not iterable

[Killed] BlockStatement
src/ddp/coverageStore.ts:38:33
     return;
   }
   const maps: Map<string, StatementCover[]>[] = [];
-  for (const folder of folders) {
-    if (token.isCancellationRequested) {
-      break;
-    }
-    const folderMaps = await loadLcovFromFolder(folder, pattern, token);
-    maps.push(...folderMaps);
-  }
+  for (const folder of folders) {}
   const merged = mergeLcovMaps(maps);
   for (const [k, v] of merged) {
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/ddp/coverageStore.ts:39:9
   }
   const maps: Map<string, StatementCover[]>[] = [];
   for (const folder of folders) {
-    if (token.isCancellationRequested) {
+    if (true) {
       break;
     }
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/ddp/coverageStore.ts:39:40
   }
   const maps: Map<string, StatementCover[]>[] = [];
   for (const folder of folders) {
-    if (token.isCancellationRequested) {
-      break;
-    }
+    if (token.isCancellationRequested) {}
     const folderMaps = await loadLcovFromFolder(folder, pattern, token);
     maps.push(...folderMaps);
killedBy: loadLcovIntoStore stops processing folders when cancellation token is triggered
statusReason: expected "vi.fn()" to not be called at all, but actually been called 2 times

Received:

  1st vi.fn() call:

    Array [
      RelativePattern {

[Killed] BlockStatement
src/ddp/coverageStore.ts:46:32
     maps.push(...folderMaps);
   }
   const merged = mergeLcovMaps(maps);
-  for (const [k, v] of merged) {
-    store.ingestStatementCovers(vscode.Uri.parse(k).toString(), v);
-  }
+  for (const [k, v] of merged) {}
 }
 
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/ddp/coverageStore.ts:55:45
   folder: vscode.WorkspaceFolder,
   pattern: string,
   token: vscode.CancellationToken
-): Promise<Map<string, StatementCover[]>[]> {
-  const maps: Map<string, StatementCover[]>[] = [];
-  const files = await vscode.workspace.findFiles(
-    new vscode.RelativePattern(folder, pattern),
-    "**/node_modules/**",
-    50
-  );
-  for (const file of files) {
-    if (token.isCancellationRequested) {
-      break;
-    }
-    const buf = await vscode.workspace.fs.readFile(file);
-    const text = Buffer.from(buf).toString("utf8");
-    const parsed = parseLcovToStatementCovers(text);
-    const resolved = new Map<string, StatementCover[]>();
-    for (const [sf, stmts] of parsed) {
-      const uri = resolveLcovSfToUri(folder, sf);
-      if (uri) {
-        resolved.set(uri.toString(), stmts);
-      }
-    }
-    maps.push(resolved);
-  }
-  return maps;
-}
+): Promise<Map<string, StatementCover[]>[]> {}
 
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: folderMaps is not iterable (cannot read property undefined)

[Killed] StringLiteral
src/ddp/coverageStore.ts:59:5
   const maps: Map<string, StatementCover[]>[] = [];
   const files = await vscode.workspace.findFiles(
     new vscode.RelativePattern(folder, pattern),
-    "**/node_modules/**",
+    "",
     50
   );
killedBy: loadLcovIntoStore bugmagnet session 2026-04-16 complex interactions excludes node_modules in findFiles call
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, '**/node_modules/**', 50 ]

Received:

  1st vi.fn() call:

  [
-   Anything,

[Killed] BlockStatement
src/ddp/coverageStore.ts:62:29
     "**/node_modules/**",
     50
   );
-  for (const file of files) {
-    if (token.isCancellationRequested) {
-      break;
-    }
-    const buf = await vscode.workspace.fs.readFile(file);
-    const text = Buffer.from(buf).toString("utf8");
-    const parsed = parseLcovToStatementCovers(text);
-    const resolved = new Map<string, StatementCover[]>();
-    for (const [sf, stmts] of parsed) {
-      const uri = resolveLcovSfToUri(folder, sf);
-      if (uri) {
-        resolved.set(uri.toString(), stmts);
-      }
-    }
-    maps.push(resolved);
-  }
+  for (const file of files) {}
   return maps;
 }
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/ddp/coverageStore.ts:63:9
     50
   );
   for (const file of files) {
-    if (token.isCancellationRequested) {
+    if (true) {
       break;
     }
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/ddp/coverageStore.ts:63:40
     50
   );
   for (const file of files) {
-    if (token.isCancellationRequested) {
-      break;
-    }
+    if (token.isCancellationRequested) {}
     const buf = await vscode.workspace.fs.readFile(file);
     const text = Buffer.from(buf).toString("utf8");
killedBy: loadLcovIntoStore stops processing files when cancellation token is triggered between files
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/ddp/coverageStore.ts:70:39
     const text = Buffer.from(buf).toString("utf8");
     const parsed = parseLcovToStatementCovers(text);
     const resolved = new Map<string, StatementCover[]>();
-    for (const [sf, stmts] of parsed) {
-      const uri = resolveLcovSfToUri(folder, sf);
-      if (uri) {
-        resolved.set(uri.toString(), stmts);
-      }
-    }
+    for (const [sf, stmts] of parsed) {}
     maps.push(resolved);
   }
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/ddp/coverageStore.ts:72:11
     const resolved = new Map<string, StatementCover[]>();
     for (const [sf, stmts] of parsed) {
       const uri = resolveLcovSfToUri(folder, sf);
-      if (uri) {
+      if (false) {
         resolved.set(uri.toString(), stmts);
       }
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/ddp/coverageStore.ts:72:11
     const resolved = new Map<string, StatementCover[]>();
     for (const [sf, stmts] of parsed) {
       const uri = resolveLcovSfToUri(folder, sf);
-      if (uri) {
+      if (true) {
         resolved.set(uri.toString(), stmts);
       }
killedBy: loadLcovIntoStore bugmagnet session 2026-04-16 path resolution edge cases skips entry when normalizeLcovPathToUri returns undefined for relative path
statusReason: Cannot read properties of undefined (reading 'toString')
