[NoCoverage] ObjectLiteral
src/ddp/register.ts:15:3
 
 const selector: vscode.DocumentSelector = [
   { scheme: "file", language: "typescript" },
-  { scheme: "file", language: "javascript" },
+  {},
   { scheme: "file", language: "typescriptreact" },
   { scheme: "file", language: "javascriptreact" },

[NoCoverage] StringLiteral
src/ddp/register.ts:15:31
 
 const selector: vscode.DocumentSelector = [
   { scheme: "file", language: "typescript" },
-  { scheme: "file", language: "javascript" },
+  { scheme: "file", language: "" },
   { scheme: "file", language: "typescriptreact" },
   { scheme: "file", language: "javascriptreact" },

[NoCoverage] StringLiteral
src/ddp/register.ts:16:13
 const selector: vscode.DocumentSelector = [
   { scheme: "file", language: "typescript" },
   { scheme: "file", language: "javascript" },
-  { scheme: "file", language: "typescriptreact" },
+  { scheme: "", language: "typescriptreact" },
   { scheme: "file", language: "javascriptreact" },
   { scheme: "file", language: "python" },

[NoCoverage] StringLiteral
src/ddp/register.ts:16:31
 const selector: vscode.DocumentSelector = [
   { scheme: "file", language: "typescript" },
   { scheme: "file", language: "javascript" },
-  { scheme: "file", language: "typescriptreact" },
+  { scheme: "file", language: "" },
   { scheme: "file", language: "javascriptreact" },
   { scheme: "file", language: "python" },

[NoCoverage] StringLiteral
src/ddp/register.ts:18:31
   { scheme: "file", language: "javascript" },
   { scheme: "file", language: "typescriptreact" },
   { scheme: "file", language: "javascriptreact" },
-  { scheme: "file", language: "python" },
+  { scheme: "file", language: "" },
   { scheme: "file", language: "java" },
 ];

[NoCoverage] StringLiteral
src/ddp/register.ts:19:31
   { scheme: "file", language: "typescriptreact" },
   { scheme: "file", language: "javascriptreact" },
   { scheme: "file", language: "python" },
-  { scheme: "file", language: "java" },
+  { scheme: "file", language: "" },
 ];
 

[NoCoverage] BlockStatement
src/ddp/register.ts:26:27
   const state = new ExtensionState();
   const analysisService = new AnalysisService();
   const tree = new RiskTreeProvider(state);
-  const getConfig = () => {
-    const raw = vscode.workspace.getConfiguration("ddp");
-    return buildConfiguration(<T>(key: string, def: T) => raw.get<T>(key, def));
-  };
+  const getConfig = () => {};
   const deco = new DecorationManager(state, () => getConfig().decoration);
   const codeLens = new DdpCodeLensProvider(state, getConfig);

[NoCoverage] ArrowFunction
src/ddp/register.ts:28:31
   const tree = new RiskTreeProvider(state);
   const getConfig = () => {
     const raw = vscode.workspace.getConfiguration("ddp");
-    return buildConfiguration(<T>(key: string, def: T) => raw.get<T>(key, def));
+    return buildConfiguration(() => undefined);
   };
   const deco = new DecorationManager(state, () => getConfig().decoration);

[NoCoverage] ArrowFunction
src/ddp/register.ts:30:45
     const raw = vscode.workspace.getConfiguration("ddp");
     return buildConfiguration(<T>(key: string, def: T) => raw.get<T>(key, def));
   };
-  const deco = new DecorationManager(state, () => getConfig().decoration);
+  const deco = new DecorationManager(state, () => undefined);
   const codeLens = new DdpCodeLensProvider(state, getConfig);
   const hover = new DdpHoverProvider(state);

[NoCoverage] StringLiteral
src/ddp/register.ts:34:49
   const codeLens = new DdpCodeLensProvider(state, getConfig);
   const hover = new DdpHoverProvider(state);
 
-  const treeView = vscode.window.createTreeView("ddp.riskView", {
+  const treeView = vscode.window.createTreeView("", {
     treeDataProvider: tree,
     showCollapseAll: true,

[NoCoverage] ObjectLiteral
src/ddp/register.ts:34:65
   const codeLens = new DdpCodeLensProvider(state, getConfig);
   const hover = new DdpHoverProvider(state);
 
-  const treeView = vscode.window.createTreeView("ddp.riskView", {
-    treeDataProvider: tree,
-    showCollapseAll: true,
-  });
+  const treeView = vscode.window.createTreeView("ddp.riskView", {});
   context.subscriptions.push(treeView);
 

[NoCoverage] BooleanLiteral
src/ddp/register.ts:36:22
 
   const treeView = vscode.window.createTreeView("ddp.riskView", {
     treeDataProvider: tree,
-    showCollapseAll: true,
+    showCollapseAll: false,
   });
   context.subscriptions.push(treeView);

[NoCoverage] ArrowFunction
src/ddp/register.ts:41:5
   context.subscriptions.push(treeView);
 
   const analyzeCmd = new AnalyzeCommand(
-    (token, scope) => analysisService.analyze(token, scope),
+    () => undefined,
     state,
     {

[NoCoverage] ObjectLiteral
src/ddp/register.ts:43:5
   const analyzeCmd = new AnalyzeCommand(
     (token, scope) => analysisService.analyze(token, scope),
     state,
-    {
-      refreshTree: () => tree.refresh(),
-      invalidateCodeLens: () => codeLens.invalidate(),
-      applyDecorations: () => {
-        for (const ed of vscode.window.visibleTextEditors) {
-          deco.applyActiveEditor(ed);
-        }
-      },
-    }
+    {}
   );
 

[NoCoverage] ArrowFunction
src/ddp/register.ts:44:20
     (token, scope) => analysisService.analyze(token, scope),
     state,
     {
-      refreshTree: () => tree.refresh(),
+      refreshTree: () => undefined,
       invalidateCodeLens: () => codeLens.invalidate(),
       applyDecorations: () => {

[NoCoverage] ArrowFunction
src/ddp/register.ts:45:27
     state,
     {
       refreshTree: () => tree.refresh(),
-      invalidateCodeLens: () => codeLens.invalidate(),
+      invalidateCodeLens: () => undefined,
       applyDecorations: () => {
         for (const ed of vscode.window.visibleTextEditors) {

[NoCoverage] BlockStatement
src/ddp/register.ts:46:31
     {
       refreshTree: () => tree.refresh(),
       invalidateCodeLens: () => codeLens.invalidate(),
-      applyDecorations: () => {
-        for (const ed of vscode.window.visibleTextEditors) {
-          deco.applyActiveEditor(ed);
-        }
-      },
+      applyDecorations: () => {},
     }
   );

[NoCoverage] BlockStatement
src/ddp/register.ts:47:60
       refreshTree: () => tree.refresh(),
       invalidateCodeLens: () => codeLens.invalidate(),
       applyDecorations: () => {
-        for (const ed of vscode.window.visibleTextEditors) {
-          deco.applyActiveEditor(ed);
-        }
+        for (const ed of vscode.window.visibleTextEditors) {}
       },
     }

[NoCoverage] ArrowFunction
src/ddp/register.ts:55:61
   );
 
   context.subscriptions.push(
-    vscode.commands.registerCommand("ddp.analyzeWorkspace", () => analyzeCmd.execute()),
+    vscode.commands.registerCommand("ddp.analyzeWorkspace", () => undefined),
     vscode.commands.registerCommand("ddp.analyzeFolder", async () => {
       const folders = await vscode.window.showOpenDialog({

[NoCoverage] BlockStatement
src/ddp/register.ts:56:70
 
   context.subscriptions.push(
     vscode.commands.registerCommand("ddp.analyzeWorkspace", () => analyzeCmd.execute()),
-    vscode.commands.registerCommand("ddp.analyzeFolder", async () => {
-      const folders = await vscode.window.showOpenDialog({
-        canSelectFolders: true,
-        canSelectFiles: false,
-        canSelectMany: false,
-        openLabel: "Analyze Folder",
-        defaultUri: vscode.workspace.workspaceFolders?.[0]?.uri,
-      });
-      if (!folders?.length) {
-        return;
-      }
-      const scope: AnalysisScope = { rootUri: folders[0].toString() };
-      return analyzeCmd.execute(scope);
-    }),
+    vscode.commands.registerCommand("ddp.analyzeFolder", async () => {}),
     vscode.commands.registerCommand("ddp.refresh", () => analyzeCmd.execute(state.lastScope)),
     vscode.commands.registerCommand("ddp.riskView.refresh", () => analyzeCmd.execute(state.lastScope)),

[NoCoverage] StringLiteral
src/ddp/register.ts:56:37
 
   context.subscriptions.push(
     vscode.commands.registerCommand("ddp.analyzeWorkspace", () => analyzeCmd.execute()),
-    vscode.commands.registerCommand("ddp.analyzeFolder", async () => {
+    vscode.commands.registerCommand("", async () => {
       const folders = await vscode.window.showOpenDialog({
         canSelectFolders: true,

[NoCoverage] BooleanLiteral
src/ddp/register.ts:58:27
     vscode.commands.registerCommand("ddp.analyzeWorkspace", () => analyzeCmd.execute()),
     vscode.commands.registerCommand("ddp.analyzeFolder", async () => {
       const folders = await vscode.window.showOpenDialog({
-        canSelectFolders: true,
+        canSelectFolders: false,
         canSelectFiles: false,
         canSelectMany: false,

[NoCoverage] BooleanLiteral
src/ddp/register.ts:59:25
     vscode.commands.registerCommand("ddp.analyzeFolder", async () => {
       const folders = await vscode.window.showOpenDialog({
         canSelectFolders: true,
-        canSelectFiles: false,
+        canSelectFiles: true,
         canSelectMany: false,
         openLabel: "Analyze Folder",

[NoCoverage] BooleanLiteral
src/ddp/register.ts:60:24
       const folders = await vscode.window.showOpenDialog({
         canSelectFolders: true,
         canSelectFiles: false,
-        canSelectMany: false,
+        canSelectMany: true,
         openLabel: "Analyze Folder",
         defaultUri: vscode.workspace.workspaceFolders?.[0]?.uri,

[NoCoverage] StringLiteral
src/ddp/register.ts:61:20
         canSelectFolders: true,
         canSelectFiles: false,
         canSelectMany: false,
-        openLabel: "Analyze Folder",
+        openLabel: "",
         defaultUri: vscode.workspace.workspaceFolders?.[0]?.uri,
       });

[NoCoverage] OptionalChaining
src/ddp/register.ts:62:21
         canSelectFiles: false,
         canSelectMany: false,
         openLabel: "Analyze Folder",
-        defaultUri: vscode.workspace.workspaceFolders?.[0]?.uri,
+        defaultUri: vscode.workspace.workspaceFolders?.[0].uri,
       });
       if (!folders?.length) {

[NoCoverage] OptionalChaining
src/ddp/register.ts:62:21
         canSelectFiles: false,
         canSelectMany: false,
         openLabel: "Analyze Folder",
-        defaultUri: vscode.workspace.workspaceFolders?.[0]?.uri,
+        defaultUri: vscode.workspace.workspaceFolders[0]?.uri,
       });
       if (!folders?.length) {

[NoCoverage] ConditionalExpression
src/ddp/register.ts:64:11
         openLabel: "Analyze Folder",
         defaultUri: vscode.workspace.workspaceFolders?.[0]?.uri,
       });
-      if (!folders?.length) {
+      if (true) {
         return;
       }

[NoCoverage] BooleanLiteral
src/ddp/register.ts:64:11
         openLabel: "Analyze Folder",
         defaultUri: vscode.workspace.workspaceFolders?.[0]?.uri,
       });
-      if (!folders?.length) {
+      if (folders?.length) {
         return;
       }

[NoCoverage] ArrowFunction
src/ddp/register.ts:70:52
       const scope: AnalysisScope = { rootUri: folders[0].toString() };
       return analyzeCmd.execute(scope);
     }),
-    vscode.commands.registerCommand("ddp.refresh", () => analyzeCmd.execute(state.lastScope)),
+    vscode.commands.registerCommand("ddp.refresh", () => undefined),
     vscode.commands.registerCommand("ddp.riskView.refresh", () => analyzeCmd.execute(state.lastScope)),
     vscode.commands.registerCommand("ddp.revealSymbol", (id: string) => revealSymbolById(id)),

[NoCoverage] StringLiteral
src/ddp/register.ts:70:37
       const scope: AnalysisScope = { rootUri: folders[0].toString() };
       return analyzeCmd.execute(scope);
     }),
-    vscode.commands.registerCommand("ddp.refresh", () => analyzeCmd.execute(state.lastScope)),
+    vscode.commands.registerCommand("", () => analyzeCmd.execute(state.lastScope)),
     vscode.commands.registerCommand("ddp.riskView.refresh", () => analyzeCmd.execute(state.lastScope)),
     vscode.commands.registerCommand("ddp.revealSymbol", (id: string) => revealSymbolById(id)),

[NoCoverage] ArrowFunction
src/ddp/register.ts:71:61
       return analyzeCmd.execute(scope);
     }),
     vscode.commands.registerCommand("ddp.refresh", () => analyzeCmd.execute(state.lastScope)),
-    vscode.commands.registerCommand("ddp.riskView.refresh", () => analyzeCmd.execute(state.lastScope)),
+    vscode.commands.registerCommand("ddp.riskView.refresh", () => undefined),
     vscode.commands.registerCommand("ddp.revealSymbol", (id: string) => revealSymbolById(id)),
     vscode.commands.registerCommand("ddp.riskView.openFile", (uri: vscode.Uri) => openDocument(uri)),

[NoCoverage] StringLiteral
src/ddp/register.ts:71:37
       return analyzeCmd.execute(scope);
     }),
     vscode.commands.registerCommand("ddp.refresh", () => analyzeCmd.execute(state.lastScope)),
-    vscode.commands.registerCommand("ddp.riskView.refresh", () => analyzeCmd.execute(state.lastScope)),
+    vscode.commands.registerCommand("", () => analyzeCmd.execute(state.lastScope)),
     vscode.commands.registerCommand("ddp.revealSymbol", (id: string) => revealSymbolById(id)),
     vscode.commands.registerCommand("ddp.riskView.openFile", (uri: vscode.Uri) => openDocument(uri)),

[NoCoverage] ArrowFunction
src/ddp/register.ts:72:57
     }),
     vscode.commands.registerCommand("ddp.refresh", () => analyzeCmd.execute(state.lastScope)),
     vscode.commands.registerCommand("ddp.riskView.refresh", () => analyzeCmd.execute(state.lastScope)),
-    vscode.commands.registerCommand("ddp.revealSymbol", (id: string) => revealSymbolById(id)),
+    vscode.commands.registerCommand("ddp.revealSymbol", () => undefined),
     vscode.commands.registerCommand("ddp.riskView.openFile", (uri: vscode.Uri) => openDocument(uri)),
     vscode.commands.registerCommand("ddp.riskView.sortByF", () => tree.setSortField("f")),

[NoCoverage] StringLiteral
src/ddp/register.ts:72:37
     }),
     vscode.commands.registerCommand("ddp.refresh", () => analyzeCmd.execute(state.lastScope)),
     vscode.commands.registerCommand("ddp.riskView.refresh", () => analyzeCmd.execute(state.lastScope)),
-    vscode.commands.registerCommand("ddp.revealSymbol", (id: string) => revealSymbolById(id)),
+    vscode.commands.registerCommand("", (id: string) => revealSymbolById(id)),
     vscode.commands.registerCommand("ddp.riskView.openFile", (uri: vscode.Uri) => openDocument(uri)),
     vscode.commands.registerCommand("ddp.riskView.sortByF", () => tree.setSortField("f")),

[NoCoverage] ArrowFunction
src/ddp/register.ts:73:62
     vscode.commands.registerCommand("ddp.refresh", () => analyzeCmd.execute(state.lastScope)),
     vscode.commands.registerCommand("ddp.riskView.refresh", () => analyzeCmd.execute(state.lastScope)),
     vscode.commands.registerCommand("ddp.revealSymbol", (id: string) => revealSymbolById(id)),
-    vscode.commands.registerCommand("ddp.riskView.openFile", (uri: vscode.Uri) => openDocument(uri)),
+    vscode.commands.registerCommand("ddp.riskView.openFile", () => undefined),
     vscode.commands.registerCommand("ddp.riskView.sortByF", () => tree.setSortField("f")),
     vscode.commands.registerCommand("ddp.riskView.sortByFPrime", () => tree.setSortField("fPrime")),

[NoCoverage] ArrowFunction
src/ddp/register.ts:74:61
     vscode.commands.registerCommand("ddp.riskView.refresh", () => analyzeCmd.execute(state.lastScope)),
     vscode.commands.registerCommand("ddp.revealSymbol", (id: string) => revealSymbolById(id)),
     vscode.commands.registerCommand("ddp.riskView.openFile", (uri: vscode.Uri) => openDocument(uri)),
-    vscode.commands.registerCommand("ddp.riskView.sortByF", () => tree.setSortField("f")),
+    vscode.commands.registerCommand("ddp.riskView.sortByF", () => undefined),
     vscode.commands.registerCommand("ddp.riskView.sortByFPrime", () => tree.setSortField("fPrime")),
     vscode.commands.registerCommand("ddp.riskView.sortByG", () => tree.setSortField("g")),

[NoCoverage] ArrowFunction
src/ddp/register.ts:75:66
     vscode.commands.registerCommand("ddp.revealSymbol", (id: string) => revealSymbolById(id)),
     vscode.commands.registerCommand("ddp.riskView.openFile", (uri: vscode.Uri) => openDocument(uri)),
     vscode.commands.registerCommand("ddp.riskView.sortByF", () => tree.setSortField("f")),
-    vscode.commands.registerCommand("ddp.riskView.sortByFPrime", () => tree.setSortField("fPrime")),
+    vscode.commands.registerCommand("ddp.riskView.sortByFPrime", () => undefined),
     vscode.commands.registerCommand("ddp.riskView.sortByG", () => tree.setSortField("g")),
     vscode.commands.registerCommand("ddp.riskView.sortByCC", () => tree.setSortField("cc")),

[NoCoverage] StringLiteral
src/ddp/register.ts:75:37
     vscode.commands.registerCommand("ddp.revealSymbol", (id: string) => revealSymbolById(id)),
     vscode.commands.registerCommand("ddp.riskView.openFile", (uri: vscode.Uri) => openDocument(uri)),
     vscode.commands.registerCommand("ddp.riskView.sortByF", () => tree.setSortField("f")),
-    vscode.commands.registerCommand("ddp.riskView.sortByFPrime", () => tree.setSortField("fPrime")),
+    vscode.commands.registerCommand("", () => tree.setSortField("fPrime")),
     vscode.commands.registerCommand("ddp.riskView.sortByG", () => tree.setSortField("g")),
     vscode.commands.registerCommand("ddp.riskView.sortByCC", () => tree.setSortField("cc")),

[NoCoverage] ArrowFunction
src/ddp/register.ts:76:61
     vscode.commands.registerCommand("ddp.riskView.openFile", (uri: vscode.Uri) => openDocument(uri)),
     vscode.commands.registerCommand("ddp.riskView.sortByF", () => tree.setSortField("f")),
     vscode.commands.registerCommand("ddp.riskView.sortByFPrime", () => tree.setSortField("fPrime")),
-    vscode.commands.registerCommand("ddp.riskView.sortByG", () => tree.setSortField("g")),
+    vscode.commands.registerCommand("ddp.riskView.sortByG", () => undefined),
     vscode.commands.registerCommand("ddp.riskView.sortByCC", () => tree.setSortField("cc")),
     vscode.commands.registerCommand("ddp.riskView.sortByCRAP", () => tree.setSortField("crap")),

[NoCoverage] StringLiteral
src/ddp/register.ts:76:85
     vscode.commands.registerCommand("ddp.riskView.openFile", (uri: vscode.Uri) => openDocument(uri)),
     vscode.commands.registerCommand("ddp.riskView.sortByF", () => tree.setSortField("f")),
     vscode.commands.registerCommand("ddp.riskView.sortByFPrime", () => tree.setSortField("fPrime")),
-    vscode.commands.registerCommand("ddp.riskView.sortByG", () => tree.setSortField("g")),
+    vscode.commands.registerCommand("ddp.riskView.sortByG", () => tree.setSortField("")),
     vscode.commands.registerCommand("ddp.riskView.sortByCC", () => tree.setSortField("cc")),
     vscode.commands.registerCommand("ddp.riskView.sortByCRAP", () => tree.setSortField("crap")),

[NoCoverage] ArrowFunction
src/ddp/register.ts:77:62
     vscode.commands.registerCommand("ddp.riskView.sortByF", () => tree.setSortField("f")),
     vscode.commands.registerCommand("ddp.riskView.sortByFPrime", () => tree.setSortField("fPrime")),
     vscode.commands.registerCommand("ddp.riskView.sortByG", () => tree.setSortField("g")),
-    vscode.commands.registerCommand("ddp.riskView.sortByCC", () => tree.setSortField("cc")),
+    vscode.commands.registerCommand("ddp.riskView.sortByCC", () => undefined),
     vscode.commands.registerCommand("ddp.riskView.sortByCRAP", () => tree.setSortField("crap")),
     vscode.languages.registerCodeLensProvider(selector, codeLens),

[NoCoverage] StringLiteral
src/ddp/register.ts:77:86
     vscode.commands.registerCommand("ddp.riskView.sortByF", () => tree.setSortField("f")),
     vscode.commands.registerCommand("ddp.riskView.sortByFPrime", () => tree.setSortField("fPrime")),
     vscode.commands.registerCommand("ddp.riskView.sortByG", () => tree.setSortField("g")),
-    vscode.commands.registerCommand("ddp.riskView.sortByCC", () => tree.setSortField("cc")),
+    vscode.commands.registerCommand("ddp.riskView.sortByCC", () => tree.setSortField("")),
     vscode.commands.registerCommand("ddp.riskView.sortByCRAP", () => tree.setSortField("crap")),
     vscode.languages.registerCodeLensProvider(selector, codeLens),

[NoCoverage] ArrowFunction
src/ddp/register.ts:78:64
     vscode.commands.registerCommand("ddp.riskView.sortByFPrime", () => tree.setSortField("fPrime")),
     vscode.commands.registerCommand("ddp.riskView.sortByG", () => tree.setSortField("g")),
     vscode.commands.registerCommand("ddp.riskView.sortByCC", () => tree.setSortField("cc")),
-    vscode.commands.registerCommand("ddp.riskView.sortByCRAP", () => tree.setSortField("crap")),
+    vscode.commands.registerCommand("ddp.riskView.sortByCRAP", () => undefined),
     vscode.languages.registerCodeLensProvider(selector, codeLens),
     vscode.languages.registerHoverProvider(selector, hover),

[NoCoverage] BlockStatement
src/ddp/register.ts:82:55
     vscode.languages.registerCodeLensProvider(selector, codeLens),
     vscode.languages.registerHoverProvider(selector, hover),
     deco,
-    vscode.window.onDidChangeActiveTextEditor((ed) => {
-      deco.applyActiveEditor(ed);
-    }),
+    vscode.window.onDidChangeActiveTextEditor((ed) => {}),
     vscode.workspace.onDidChangeConfiguration((e) => {
       if (e.affectsConfiguration("ddp")) {

[NoCoverage] BlockStatement
src/ddp/register.ts:85:54
     vscode.window.onDidChangeActiveTextEditor((ed) => {
       deco.applyActiveEditor(ed);
     }),
-    vscode.workspace.onDidChangeConfiguration((e) => {
-      if (e.affectsConfiguration("ddp")) {
-        deco.applyActiveEditor(vscode.window.activeTextEditor);
-      }
-    })
+    vscode.workspace.onDidChangeConfiguration((e) => {})
   );
 

[NoCoverage] BlockStatement
src/ddp/register.ts:86:42
       deco.applyActiveEditor(ed);
     }),
     vscode.workspace.onDidChangeConfiguration((e) => {
-      if (e.affectsConfiguration("ddp")) {
-        deco.applyActiveEditor(vscode.window.activeTextEditor);
-      }
+      if (e.affectsConfiguration("ddp")) {}
     })
   );

[NoCoverage] ConditionalExpression
src/ddp/register.ts:86:11
       deco.applyActiveEditor(ed);
     }),
     vscode.workspace.onDidChangeConfiguration((e) => {
-      if (e.affectsConfiguration("ddp")) {
+      if (false) {
         deco.applyActiveEditor(vscode.window.activeTextEditor);
       }
