[Killed] BlockStatement
src/ddp/revealSymbol.ts:5:67
 import { parseUriFromSymbolId } from "./symbolId";
 import { openDocument } from "./editor";
 
-export async function revealSymbolById(id: string): Promise<void> {
-  const hash = id.indexOf("#");
-  if (hash <= 0) {
-    return;
-  }
-  const uri = parseUriFromSymbolId(id);
-  if (!uri) {
-    return;
-  }
-  const rest = id.slice(hash + 1);
-  const parts = rest.split(":");
-  const line = parseInt(parts[0] ?? "", 10);
-  const ch = parseInt(parts[1] ?? "", 10);
-  let selection: vscode.Range | undefined;
-  if (!Number.isNaN(line) && !Number.isNaN(ch)) {
-    const p = new vscode.Position(line, ch);
-    selection = new vscode.Range(p, p);
-  }
-  await openDocument(uri, selection);
-}
+export async function revealSymbolById(id: string): Promise<void> {}
 
killedBy: revealSymbolById early returns — no document opened returns without opening document when parseUriFromSymbolId returns undefined
statusReason: expected "vi.fn()" to be called with arguments: [ 'bad\u0000uri#1:2' ]

Number of calls: 0

[Killed] BlockStatement
src/ddp/revealSymbol.ts:7:18
 
 export async function revealSymbolById(id: string): Promise<void> {
   const hash = id.indexOf("#");
-  if (hash <= 0) {
-    return;
-  }
+  if (hash <= 0) {}
   const uri = parseUriFromSymbolId(id);
   if (!uri) {
killedBy: revealSymbolById bugmagnet session 2026-04-16 complex interactions does not call parseUriFromSymbolId when hash guard returns early
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "no-hash-here",

[Killed] EqualityOperator
src/ddp/revealSymbol.ts:7:7
 
 export async function revealSymbolById(id: string): Promise<void> {
   const hash = id.indexOf("#");
-  if (hash <= 0) {
+  if (hash > 0) {
     return;
   }
killedBy: revealSymbolById early returns — no document opened returns without opening document when parseUriFromSymbolId returns undefined
statusReason: expected "vi.fn()" to be called with arguments: [ 'bad\u0000uri#1:2' ]

Number of calls: 0

[Killed] BooleanLiteral
src/ddp/revealSymbol.ts:11:7
     return;
   }
   const uri = parseUriFromSymbolId(id);
-  if (!uri) {
+  if (uri) {
     return;
   }
killedBy: revealSymbolById early returns — no document opened returns without opening document when parseUriFromSymbolId returns undefined
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      undefined,

[Killed] BlockStatement
src/ddp/revealSymbol.ts:11:13
     return;
   }
   const uri = parseUriFromSymbolId(id);
-  if (!uri) {
-    return;
-  }
+  if (!uri) {}
   const rest = id.slice(hash + 1);
   const parts = rest.split(":");
killedBy: revealSymbolById early returns — no document opened returns without opening document when parseUriFromSymbolId returns undefined
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      undefined,

[Killed] MethodExpression
src/ddp/revealSymbol.ts:14:16
   if (!uri) {
     return;
   }
-  const rest = id.slice(hash + 1);
+  const rest = id;
   const parts = rest.split(":");
   const line = parseInt(parts[0] ?? "", 10);
killedBy: revealSymbolById valid id with line and character opens document and shows it with selection for valid id
statusReason: expected "vi.fn()" to be called with arguments: [ { uri: { …(2) } }, …(1) ]

Received:

  1st vi.fn() call:

@@ -3,18 +3,7 @@
      "uri": {

[Killed] ArithmeticOperator
src/ddp/revealSymbol.ts:14:25
   if (!uri) {
     return;
   }
-  const rest = id.slice(hash + 1);
+  const rest = id.slice(hash - 1);
   const parts = rest.split(":");
   const line = parseInt(parts[0] ?? "", 10);
killedBy: revealSymbolById valid id with line and character opens document and shows it with selection for valid id
statusReason: expected "vi.fn()" to be called with arguments: [ { uri: { …(2) } }, …(1) ]

Received:

  1st vi.fn() call:

@@ -3,18 +3,7 @@
      "uri": {

[Killed] LogicalOperator
src/ddp/revealSymbol.ts:16:25
   }
   const rest = id.slice(hash + 1);
   const parts = rest.split(":");
-  const line = parseInt(parts[0] ?? "", 10);
+  const line = parseInt(parts[0] && "", 10);
   const ch = parseInt(parts[1] ?? "", 10);
   let selection: vscode.Range | undefined;
killedBy: revealSymbolById valid id with line and character opens document and shows it with selection for valid id
statusReason: expected "vi.fn()" to be called with arguments: [ { uri: { …(2) } }, …(1) ]

Received:

  1st vi.fn() call:

@@ -3,18 +3,7 @@
      "uri": {

[NoCoverage] StringLiteral
src/ddp/revealSymbol.ts:16:37
   }
   const rest = id.slice(hash + 1);
   const parts = rest.split(":");
-  const line = parseInt(parts[0] ?? "", 10);
+  const line = parseInt(parts[0] ?? "Stryker was here!", 10);
   const ch = parseInt(parts[1] ?? "", 10);
   let selection: vscode.Range | undefined;

[Killed] LogicalOperator
src/ddp/revealSymbol.ts:17:23
   const rest = id.slice(hash + 1);
   const parts = rest.split(":");
   const line = parseInt(parts[0] ?? "", 10);
-  const ch = parseInt(parts[1] ?? "", 10);
+  const ch = parseInt(parts[1] && "", 10);
   let selection: vscode.Range | undefined;
   if (!Number.isNaN(line) && !Number.isNaN(ch)) {
killedBy: revealSymbolById valid id with line and character opens document and shows it with selection for valid id
statusReason: expected "vi.fn()" to be called with arguments: [ { uri: { …(2) } }, …(1) ]

Received:

  1st vi.fn() call:

@@ -3,18 +3,7 @@
      "uri": {

[Survived] StringLiteral
src/ddp/revealSymbol.ts:17:35
   const rest = id.slice(hash + 1);
   const parts = rest.split(":");
   const line = parseInt(parts[0] ?? "", 10);
-  const ch = parseInt(parts[1] ?? "", 10);
+  const ch = parseInt(parts[1] ?? "Stryker was here!", 10);
   let selection: vscode.Range | undefined;
   if (!Number.isNaN(line) && !Number.isNaN(ch)) {

[Killed] ConditionalExpression
src/ddp/revealSymbol.ts:19:7
   const line = parseInt(parts[0] ?? "", 10);
   const ch = parseInt(parts[1] ?? "", 10);
   let selection: vscode.Range | undefined;
-  if (!Number.isNaN(line) && !Number.isNaN(ch)) {
+  if (true) {
     const p = new vscode.Position(line, ch);
     selection = new vscode.Range(p, p);
killedBy: revealSymbolById shows document without selection when position is unparseable passes empty options when line is non-numeric
statusReason: expected "vi.fn()" to be called with arguments: [ { uri: { …(2) } }, {} ]

Received:

  1st vi.fn() call:

@@ -3,7 +3,18 @@
      "uri": {

[Killed] BooleanLiteral
src/ddp/revealSymbol.ts:19:7
   const line = parseInt(parts[0] ?? "", 10);
   const ch = parseInt(parts[1] ?? "", 10);
   let selection: vscode.Range | undefined;
-  if (!Number.isNaN(line) && !Number.isNaN(ch)) {
+  if (Number.isNaN(line) && !Number.isNaN(ch)) {
     const p = new vscode.Position(line, ch);
     selection = new vscode.Range(p, p);
killedBy: revealSymbolById valid id with line and character opens document and shows it with selection for valid id
statusReason: expected "vi.fn()" to be called with arguments: [ { uri: { …(2) } }, …(1) ]

Received:

  1st vi.fn() call:

@@ -3,18 +3,7 @@
      "uri": {
