[NoCoverage] BlockStatement
src/extension.ts:4:66
 import * as vscode from "vscode";
 import { registerDdp } from "./ddp/register";
 
-export function activate(context: vscode.ExtensionContext): void {
-  registerDdp(context);
-}
+export function activate(context: vscode.ExtensionContext): void {}
 
 export function deactivate(): void {}
