[Killed] BlockStatement
src/core/analyze.ts:41:20
   edges: readonly CallEdge[],
   symbols: readonly SymbolInput[],
   rankOptions: Partial<RankOptions> = {}
-): SymbolMetrics[] {
-  const ranks = computeRanks(edges, rankOptions);
-  return symbols.map((symbol) => {
-    const rank = ranks.get(symbol.id) ?? 1;
-    const crapScore = crap(symbol.cc, symbol.t);
-    const failureRisk = failureRiskFromCrap(rank, crapScore);
-    return { ...symbol, r: rank, crap: crapScore, f: failureRisk, g: 1, fPrime: failureRisk };
-  });
-}
+): SymbolMetrics[] {}
 
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/core/analyze.ts:43:34
   rankOptions: Partial<RankOptions> = {}
 ): SymbolMetrics[] {
   const ranks = computeRanks(edges, rankOptions);
-  return symbols.map((symbol) => {
-    const rank = ranks.get(symbol.id) ?? 1;
-    const crapScore = crap(symbol.cc, symbol.t);
-    const failureRisk = failureRiskFromCrap(rank, crapScore);
-    return { ...symbol, r: rank, crap: crapScore, f: failureRisk, g: 1, fPrime: failureRisk };
-  });
+  return symbols.map((symbol) => {});
 }
 
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
src/core/analyze.ts:44:18
 ): SymbolMetrics[] {
   const ranks = computeRanks(edges, rankOptions);
   return symbols.map((symbol) => {
-    const rank = ranks.get(symbol.id) ?? 1;
+    const rank = ranks.get(symbol.id) && 1;
     const crapScore = crap(symbol.cc, symbol.t);
     const failureRisk = failureRiskFromCrap(rank, crapScore);
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: expected 1 to be greater than 1
