[Killed] BlockStatement
src/core/ccRegistry.ts:18:66
 
 /** Fallback provider that works offline for all languages via regex-based estimation. */
 export class FallbackCcProvider implements CyclomaticComplexityProvider {
-  async computeComplexity(_doc: DocumentInfo): Promise<CcResult> {
-    // The fallback only provides per-symbol estimation, not per-document.
-    // It returns empty maps; the orchestrator uses estimateCyclomaticComplexity per symbol body.
-    return { byLine: new Map(), byName: new Map() };
-  }
+  async computeComplexity(_doc: DocumentInfo): Promise<CcResult> {}
 }
 
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: Cannot read properties of undefined (reading 'byLine')

[Killed] ObjectLiteral
src/core/ccRegistry.ts:21:12
   async computeComplexity(_doc: DocumentInfo): Promise<CcResult> {
     // The fallback only provides per-symbol estimation, not per-document.
     // It returns empty maps; the orchestrator uses estimateCyclomaticComplexity per symbol body.
-    return { byLine: new Map(), byName: new Map() };
+    return {};
   }
 }
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: Cannot read properties of undefined (reading 'size')

[Killed] BlockStatement
src/core/ccRegistry.ts:29:45
   private readonly providers = new Map<string, CyclomaticComplexityProvider>();
   private readonly fallback: CyclomaticComplexityProvider = new FallbackCcProvider();
 
-  register(entry: LanguageCcProvider): void {
-    for (const lang of entry.supportedLanguages) {
-      this.providers.set(lang, entry.provider);
-    }
-  }
+  register(entry: LanguageCcProvider): void {}
 
   getForLanguage(languageId: string): CyclomaticComplexityProvider {
killedBy: AnalysisOrchestrator uses tool-specific CC when available
statusReason: expected 2 to be 15 // Object.is equality

[Killed] BlockStatement
src/core/ccRegistry.ts:30:50
   private readonly fallback: CyclomaticComplexityProvider = new FallbackCcProvider();
 
   register(entry: LanguageCcProvider): void {
-    for (const lang of entry.supportedLanguages) {
-      this.providers.set(lang, entry.provider);
-    }
+    for (const lang of entry.supportedLanguages) {}
   }
 
killedBy: AnalysisOrchestrator uses tool-specific CC when available
statusReason: expected 2 to be 15 // Object.is equality

[Killed] BlockStatement
src/core/ccRegistry.ts:35:68
     }
   }
 
-  getForLanguage(languageId: string): CyclomaticComplexityProvider {
-    return this.providers.get(languageId) ?? this.fallback;
-  }
+  getForLanguage(languageId: string): CyclomaticComplexityProvider {}
 }
 
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: Cannot read properties of undefined (reading 'computeComplexity')

[Killed] LogicalOperator
src/core/ccRegistry.ts:36:12
   }
 
   getForLanguage(languageId: string): CyclomaticComplexityProvider {
-    return this.providers.get(languageId) ?? this.fallback;
+    return this.providers.get(languageId) && this.fallback;
   }
 }
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: Cannot read properties of undefined (reading 'computeComplexity')
