[Killed] BlockStatement
src/core/churn.ts:4:62
 import type { SymbolMetrics } from "./analyze";
 
 /** Returns G ≥ 1. Log-scaled so high-churn outliers don't dominate. */
-export function churnMultiplier(commitCount: number): number {
-  return 1 + Math.log1p(commitCount);
-}
+export function churnMultiplier(commitCount: number): number {}
 
 /** Returns a new array of symbols with g and fPrime set from the commit counts map.
killedBy: AnalysisOrchestrator applies churn multiplier when ChurnProvider is supplied
statusReason: expected undefined to be close to 3.3978952727983707, received difference is NaN, but expected 0.000005

[Killed] ArithmeticOperator
src/core/churn.ts:5:10
 
 /** Returns G ≥ 1. Log-scaled so high-churn outliers don't dominate. */
 export function churnMultiplier(commitCount: number): number {
-  return 1 + Math.log1p(commitCount);
+  return 1 - Math.log1p(commitCount);
 }
 
killedBy: AnalysisOrchestrator applies churn multiplier when ChurnProvider is supplied
statusReason: expected -1.3978952727983707 to be close to 3.3978952727983707, received difference is 4.795790545596741, but expected 0.000005

[Killed] BlockStatement
src/core/churn.ts:13:20
 export function applyChurn(
   symbols: readonly SymbolMetrics[],
   counts: Map<string, number>
-): SymbolMetrics[] {
-  return symbols.map((s) => {
-    const count = counts.get(s.uri);
-    if (count === undefined) return { ...s };
-    const g = churnMultiplier(count);
-    return { ...s, g, fPrime: s.f * g };
-  });
-}
+): SymbolMetrics[] {}
 
killedBy: AnalysisOrchestrator applies churn multiplier when ChurnProvider is supplied
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/core/churn.ts:14:29
   symbols: readonly SymbolMetrics[],
   counts: Map<string, number>
 ): SymbolMetrics[] {
-  return symbols.map((s) => {
-    const count = counts.get(s.uri);
-    if (count === undefined) return { ...s };
-    const g = churnMultiplier(count);
-    return { ...s, g, fPrime: s.f * g };
-  });
+  return symbols.map((s) => {});
 }
 
killedBy: AnalysisOrchestrator applies churn multiplier when ChurnProvider is supplied
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
src/core/churn.ts:16:9
 ): SymbolMetrics[] {
   return symbols.map((s) => {
     const count = counts.get(s.uri);
-    if (count === undefined) return { ...s };
+    if (count !== undefined) return { ...s };
     const g = churnMultiplier(count);
     return { ...s, g, fPrime: s.f * g };
killedBy: AnalysisOrchestrator applies churn multiplier when ChurnProvider is supplied
statusReason: expected 1 to be close to 3.3978952727983707, received difference is 2.3978952727983707, but expected 0.000005

[Killed] ConditionalExpression
src/core/churn.ts:16:9
 ): SymbolMetrics[] {
   return symbols.map((s) => {
     const count = counts.get(s.uri);
-    if (count === undefined) return { ...s };
+    if (false) return { ...s };
     const g = churnMultiplier(count);
     return { ...s, g, fPrime: s.f * g };
killedBy: applyChurn leaves g=1 and fPrime=f for symbols not in the counts map
statusReason: expected NaN to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/core/churn.ts:18:31
     const count = counts.get(s.uri);
     if (count === undefined) return { ...s };
     const g = churnMultiplier(count);
-    return { ...s, g, fPrime: s.f * g };
+    return { ...s, g, fPrime: s.f / g };
   });
 }
killedBy: AnalysisOrchestrator applies churn multiplier when ChurnProvider is supplied
statusReason: expected 0.5885996593276048 to be greater than 2
