[Killed] BlockStatement
src/core/churnParse.ts:6:79
  *   git log --name-only --pretty=format: --since=<date>
  * and returns a map of relative file path → commit count.
  */
-export function parseGitLogToChurnCounts(stdout: string): Map<string, number> {
-  const counts = new Map<string, number>();
-  for (const line of stdout.split("\n")) {
-    const path = line.trim();
-    if (path) {
-      counts.set(path, (counts.get(path) ?? 0) + 1);
-    }
-  }
-  return counts;
-}
+export function parseGitLogToChurnCounts(stdout: string): Map<string, number> {}
 
killedBy: GitChurnAdapter (integration) returns counts for files changed recently
statusReason: relativeCounts is not iterable

[Killed] BlockStatement
src/core/churnParse.ts:8:42
  */
 export function parseGitLogToChurnCounts(stdout: string): Map<string, number> {
   const counts = new Map<string, number>();
-  for (const line of stdout.split("\n")) {
-    const path = line.trim();
-    if (path) {
-      counts.set(path, (counts.get(path) ?? 0) + 1);
-    }
-  }
+  for (const line of stdout.split("\n")) {}
   return counts;
 }
killedBy: GitChurnAdapter (integration) returns counts for files changed recently
statusReason: expected 0 to be greater than 0

[Killed] MethodExpression
src/core/churnParse.ts:9:18
 export function parseGitLogToChurnCounts(stdout: string): Map<string, number> {
   const counts = new Map<string, number>();
   for (const line of stdout.split("\n")) {
-    const path = line.trim();
+    const path = line;
     if (path) {
       counts.set(path, (counts.get(path) ?? 0) + 1);
killedBy: parseGitLogToChurnCounts handles CRLF line endings from Windows git output
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
src/core/churnParse.ts:10:9
   const counts = new Map<string, number>();
   for (const line of stdout.split("\n")) {
     const path = line.trim();
-    if (path) {
+    if (false) {
       counts.set(path, (counts.get(path) ?? 0) + 1);
     }
killedBy: GitChurnAdapter (integration) returns counts for files changed recently
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/core/churnParse.ts:10:15
   const counts = new Map<string, number>();
   for (const line of stdout.split("\n")) {
     const path = line.trim();
-    if (path) {
-      counts.set(path, (counts.get(path) ?? 0) + 1);
-    }
+    if (path) {}
   }
   return counts;
killedBy: GitChurnAdapter (integration) returns counts for files changed recently
statusReason: expected 0 to be greater than 0

[Killed] ArithmeticOperator
src/core/churnParse.ts:11:24
   for (const line of stdout.split("\n")) {
     const path = line.trim();
     if (path) {
-      counts.set(path, (counts.get(path) ?? 0) + 1);
+      counts.set(path, (counts.get(path) ?? 0) - 1);
     }
   }
killedBy: GitChurnAdapter (integration) all counts are positive integers
statusReason: expected -3 to be greater than 0

[Killed] LogicalOperator
src/core/churnParse.ts:11:25
   for (const line of stdout.split("\n")) {
     const path = line.trim();
     if (path) {
-      counts.set(path, (counts.get(path) ?? 0) + 1);
+      counts.set(path, (counts.get(path) && 0) + 1);
     }
   }
killedBy: GitChurnAdapter returns commit counts keyed by absolute file URI
statusReason: expected NaN to be 2 // Object.is equality
