[Killed] BlockStatement
src/core/coverageMap.ts:20:56
   readonly endLine: number;
 };
 
-function overlaps(a: LineRange, b: LineRange): boolean {
-  return a.startLine <= b.endLine && b.startLine <= a.endLine;
-}
+function overlaps(a: LineRange, b: LineRange): boolean {}
 
 /**
killedBy: AnalysisOrchestrator uses coverage data when available
statusReason: expected +0 to be close to 0.6666666666666666, received difference is 0.6666666666666666, but expected 0.0005

[Killed] EqualityOperator
src/core/coverageMap.ts:21:38
 };
 
 function overlaps(a: LineRange, b: LineRange): boolean {
-  return a.startLine <= b.endLine && b.startLine <= a.endLine;
+  return a.startLine <= b.endLine && b.startLine < a.endLine;
 }
 
killedBy: coverageFractionForSymbol returns ratio of executed statements overlapping body
statusReason: expected 0.5 to be close to 0.6666666666666666, received difference is 0.16666666666666663, but expected 0.000005

[Killed] ConditionalExpression
src/core/coverageMap.ts:21:10
 };
 
 function overlaps(a: LineRange, b: LineRange): boolean {
-  return a.startLine <= b.endLine && b.startLine <= a.endLine;
+  return false;
 }
 
killedBy: AnalysisOrchestrator uses coverage data when available
statusReason: expected +0 to be close to 0.6666666666666666, received difference is 0.6666666666666666, but expected 0.0005

[Killed] BlockStatement
src/core/coverageMap.ts:36:11
   body: LineRange,
   statements: readonly StatementCover[],
   fallbackT: number
-): number {
-  let total = 0;
-  let covered = 0;
-  for (const s of statements) {
-    const sr: LineRange = { startLine: s.startLine, endLine: s.endLine };
-    if (!overlaps(body, sr)) {
-      continue;
-    }
-    total += 1;
-    if (s.executed) {
-      covered += 1;
-    }
-  }
-  if (total === 0) {
-    return clamp01(fallbackT);
-  }
-  return covered / total;
-}
+): number {}
 
killedBy: coverageFractionForSymbol returns ratio of executed statements overlapping body
statusReason: expected undefined to be close to 0.6666666666666666, received difference is NaN, but expected 0.000005

[Killed] BlockStatement
src/core/coverageMap.ts:39:31
 ): number {
   let total = 0;
   let covered = 0;
-  for (const s of statements) {
-    const sr: LineRange = { startLine: s.startLine, endLine: s.endLine };
-    if (!overlaps(body, sr)) {
-      continue;
-    }
-    total += 1;
-    if (s.executed) {
-      covered += 1;
-    }
-  }
+  for (const s of statements) {}
   if (total === 0) {
     return clamp01(fallbackT);
killedBy: coverageFractionForSymbol returns ratio of executed statements overlapping body
statusReason: expected +0 to be close to 0.6666666666666666, received difference is 0.6666666666666666, but expected 0.000005

[Killed] ObjectLiteral
src/core/coverageMap.ts:40:27
   let total = 0;
   let covered = 0;
   for (const s of statements) {
-    const sr: LineRange = { startLine: s.startLine, endLine: s.endLine };
+    const sr: LineRange = {};
     if (!overlaps(body, sr)) {
       continue;
killedBy: coverageFractionForSymbol returns ratio of executed statements overlapping body
statusReason: expected +0 to be close to 0.6666666666666666, received difference is 0.6666666666666666, but expected 0.000005

[Killed] ConditionalExpression
src/core/coverageMap.ts:41:9
   let covered = 0;
   for (const s of statements) {
     const sr: LineRange = { startLine: s.startLine, endLine: s.endLine };
-    if (!overlaps(body, sr)) {
+    if (true) {
       continue;
     }
killedBy: AnalysisOrchestrator uses coverage data when available
statusReason: expected +0 to be close to 0.6666666666666666, received difference is 0.6666666666666666, but expected 0.0005

[Killed] ConditionalExpression
src/core/coverageMap.ts:41:9
   let covered = 0;
   for (const s of statements) {
     const sr: LineRange = { startLine: s.startLine, endLine: s.endLine };
-    if (!overlaps(body, sr)) {
+    if (false) {
       continue;
     }
killedBy: mutation-killing: coverageMap.ts statement fully before body does not overlap
statusReason: expected 1 to be +0 // Object.is equality

[Killed] AssignmentOperator
src/core/coverageMap.ts:44:5
     if (!overlaps(body, sr)) {
       continue;
     }
-    total += 1;
+    total -= 1;
     if (s.executed) {
       covered += 1;
killedBy: coverageFractionForSymbol returns ratio of executed statements overlapping body
statusReason: expected -0.6666666666666666 to be close to 0.6666666666666666, received difference is 1.3333333333333333, but expected 0.000005

[Killed] ConditionalExpression
src/core/coverageMap.ts:45:9
       continue;
     }
     total += 1;
-    if (s.executed) {
+    if (false) {
       covered += 1;
     }
killedBy: coverageFractionForSymbol returns ratio of executed statements overlapping body
statusReason: expected +0 to be close to 0.6666666666666666, received difference is 0.6666666666666666, but expected 0.000005

[Killed] ConditionalExpression
src/core/coverageMap.ts:45:9
       continue;
     }
     total += 1;
-    if (s.executed) {
+    if (true) {
       covered += 1;
     }
killedBy: coverageFractionForSymbol returns ratio of executed statements overlapping body
statusReason: expected 1 to be close to 0.6666666666666666, received difference is 0.33333333333333337, but expected 0.000005

[Killed] AssignmentOperator
src/core/coverageMap.ts:46:7
     }
     total += 1;
     if (s.executed) {
-      covered += 1;
+      covered -= 1;
     }
   }
killedBy: coverageFractionForSymbol returns ratio of executed statements overlapping body
statusReason: expected -0.6666666666666666 to be close to 0.6666666666666666, received difference is 1.3333333333333333, but expected 0.000005

[Killed] EqualityOperator
src/core/coverageMap.ts:49:7
       covered += 1;
     }
   }
-  if (total === 0) {
+  if (total !== 0) {
     return clamp01(fallbackT);
   }
killedBy: AnalysisOrchestrator uses coverage data when available
statusReason: expected +0 to be close to 0.6666666666666666, received difference is 0.6666666666666666, but expected 0.0005

[Killed] BlockStatement
src/core/coverageMap.ts:49:20
       covered += 1;
     }
   }
-  if (total === 0) {
-    return clamp01(fallbackT);
-  }
+  if (total === 0) {}
   return covered / total;
 }
killedBy: coverageFractionForSymbol ignores statements outside body
statusReason: expected NaN to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/core/coverageMap.ts:52:10
   if (total === 0) {
     return clamp01(fallbackT);
   }
-  return covered / total;
+  return covered * total;
 }
 
killedBy: coverageFractionForSymbol returns ratio of executed statements overlapping body
statusReason: expected 6 to be close to 0.6666666666666666, received difference is 5.333333333333333, but expected 0.000005
