[Killed] BlockStatement
src/core/coverageStore.ts:10:17
 export class CoverageStore {
   private readonly byUri = new Map<string, StatementCover[]>();
 
-  clear(): void {
-    this.byUri.clear();
-  }
+  clear(): void {}
 
   get(uri: string): StatementCover[] | undefined {
killedBy: CoverageStore clear removes all data
statusReason: expected [ Array(1) ] to be undefined

[Killed] BlockStatement
src/core/coverageStore.ts:14:50
     this.byUri.clear();
   }
 
-  get(uri: string): StatementCover[] | undefined {
-    // Try exact match first
-    const result = this.byUri.get(uri);
-    if (result) {
-      return result;
-    }
-
-    // On Windows, try case-insensitive match as fallback
-    // URI strings may have different encoding between different code paths
-    if (process.platform === "win32") {
-      const keyLower = uri.toLowerCase();
-      for (const [storedKey, statements] of this.byUri) {
-        if (storedKey.toLowerCase() === keyLower) {
-          return statements;
-        }
-      }
-    }
-
-    return undefined;
-  }
+  get(uri: string): StatementCover[] | undefined {}
 
   /** Store statement coverage records for a file URI. */
killedBy: loadLcovIntoStore does not clear store before loading (caller responsibility)
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/core/coverageStore.ts:17:9
   get(uri: string): StatementCover[] | undefined {
     // Try exact match first
     const result = this.byUri.get(uri);
-    if (result) {
+    if (true) {
       return result;
     }
killedBy: CoverageStore case-insensitive fallback on Windows
statusReason: expected undefined to deeply equal [ Array(1) ]

[Survived] BlockStatement
src/core/coverageStore.ts:17:17
   get(uri: string): StatementCover[] | undefined {
     // Try exact match first
     const result = this.byUri.get(uri);
-    if (result) {
-      return result;
-    }
+    if (result) {}
 
     // On Windows, try case-insensitive match as fallback

[Killed] ConditionalExpression
src/core/coverageStore.ts:23:9
 
     // On Windows, try case-insensitive match as fallback
     // URI strings may have different encoding between different code paths
-    if (process.platform === "win32") {
+    if (false) {
       const keyLower = uri.toLowerCase();
       for (const [storedKey, statements] of this.byUri) {
killedBy: CoverageStore case-insensitive fallback on Windows
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] EqualityOperator
src/core/coverageStore.ts:23:9
 
     // On Windows, try case-insensitive match as fallback
     // URI strings may have different encoding between different code paths
-    if (process.platform === "win32") {
+    if (process.platform !== "win32") {
       const keyLower = uri.toLowerCase();
       for (const [storedKey, statements] of this.byUri) {
killedBy: CoverageStore case-insensitive fallback on Windows
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] MethodExpression
src/core/coverageStore.ts:24:24
     // On Windows, try case-insensitive match as fallback
     // URI strings may have different encoding between different code paths
     if (process.platform === "win32") {
-      const keyLower = uri.toLowerCase();
+      const keyLower = uri.toUpperCase();
       for (const [storedKey, statements] of this.byUri) {
         if (storedKey.toLowerCase() === keyLower) {
killedBy: CoverageStore case-insensitive fallback on Windows
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/core/coverageStore.ts:25:57
     // URI strings may have different encoding between different code paths
     if (process.platform === "win32") {
       const keyLower = uri.toLowerCase();
-      for (const [storedKey, statements] of this.byUri) {
-        if (storedKey.toLowerCase() === keyLower) {
-          return statements;
-        }
-      }
+      for (const [storedKey, statements] of this.byUri) {}
     }
 
killedBy: CoverageStore case-insensitive fallback on Windows
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] EqualityOperator
src/core/coverageStore.ts:26:13
     if (process.platform === "win32") {
       const keyLower = uri.toLowerCase();
       for (const [storedKey, statements] of this.byUri) {
-        if (storedKey.toLowerCase() === keyLower) {
+        if (storedKey.toLowerCase() !== keyLower) {
           return statements;
         }
killedBy: CoverageStore case-insensitive fallback on Windows
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/core/coverageStore.ts:26:51
     if (process.platform === "win32") {
       const keyLower = uri.toLowerCase();
       for (const [storedKey, statements] of this.byUri) {
-        if (storedKey.toLowerCase() === keyLower) {
-          return statements;
-        }
+        if (storedKey.toLowerCase() === keyLower) {}
       }
     }
killedBy: CoverageStore case-insensitive fallback on Windows
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/core/coverageStore.ts:36:89
   }
 
   /** Store statement coverage records for a file URI. */
-  ingestStatementCovers(uriString: string, statements: readonly StatementCover[]): void {
-    this.byUri.set(uriString, [...statements]);
-  }
+  ingestStatementCovers(uriString: string, statements: readonly StatementCover[]): void {}
 }
 
killedBy: CoverageStore stores and retrieves statement covers by URI string
statusReason: expected undefined to deeply equal [ { startLine: +0, …(2) }, …(1) ]
