[Survived] StringLiteral
src/core/estimateCc.ts:6:37
  * Prefer language-specific tools when configured; this works offline for all languages.
  */
 
-const KEYWORD_DECISIONS = ["while", "for", "foreach", "case", "catch"];
+const KEYWORD_DECISIONS = ["while", "", "foreach", "case", "catch"];
 
 function countDecisions(source: string): number {

[Survived] StringLiteral
src/core/estimateCc.ts:6:28
  * Prefer language-specific tools when configured; this works offline for all languages.
  */
 
-const KEYWORD_DECISIONS = ["while", "for", "foreach", "case", "catch"];
+const KEYWORD_DECISIONS = ["", "for", "foreach", "case", "catch"];
 
 function countDecisions(source: string): number {

[Killed] BlockStatement
src/core/estimateCc.ts:12:39
   let count = 0;
 
   // Count keyword-based decisions via word boundaries
-  for (const kw of KEYWORD_DECISIONS) {
-    const pattern = new RegExp(String.raw`\b${kw}\b`, "g");
-    while (pattern.exec(source) !== null) {
-      count += 1;
-    }
-  }
+  for (const kw of KEYWORD_DECISIONS) {}
 
   // Count `if` that is NOT preceded by `else` (standalone if)
killedBy: mutation-killing: estimateCc.ts counts while as a decision
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/core/estimateCc.ts:14:12
   // Count keyword-based decisions via word boundaries
   for (const kw of KEYWORD_DECISIONS) {
     const pattern = new RegExp(String.raw`\b${kw}\b`, "g");
-    while (pattern.exec(source) !== null) {
+    while (false) {
       count += 1;
     }
killedBy: mutation-killing: estimateCc.ts counts while as a decision
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/core/estimateCc.ts:14:43
   // Count keyword-based decisions via word boundaries
   for (const kw of KEYWORD_DECISIONS) {
     const pattern = new RegExp(String.raw`\b${kw}\b`, "g");
-    while (pattern.exec(source) !== null) {
-      count += 1;
-    }
+    while (pattern.exec(source) !== null) {}
   }
 
killedBy: mutation-killing: estimateCc.ts counts while as a decision
statusReason: expected 1 to be 2 // Object.is equality

[Killed] AssignmentOperator
src/core/estimateCc.ts:15:7
   for (const kw of KEYWORD_DECISIONS) {
     const pattern = new RegExp(String.raw`\b${kw}\b`, "g");
     while (pattern.exec(source) !== null) {
-      count += 1;
+      count -= 1;
     }
   }
killedBy: mutation-killing: estimateCc.ts counts while as a decision
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/core/estimateCc.ts:22:10
   // Count `if` that is NOT preceded by `else` (standalone if)
   // and `else if` as a single decision each
   const ifPattern = /\b(else\s+)?if\b/g;
-  while (ifPattern.exec(source) !== null) {
+  while (false) {
     count += 1;
   }
killedBy: AnalysisOrchestrator falls back to line-based CC miss then name-based CC miss then regex estimator
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/core/estimateCc.ts:22:43
   // Count `if` that is NOT preceded by `else` (standalone if)
   // and `else if` as a single decision each
   const ifPattern = /\b(else\s+)?if\b/g;
-  while (ifPattern.exec(source) !== null) {
-    count += 1;
-  }
+  while (ifPattern.exec(source) !== null) {}
 
   // Count logical operators && and ||
killedBy: AnalysisOrchestrator falls back to line-based CC miss then name-based CC miss then regex estimator
statusReason: expected 1 to be 2 // Object.is equality

[Killed] AssignmentOperator
src/core/estimateCc.ts:23:5
   // and `else if` as a single decision each
   const ifPattern = /\b(else\s+)?if\b/g;
   while (ifPattern.exec(source) !== null) {
-    count += 1;
+    count -= 1;
   }
 
killedBy: AnalysisOrchestrator falls back to line-based CC miss then name-based CC miss then regex estimator
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/core/estimateCc.ts:28:10
 
   // Count logical operators && and ||
   const logicalPattern = /&&|\|\|/g;
-  while (logicalPattern.exec(source) !== null) {
+  while (false) {
     count += 1;
   }
killedBy: mutation-killing: estimateCc.ts counts && as a decision
statusReason: expected 2 to be 3 // Object.is equality

[Killed] BlockStatement
src/core/estimateCc.ts:28:48
 
   // Count logical operators && and ||
   const logicalPattern = /&&|\|\|/g;
-  while (logicalPattern.exec(source) !== null) {
-    count += 1;
-  }
+  while (logicalPattern.exec(source) !== null) {}
 
   // Count ternary expressions: ? <expr> :
killedBy: mutation-killing: estimateCc.ts counts && as a decision
statusReason: expected 2 to be 3 // Object.is equality

[Killed] AssignmentOperator
src/core/estimateCc.ts:29:5
   // Count logical operators && and ||
   const logicalPattern = /&&|\|\|/g;
   while (logicalPattern.exec(source) !== null) {
-    count += 1;
+    count -= 1;
   }
 
killedBy: mutation-killing: estimateCc.ts counts && as a decision
statusReason: expected 1 to be 3 // Object.is equality

[Killed] BlockStatement
src/core/estimateCc.ts:34:48
 
   // Count ternary expressions: ? <expr> :
   const ternaryPattern = /\?\s*[^;?:]+:/g;
-  while (ternaryPattern.exec(source) !== null) {
-    count += 1;
-  }
+  while (ternaryPattern.exec(source) !== null) {}
 
   return count;
killedBy: mutation-killing: estimateCc.ts counts ternary as a decision
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/core/estimateCc.ts:34:10
 
   // Count ternary expressions: ? <expr> :
   const ternaryPattern = /\?\s*[^;?:]+:/g;
-  while (ternaryPattern.exec(source) !== null) {
+  while (false) {
     count += 1;
   }
killedBy: mutation-killing: estimateCc.ts counts ternary as a decision
statusReason: expected 1 to be 2 // Object.is equality

[Killed] AssignmentOperator
src/core/estimateCc.ts:35:5
   // Count ternary expressions: ? <expr> :
   const ternaryPattern = /\?\s*[^;?:]+:/g;
   while (ternaryPattern.exec(source) !== null) {
-    count += 1;
+    count -= 1;
   }
 
killedBy: mutation-killing: estimateCc.ts counts ternary as a decision
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/core/estimateCc.ts:41:70
   return count;
 }
 
-export function estimateCyclomaticComplexity(source: string): number {
-  return Math.max(1, 1 + countDecisions(source));
-}
+export function estimateCyclomaticComplexity(source: string): number {}
 
killedBy: estimateCyclomaticComplexity returns 1 for empty or trivial code
statusReason: expected undefined to be 1 // Object.is equality

[Killed] MethodExpression
src/core/estimateCc.ts:42:10
 }
 
 export function estimateCyclomaticComplexity(source: string): number {
-  return Math.max(1, 1 + countDecisions(source));
+  return Math.min(1, 1 + countDecisions(source));
 }
 
killedBy: estimateCyclomaticComplexity adds a decision for each if
statusReason: expected 1 to be greater than or equal to 3

[Killed] ArithmeticOperator
src/core/estimateCc.ts:42:22
 }
 
 export function estimateCyclomaticComplexity(source: string): number {
-  return Math.max(1, 1 + countDecisions(source));
+  return Math.max(1, 1 - countDecisions(source));
 }
 
killedBy: estimateCyclomaticComplexity adds a decision for each if
statusReason: expected 1 to be greater than or equal to 3
