[Killed] BlockStatement
src/core/graphBuilder.ts:15:84
  * @param rows Each row represents one caller and its outgoing callees.
  * @returns Flat list of { caller, callee } edges with self-edges removed.
  */
-export function edgesFromCallerCallees(rows: readonly CallerCallees[]): CallEdge[] {
-  const edges: CallEdge[] = [];
-  for (const row of rows) {
-    for (const callee of row.calleeIds) {
-      if (callee !== row.callerId) {
-        edges.push({ caller: row.callerId, callee });
-      }
-    }
-  }
-  return edges;
-}
+export function edgesFromCallerCallees(rows: readonly CallerCallees[]): CallEdge[] {}
 
killedBy: collectCallEdgesFromWorkspace file discovery glob pattern returns empty edges when findFiles returns no files
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
src/core/graphBuilder.ts:17:27
  */
 export function edgesFromCallerCallees(rows: readonly CallerCallees[]): CallEdge[] {
   const edges: CallEdge[] = [];
-  for (const row of rows) {
-    for (const callee of row.calleeIds) {
-      if (callee !== row.callerId) {
-        edges.push({ caller: row.callerId, callee });
-      }
-    }
-  }
+  for (const row of rows) {}
   return edges;
 }
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] BlockStatement
src/core/graphBuilder.ts:18:41
 export function edgesFromCallerCallees(rows: readonly CallerCallees[]): CallEdge[] {
   const edges: CallEdge[] = [];
   for (const row of rows) {
-    for (const callee of row.calleeIds) {
-      if (callee !== row.callerId) {
-        edges.push({ caller: row.callerId, callee });
-      }
-    }
+    for (const callee of row.calleeIds) {}
   }
   return edges;
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] BlockStatement
src/core/graphBuilder.ts:19:36
   const edges: CallEdge[] = [];
   for (const row of rows) {
     for (const callee of row.calleeIds) {
-      if (callee !== row.callerId) {
-        edges.push({ caller: row.callerId, callee });
-      }
+      if (callee !== row.callerId) {}
     }
   }
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] ConditionalExpression
src/core/graphBuilder.ts:19:11
   const edges: CallEdge[] = [];
   for (const row of rows) {
     for (const callee of row.calleeIds) {
-      if (callee !== row.callerId) {
+      if (true) {
         edges.push({ caller: row.callerId, callee });
       }
killedBy: edgesFromCallerCallees dedupes self-edges
statusReason: expected [ { caller: 'a', callee: 'a' }, …(1) ] to deeply equal [ { caller: 'a', callee: 'b' } ]
