[Killed] Regex
src/core/jacocoParse.ts:21:21
  */
 export function parseJacocoToStatementCovers(xml: string): Map<string, StatementCover[]> {
   const byFile = new Map<string, StatementCover[]>();
-  const packageRe = /<package\s+name="([^"]*)"[^>]*>/g;
+  const packageRe = /<package\S+name="([^"]*)"[^>]*>/g;
   const sourcefileRe = /<sourcefile\s+name="([^"]*)"[^>]*>([\s\S]*?)<\/sourcefile>/g;
   // NB: assumes JaCoCo's fixed attribute order (nr, mi, ci) — safe for generated XML.
killedBy: parseJacocoToStatementCovers parses a single sourcefile with line elements
statusReason: expected undefined to be defined

[Killed] Regex
src/core/jacocoParse.ts:21:21
  */
 export function parseJacocoToStatementCovers(xml: string): Map<string, StatementCover[]> {
   const byFile = new Map<string, StatementCover[]>();
-  const packageRe = /<package\s+name="([^"]*)"[^>]*>/g;
+  const packageRe = /<package\s+name="(["]*)"[^>]*>/g;
   const sourcefileRe = /<sourcefile\s+name="([^"]*)"[^>]*>([\s\S]*?)<\/sourcefile>/g;
   // NB: assumes JaCoCo's fixed attribute order (nr, mi, ci) — safe for generated XML.
killedBy: parseJacocoToStatementCovers parses a single sourcefile with line elements
statusReason: expected undefined to be defined

[Killed] Regex
src/core/jacocoParse.ts:22:24
 export function parseJacocoToStatementCovers(xml: string): Map<string, StatementCover[]> {
   const byFile = new Map<string, StatementCover[]>();
   const packageRe = /<package\s+name="([^"]*)"[^>]*>/g;
-  const sourcefileRe = /<sourcefile\s+name="([^"]*)"[^>]*>([\s\S]*?)<\/sourcefile>/g;
+  const sourcefileRe = /<sourcefile\s+name="([^"])"[^>]*>([\s\S]*?)<\/sourcefile>/g;
   // NB: assumes JaCoCo's fixed attribute order (nr, mi, ci) — safe for generated XML.
   const lineRe = /<line\s+nr="(\d+)"\s+mi="(\d+)"\s+ci="(\d+)"[^/]*\/>/g;
killedBy: loadJacocoIntoStore parses JaCoCo XML and ingests line coverage into store
statusReason: expected undefined to be defined

[Killed] Regex
src/core/jacocoParse.ts:22:24
 export function parseJacocoToStatementCovers(xml: string): Map<string, StatementCover[]> {
   const byFile = new Map<string, StatementCover[]>();
   const packageRe = /<package\s+name="([^"]*)"[^>]*>/g;
-  const sourcefileRe = /<sourcefile\s+name="([^"]*)"[^>]*>([\s\S]*?)<\/sourcefile>/g;
+  const sourcefileRe = /<sourcefile\s+name="([^"]*)"[^>]*>([\s\S])<\/sourcefile>/g;
   // NB: assumes JaCoCo's fixed attribute order (nr, mi, ci) — safe for generated XML.
   const lineRe = /<line\s+nr="(\d+)"\s+mi="(\d+)"\s+ci="(\d+)"[^/]*\/>/g;
killedBy: loadJacocoIntoStore parses JaCoCo XML and ingests line coverage into store
statusReason: expected undefined to be defined

[Killed] Regex
src/core/jacocoParse.ts:24:18
   const packageRe = /<package\s+name="([^"]*)"[^>]*>/g;
   const sourcefileRe = /<sourcefile\s+name="([^"]*)"[^>]*>([\s\S]*?)<\/sourcefile>/g;
   // NB: assumes JaCoCo's fixed attribute order (nr, mi, ci) — safe for generated XML.
-  const lineRe = /<line\s+nr="(\d+)"\s+mi="(\d+)"\s+ci="(\d+)"[^/]*\/>/g;
+  const lineRe = /<line\s+nr="(\d+)"\s+mi="(\d+)"\s+ci="(\d)"[^/]*\/>/g;
 
   let pkgMatch: RegExpExecArray | null;
killedBy: parseJacocoToStatementCovers handles ci with large numeric values
statusReason: expected { executed: true, startLine: 1, …(1) } to deeply equal { startLine: +0, endLine: +0, …(1) }

[Killed] Regex
src/core/jacocoParse.ts:24:18
   const packageRe = /<package\s+name="([^"]*)"[^>]*>/g;
   const sourcefileRe = /<sourcefile\s+name="([^"]*)"[^>]*>([\s\S]*?)<\/sourcefile>/g;
   // NB: assumes JaCoCo's fixed attribute order (nr, mi, ci) — safe for generated XML.
-  const lineRe = /<line\s+nr="(\d+)"\s+mi="(\d+)"\s+ci="(\d+)"[^/]*\/>/g;
+  const lineRe = /<line\S+nr="(\d+)"\s+mi="(\d+)"\s+ci="(\d+)"[^/]*\/>/g;
 
   let pkgMatch: RegExpExecArray | null;
killedBy: loadJacocoIntoStore parses JaCoCo XML and ingests line coverage into store
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/core/jacocoParse.ts:27:10
   const lineRe = /<line\s+nr="(\d+)"\s+mi="(\d+)"\s+ci="(\d+)"[^/]*\/>/g;
 
   let pkgMatch: RegExpExecArray | null;
-  while ((pkgMatch = packageRe.exec(xml)) !== null) {
+  while ((pkgMatch = packageRe.exec(xml)) === null) {
     const pkgName = pkgMatch[1];
     const pkgStart = pkgMatch.index;
killedBy: parseJacocoToStatementCovers parses a single sourcefile with line elements
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/core/jacocoParse.ts:27:10
   const lineRe = /<line\s+nr="(\d+)"\s+mi="(\d+)"\s+ci="(\d+)"[^/]*\/>/g;
 
   let pkgMatch: RegExpExecArray | null;
-  while ((pkgMatch = packageRe.exec(xml)) !== null) {
+  while (false) {
     const pkgName = pkgMatch[1];
     const pkgStart = pkgMatch.index;
killedBy: parseJacocoToStatementCovers parses a single sourcefile with line elements
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/core/jacocoParse.ts:31:35
     const pkgName = pkgMatch[1];
     const pkgStart = pkgMatch.index;
     // Find the end of this package element
-    const pkgEndIdx = xml.indexOf("</package>", pkgStart);
+    const pkgEndIdx = xml.indexOf("", pkgStart);
     const pkgBody = pkgEndIdx > pkgStart ? xml.slice(pkgStart, pkgEndIdx) : xml.slice(pkgStart);
 
killedBy: parseJacocoToStatementCovers parses multiple packages with multiple sourcefiles
statusReason: expected 5 to be 3 // Object.is equality

[Killed] EqualityOperator
src/core/jacocoParse.ts:32:21
     const pkgStart = pkgMatch.index;
     // Find the end of this package element
     const pkgEndIdx = xml.indexOf("</package>", pkgStart);
-    const pkgBody = pkgEndIdx > pkgStart ? xml.slice(pkgStart, pkgEndIdx) : xml.slice(pkgStart);
+    const pkgBody = pkgEndIdx <= pkgStart ? xml.slice(pkgStart, pkgEndIdx) : xml.slice(pkgStart);
 
     let sfMatch: RegExpExecArray | null;
killedBy: parseJacocoToStatementCovers parses multiple packages with multiple sourcefiles
statusReason: expected 5 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/core/jacocoParse.ts:32:21
     const pkgStart = pkgMatch.index;
     // Find the end of this package element
     const pkgEndIdx = xml.indexOf("</package>", pkgStart);
-    const pkgBody = pkgEndIdx > pkgStart ? xml.slice(pkgStart, pkgEndIdx) : xml.slice(pkgStart);
+    const pkgBody = false ? xml.slice(pkgStart, pkgEndIdx) : xml.slice(pkgStart);
 
     let sfMatch: RegExpExecArray | null;
killedBy: parseJacocoToStatementCovers parses multiple packages with multiple sourcefiles
statusReason: expected 5 to be 3 // Object.is equality

[Killed] EqualityOperator
src/core/jacocoParse.ts:36:12
 
     let sfMatch: RegExpExecArray | null;
     sourcefileRe.lastIndex = 0;
-    while ((sfMatch = sourcefileRe.exec(pkgBody)) !== null) {
+    while ((sfMatch = sourcefileRe.exec(pkgBody)) === null) {
       const sfName = sfMatch[1];
       const sfBody = sfMatch[2];
killedBy: loadJacocoIntoStore parses JaCoCo XML and ingests line coverage into store
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/core/jacocoParse.ts:36:12
 
     let sfMatch: RegExpExecArray | null;
     sourcefileRe.lastIndex = 0;
-    while ((sfMatch = sourcefileRe.exec(pkgBody)) !== null) {
+    while (false) {
       const sfName = sfMatch[1];
       const sfBody = sfMatch[2];
killedBy: parseJacocoToStatementCovers parses a single sourcefile with line elements
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/core/jacocoParse.ts:39:33
     while ((sfMatch = sourcefileRe.exec(pkgBody)) !== null) {
       const sfName = sfMatch[1];
       const sfBody = sfMatch[2];
-      const fileKey = pkgName ? `${pkgName}/${sfName}` : sfName;
+      const fileKey = pkgName ? `` : sfName;
 
       const stmts: StatementCover[] = [];
killedBy: parseJacocoToStatementCovers parses a single sourcefile with line elements
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/core/jacocoParse.ts:44:14
       const stmts: StatementCover[] = [];
       let lineMatch: RegExpExecArray | null;
       lineRe.lastIndex = 0;
-      while ((lineMatch = lineRe.exec(sfBody)) !== null) {
+      while ((lineMatch = lineRe.exec(sfBody)) === null) {
         const nr = parseInt(lineMatch[1], 10);
         const ci = parseInt(lineMatch[3], 10);
killedBy: parseJacocoToStatementCovers parses a single sourcefile with line elements
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/core/jacocoParse.ts:44:14
       const stmts: StatementCover[] = [];
       let lineMatch: RegExpExecArray | null;
       lineRe.lastIndex = 0;
-      while ((lineMatch = lineRe.exec(sfBody)) !== null) {
+      while (false) {
         const nr = parseInt(lineMatch[1], 10);
         const ci = parseInt(lineMatch[3], 10);
killedBy: parseJacocoToStatementCovers parses a single sourcefile with line elements
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/core/jacocoParse.ts:47:61
       while ((lineMatch = lineRe.exec(sfBody)) !== null) {
         const nr = parseInt(lineMatch[1], 10);
         const ci = parseInt(lineMatch[3], 10);
-        if (Number.isNaN(nr) || Number.isNaN(ci) || nr < 1) {
-          continue;
-        }
+        if (Number.isNaN(nr) || Number.isNaN(ci) || nr < 1) {}
         stmts.push({
           executed: ci > 0,
killedBy: parseJacocoToStatementCovers treats line with nr=0 as invalid and skips it
statusReason: expected [ { executed: true, …(2) }, …(1) ] to deeply equal [ Array(1) ]

[Killed] ConditionalExpression
src/core/jacocoParse.ts:47:13
       while ((lineMatch = lineRe.exec(sfBody)) !== null) {
         const nr = parseInt(lineMatch[1], 10);
         const ci = parseInt(lineMatch[3], 10);
-        if (Number.isNaN(nr) || Number.isNaN(ci) || nr < 1) {
+        if (false) {
           continue;
         }
killedBy: parseJacocoToStatementCovers treats line with nr=0 as invalid and skips it
statusReason: expected [ { executed: true, …(2) }, …(1) ] to deeply equal [ Array(1) ]

[Killed] EqualityOperator
src/core/jacocoParse.ts:51:21
           continue;
         }
         stmts.push({
-          executed: ci > 0,
+          executed: ci >= 0,
           startLine: nr - 1,
           endLine: nr - 1,
killedBy: loadJacocoIntoStore parses JaCoCo XML and ingests line coverage into store
statusReason: expected { executed: true, startLine: 10, …(1) } to deeply equal { startLine: 10, endLine: 10, …(1) }

[Killed] EqualityOperator
src/core/jacocoParse.ts:51:21
           continue;
         }
         stmts.push({
-          executed: ci > 0,
+          executed: ci <= 0,
           startLine: nr - 1,
           endLine: nr - 1,
killedBy: parseJacocoToStatementCovers parses a single sourcefile with line elements
statusReason: expected { executed: false, startLine: 9, …(1) } to deeply equal { startLine: 9, endLine: 9, …(1) }

[Killed] ArithmeticOperator
src/core/jacocoParse.ts:52:22
         }
         stmts.push({
           executed: ci > 0,
-          startLine: nr - 1,
+          startLine: nr + 1,
           endLine: nr - 1,
         });
killedBy: loadJacocoIntoStore parses JaCoCo XML and ingests line coverage into store
statusReason: expected { executed: true, startLine: 11, …(1) } to deeply equal { startLine: 9, endLine: 9, …(1) }

[Killed] ArithmeticOperator
src/core/jacocoParse.ts:53:20
         stmts.push({
           executed: ci > 0,
           startLine: nr - 1,
-          endLine: nr - 1,
+          endLine: nr + 1,
         });
       }
killedBy: parseJacocoToStatementCovers parses a single sourcefile with line elements
statusReason: expected { executed: true, startLine: 9, …(1) } to deeply equal { startLine: 9, endLine: 9, …(1) }

[Killed] EqualityOperator
src/core/jacocoParse.ts:57:11
         });
       }
 
-      if (stmts.length > 0) {
+      if (stmts.length >= 0) {
         byFile.set(fileKey, stmts);
       }
killedBy: parseJacocoToStatementCovers skips sourcefile with no line elements
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/core/jacocoParse.ts:57:11
         });
       }
 
-      if (stmts.length > 0) {
+      if (stmts.length <= 0) {
         byFile.set(fileKey, stmts);
       }
killedBy: parseJacocoToStatementCovers parses a single sourcefile with line elements
statusReason: expected undefined to be defined
