[Killed] StringLiteral
src/core/lcovParse.ts:9:21
  */
 export function parseLcovToStatementCovers(lcovText: string): Map<string, StatementCover[]> {
   const byFile = new Map<string, StatementCover[]>();
-  let currentFile = "";
+  let currentFile = "Stryker was here!";
   const lines = lcovText.split(/\r?\n/);
   for (const line of lines) {
killedBy: parseLcovToStatementCovers ignores DA lines before any SF block
statusReason: expected 2 to deeply equal 1

[Killed] ConditionalExpression
src/core/lcovParse.ts:12:9
   let currentFile = "";
   const lines = lcovText.split(/\r?\n/);
   for (const line of lines) {
-    if (line.startsWith("SF:")) {
+    if (true) {
       currentFile = line.slice(3).trim();
       continue;
killedBy: parseLcovToStatementCovers parses SF and DA records with 1-based lines
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/core/lcovParse.ts:12:9
   let currentFile = "";
   const lines = lcovText.split(/\r?\n/);
   for (const line of lines) {
-    if (line.startsWith("SF:")) {
+    if (false) {
       currentFile = line.slice(3).trim();
       continue;
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: expected undefined to be defined

[Killed] MethodExpression
src/core/lcovParse.ts:13:21
   const lines = lcovText.split(/\r?\n/);
   for (const line of lines) {
     if (line.startsWith("SF:")) {
-      currentFile = line.slice(3).trim();
+      currentFile = line.trim();
       continue;
     }
killedBy: parseLcovToStatementCovers parses SF and DA records with 1-based lines
statusReason: expected undefined to be defined

[Killed] MethodExpression
src/core/lcovParse.ts:13:21
   const lines = lcovText.split(/\r?\n/);
   for (const line of lines) {
     if (line.startsWith("SF:")) {
-      currentFile = line.slice(3).trim();
+      currentFile = line.slice(3);
       continue;
     }
killedBy: bugmagnet session 2026-04-15 parseLcovToStatementCovers – string edge cases trims whitespace from SF file path
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] EqualityOperator
src/core/lcovParse.ts:16:9
       currentFile = line.slice(3).trim();
       continue;
     }
-    if (line.trim() === "end_of_record") {
+    if (line.trim() !== "end_of_record") {
       currentFile = "";
       continue;
killedBy: parseLcovToStatementCovers parses SF and DA records with 1-based lines
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/core/lcovParse.ts:16:9
       currentFile = line.slice(3).trim();
       continue;
     }
-    if (line.trim() === "end_of_record") {
+    if (false) {
       currentFile = "";
       continue;
killedBy: parseLcovToStatementCovers ignores DA lines after end_of_record but before next SF
statusReason: expected [ { executed: true, …(2) }, …(1) ] to deeply equal [ Array(1) ]

[Survived] StringLiteral
src/core/lcovParse.ts:17:21
       continue;
     }
     if (line.trim() === "end_of_record") {
-      currentFile = "";
+      currentFile = "Stryker was here!";
       continue;
     }

[Killed] MethodExpression
src/core/lcovParse.ts:20:26
       currentFile = "";
       continue;
     }
-    if (!currentFile || !line.startsWith("DA:")) {
+    if (!currentFile || !line.endsWith("DA:")) {
       continue;
     }
killedBy: parseLcovToStatementCovers parses SF and DA records with 1-based lines
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/core/lcovParse.ts:20:9
       currentFile = "";
       continue;
     }
-    if (!currentFile || !line.startsWith("DA:")) {
+    if (true) {
       continue;
     }
killedBy: parseLcovToStatementCovers parses SF and DA records with 1-based lines
statusReason: expected undefined to be defined

[Killed] MethodExpression
src/core/lcovParse.ts:23:18
     if (!currentFile || !line.startsWith("DA:")) {
       continue;
     }
-    const rest = line.slice(3);
+    const rest = line;
     const comma = rest.indexOf(",");
     if (comma < 0) {
killedBy: parseLcovToStatementCovers parses SF and DA records with 1-based lines
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/core/lcovParse.ts:24:32
       continue;
     }
     const rest = line.slice(3);
-    const comma = rest.indexOf(",");
+    const comma = rest.indexOf("");
     if (comma < 0) {
       continue;
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/core/lcovParse.ts:25:20
     }
     const rest = line.slice(3);
     const comma = rest.indexOf(",");
-    if (comma < 0) {
-      continue;
-    }
+    if (comma < 0) {}
     const lineNo = parseInt(rest.slice(0, comma), 10);
     const hits = parseInt(rest.slice(comma + 1), 10);
killedBy: parseLcovToStatementCovers skips DA line with no comma
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/lcovParse.ts:25:9
     }
     const rest = line.slice(3);
     const comma = rest.indexOf(",");
-    if (comma < 0) {
+    if (comma >= 0) {
       continue;
     }
killedBy: parseLcovToStatementCovers parses SF and DA records with 1-based lines
statusReason: expected undefined to be defined

[Survived] MethodExpression
src/core/lcovParse.ts:28:29
     if (comma < 0) {
       continue;
     }
-    const lineNo = parseInt(rest.slice(0, comma), 10);
+    const lineNo = parseInt(rest, 10);
     const hits = parseInt(rest.slice(comma + 1), 10);
     if (Number.isNaN(lineNo) || Number.isNaN(hits) || lineNo < 1) {

[Killed] ArithmeticOperator
src/core/lcovParse.ts:29:38
       continue;
     }
     const lineNo = parseInt(rest.slice(0, comma), 10);
-    const hits = parseInt(rest.slice(comma + 1), 10);
+    const hits = parseInt(rest.slice(comma - 1), 10);
     if (Number.isNaN(lineNo) || Number.isNaN(hits) || lineNo < 1) {
       continue;
killedBy: parseLcovToStatementCovers parses SF and DA records with 1-based lines
statusReason: expected { executed: false, startLine: 9, …(1) } to match object { startLine: 9, endLine: 9, …(1) }

[Killed] MethodExpression
src/core/lcovParse.ts:29:27
       continue;
     }
     const lineNo = parseInt(rest.slice(0, comma), 10);
-    const hits = parseInt(rest.slice(comma + 1), 10);
+    const hits = parseInt(rest, 10);
     if (Number.isNaN(lineNo) || Number.isNaN(hits) || lineNo < 1) {
       continue;
killedBy: parseLcovToStatementCovers parses SF and DA records with 1-based lines
statusReason: expected { executed: true, startLine: 10, …(1) } to match object { startLine: 10, endLine: 10, …(1) }

[Killed] EqualityOperator
src/core/lcovParse.ts:30:55
     }
     const lineNo = parseInt(rest.slice(0, comma), 10);
     const hits = parseInt(rest.slice(comma + 1), 10);
-    if (Number.isNaN(lineNo) || Number.isNaN(hits) || lineNo < 1) {
+    if (Number.isNaN(lineNo) || Number.isNaN(hits) || lineNo >= 1) {
       continue;
     }
killedBy: parseLcovToStatementCovers parses SF and DA records with 1-based lines
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/core/lcovParse.ts:30:9
     }
     const lineNo = parseInt(rest.slice(0, comma), 10);
     const hits = parseInt(rest.slice(comma + 1), 10);
-    if (Number.isNaN(lineNo) || Number.isNaN(hits) || lineNo < 1) {
+    if (true) {
       continue;
     }
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: expected undefined to be defined

[Killed] ArithmeticOperator
src/core/lcovParse.ts:33:23
     if (Number.isNaN(lineNo) || Number.isNaN(hits) || lineNo < 1) {
       continue;
     }
-    const zeroBased = lineNo - 1;
+    const zeroBased = lineNo + 1;
     const stmt: StatementCover = {
       executed: hits > 0,
killedBy: parseLcovToStatementCovers parses SF and DA records with 1-based lines
statusReason: expected { executed: true, startLine: 11, …(1) } to match object { startLine: 9, endLine: 9, …(1) }

[Killed] ConditionalExpression
src/core/lcovParse.ts:35:17
     }
     const zeroBased = lineNo - 1;
     const stmt: StatementCover = {
-      executed: hits > 0,
+      executed: false,
       startLine: zeroBased,
       endLine: zeroBased,
killedBy: parseLcovToStatementCovers parses SF and DA records with 1-based lines
statusReason: expected { executed: false, startLine: 9, …(1) } to match object { startLine: 9, endLine: 9, …(1) }

[Killed] ConditionalExpression
src/core/lcovParse.ts:35:17
     }
     const zeroBased = lineNo - 1;
     const stmt: StatementCover = {
-      executed: hits > 0,
+      executed: true,
       startLine: zeroBased,
       endLine: zeroBased,
killedBy: parseLcovToStatementCovers parses SF and DA records with 1-based lines
statusReason: expected { executed: true, startLine: 10, …(1) } to match object { startLine: 10, endLine: 10, …(1) }

[Killed] ConditionalExpression
src/core/lcovParse.ts:40:9
       endLine: zeroBased,
     };
     let list = byFile.get(currentFile);
-    if (!list) {
+    if (true) {
       list = [];
       byFile.set(currentFile, list);
killedBy: parseLcovToStatementCovers parses SF and DA records with 1-based lines
statusReason: expected { Object (executed, startLine, ...) } to match object { startLine: 9, endLine: 9, …(1) }

[Killed] BlockStatement
src/core/lcovParse.ts:40:16
       endLine: zeroBased,
     };
     let list = byFile.get(currentFile);
-    if (!list) {
-      list = [];
-      byFile.set(currentFile, list);
-    }
+    if (!list) {}
     list.push(stmt);
   }
killedBy: parseLcovToStatementCovers parses SF and DA records with 1-based lines
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/core/lcovParse.ts:52:34
 /** Merge multiple LCOV maps; statements for the same URI are concatenated. */
 export function mergeLcovMaps(
   maps: ReadonlyArray<Map<string, StatementCover[]>>
-): Map<string, StatementCover[]> {
-  const out = new Map<string, StatementCover[]>();
-  for (const m of maps) {
-    for (const [k, v] of m) {
-      const cur = out.get(k);
-      out.set(k, cur ? [...cur, ...v] : [...v]);
-    }
-  }
-  return out;
-}
+): Map<string, StatementCover[]> {}
 
killedBy: mergeLcovMaps returns empty map for empty input array
statusReason: Cannot read properties of undefined (reading 'size')

[Killed] BlockStatement
src/core/lcovParse.ts:54:25
   maps: ReadonlyArray<Map<string, StatementCover[]>>
 ): Map<string, StatementCover[]> {
   const out = new Map<string, StatementCover[]>();
-  for (const m of maps) {
-    for (const [k, v] of m) {
-      const cur = out.get(k);
-      out.set(k, cur ? [...cur, ...v] : [...v]);
-    }
-  }
+  for (const m of maps) {}
   return out;
 }
killedBy: mergeLcovMaps returns copy of single map
statusReason: expected undefined to deeply equal [ { executed: true, …(2) } ]

[Killed] BlockStatement
src/core/lcovParse.ts:55:29
 ): Map<string, StatementCover[]> {
   const out = new Map<string, StatementCover[]>();
   for (const m of maps) {
-    for (const [k, v] of m) {
-      const cur = out.get(k);
-      out.set(k, cur ? [...cur, ...v] : [...v]);
-    }
+    for (const [k, v] of m) {}
   }
   return out;
killedBy: mergeLcovMaps returns copy of single map
statusReason: expected undefined to deeply equal [ { executed: true, …(2) } ]

[Killed] ArrayDeclaration
src/core/lcovParse.ts:57:41
   for (const m of maps) {
     for (const [k, v] of m) {
       const cur = out.get(k);
-      out.set(k, cur ? [...cur, ...v] : [...v]);
+      out.set(k, cur ? [...cur, ...v] : []);
     }
   }
killedBy: mergeLcovMaps returns copy of single map
statusReason: expected [] to deeply equal [ { executed: true, …(2) } ]
