[Killed] BlockStatement
src/core/metrics.ts:16:53
  * @param t   Fraction of code covered by tests, clamped to [0, 1].
  * @returns   CRAP score: CC² × (1 − T)³ + CC.
  */
-export function crap(cc: number, t: number): number {
-  const clampedT = clamp01(t);
-  const clampedCc = Math.max(0, cc);
-  return clampedCc * clampedCc * Math.pow(1 - clampedT, 3) + clampedCc;
-}
+export function crap(cc: number, t: number): number {}
 
 /** Compute failure risk F = R × CRAP(CC, T). */
killedBy: AnalysisOrchestrator applies churn multiplier when ChurnProvider is supplied
statusReason: expected NaN to be greater than NaN

[Killed] MethodExpression
src/core/metrics.ts:18:21
  */
 export function crap(cc: number, t: number): number {
   const clampedT = clamp01(t);
-  const clampedCc = Math.max(0, cc);
+  const clampedCc = Math.min(0, cc);
   return clampedCc * clampedCc * Math.pow(1 - clampedT, 3) + clampedCc;
 }
killedBy: AnalysisOrchestrator applies churn multiplier when ChurnProvider is supplied
statusReason: expected 0 to be greater than 0

[Killed] ArithmeticOperator
src/core/metrics.ts:19:10
 export function crap(cc: number, t: number): number {
   const clampedT = clamp01(t);
   const clampedCc = Math.max(0, cc);
-  return clampedCc * clampedCc * Math.pow(1 - clampedT, 3) + clampedCc;
+  return clampedCc * clampedCc * Math.pow(1 - clampedT, 3) - clampedCc;
 }
 
killedBy: AnalysisOrchestrator applies churn multiplier when ChurnProvider is supplied
statusReason: expected 0 to be greater than 0

[Killed] ArithmeticOperator
src/core/metrics.ts:19:10
 export function crap(cc: number, t: number): number {
   const clampedT = clamp01(t);
   const clampedCc = Math.max(0, cc);
-  return clampedCc * clampedCc * Math.pow(1 - clampedT, 3) + clampedCc;
+  return clampedCc / clampedCc * Math.pow(1 - clampedT, 3) + clampedCc;
 }
 
killedBy: bugmagnet session 2026-04-15 numeric edge cases handles zero coverage (t=0.0) producing higher CRAP
statusReason: expected 3 to be close to 6, received difference is 3, but expected 0.000005

[Killed] BlockStatement
src/core/metrics.ts:23:74
 }
 
 /** Compute failure risk F = R × CRAP(CC, T). */
-export function failureRisk(rank: number, cc: number, t: number): number {
-  return rank * crap(cc, t);
-}
+export function failureRisk(rank: number, cc: number, t: number): number {}
 
 /** Compute failure risk from a pre-computed CRAP value: F = R × CRAP. */
killedBy: failure risk F = R × CRAP matches paper F(A), F(B), F(C)
statusReason: expected undefined to be close to 19, received difference is NaN, but expected 0.5

[Killed] ArithmeticOperator
src/core/metrics.ts:24:10
 
 /** Compute failure risk F = R × CRAP(CC, T). */
 export function failureRisk(rank: number, cc: number, t: number): number {
-  return rank * crap(cc, t);
+  return rank / crap(cc, t);
 }
 
killedBy: failure risk F = R × CRAP matches paper F(A), F(B), F(C)
statusReason: expected 0.21079258010118046 to be close to 19, received difference is 18.78920741989882, but expected 0.5

[Killed] BlockStatement
src/core/metrics.ts:28:78
 }
 
 /** Compute failure risk from a pre-computed CRAP value: F = R × CRAP. */
-export function failureRiskFromCrap(rank: number, crapValue: number): number {
-  return rank * crapValue;
-}
+export function failureRiskFromCrap(rank: number, crapValue: number): number {}
 
 /** Clamp a number to [0, 1], treating NaN as 0. */
killedBy: AnalysisOrchestrator applies churn multiplier when ChurnProvider is supplied
statusReason: expected value must be number or bigint, received "undefined"

[Killed] ArithmeticOperator
src/core/metrics.ts:29:10
 
 /** Compute failure risk from a pre-computed CRAP value: F = R × CRAP. */
 export function failureRiskFromCrap(rank: number, crapValue: number): number {
-  return rank * crapValue;
+  return rank / crapValue;
 }
 
killedBy: failure risk F = R × CRAP uses precomputed CRAP when needed
statusReason: expected 0.21052631578947367 to be 19 // Object.is equality

[Killed] BlockStatement
src/core/metrics.ts:33:44
 }
 
 /** Clamp a number to [0, 1], treating NaN as 0. */
-export function clamp01(t: number): number {
-  if (Number.isNaN(t)) {
-    return 0;
-  }
-  return Math.min(1, Math.max(0, t));
-}
+export function clamp01(t: number): number {}
 
killedBy: AnalysisOrchestrator applies churn multiplier when ChurnProvider is supplied
statusReason: expected NaN to be greater than NaN

[Killed] BlockStatement
src/core/metrics.ts:34:24
 
 /** Clamp a number to [0, 1], treating NaN as 0. */
 export function clamp01(t: number): number {
-  if (Number.isNaN(t)) {
-    return 0;
-  }
+  if (Number.isNaN(t)) {}
   return Math.min(1, Math.max(0, t));
 }
killedBy: mutation-killing: clamp01 clamp01 returns 0 for NaN
statusReason: expected NaN to be 2 // Object.is equality

[Killed] ConditionalExpression
src/core/metrics.ts:34:7
 
 /** Clamp a number to [0, 1], treating NaN as 0. */
 export function clamp01(t: number): number {
-  if (Number.isNaN(t)) {
+  if (false) {
     return 0;
   }
killedBy: mutation-killing: clamp01 clamp01 returns 0 for NaN
statusReason: expected NaN to be 2 // Object.is equality

[Killed] MethodExpression
src/core/metrics.ts:37:10
   if (Number.isNaN(t)) {
     return 0;
   }
-  return Math.min(1, Math.max(0, t));
+  return Math.max(1, Math.max(0, t));
 }
 
killedBy: CRAP matches partial coverage example CC=4 T=0.3
statusReason: expected 4 to be close to 9.488, received difference is 5.4879999999999995, but expected 0.000005

[Killed] MethodExpression
src/core/metrics.ts:37:22
   if (Number.isNaN(t)) {
     return 0;
   }
-  return Math.min(1, Math.max(0, t));
+  return Math.min(1, Math.min(0, t));
 }
 
killedBy: AnalysisOrchestrator applies fallbackT when no coverage statements overlap symbol
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 0.000005
