[Killed] BlockStatement
src/core/rank.ts:14:87
 };
 
 /** Build outgoing adjacency: caller -> set of callees (unique). */
-export function calleesByCaller(edges: readonly CallEdge[]): Map<string, Set<string>> {
-  const map = new Map<string, Set<string>>();
-  for (const e of edges) {
-    let set = map.get(e.caller);
-    if (!set) {
-      set = new Set();
-      map.set(e.caller, set);
-    }
-    set.add(e.callee);
-  }
-  return map;
-}
+export function calleesByCaller(edges: readonly CallEdge[]): Map<string, Set<string>> {}
 
 export function allNodeIds(edges: readonly CallEdge[]): Set<string> {
killedBy: edgesFromCallerCallees builds a graph fake stream for rank integration
statusReason: callees is not iterable

[Killed] BlockStatement
src/core/rank.ts:16:26
 /** Build outgoing adjacency: caller -> set of callees (unique). */
 export function calleesByCaller(edges: readonly CallEdge[]): Map<string, Set<string>> {
   const map = new Map<string, Set<string>>();
-  for (const e of edges) {
-    let set = map.get(e.caller);
-    if (!set) {
-      set = new Set();
-      map.set(e.caller, set);
-    }
-    set.add(e.callee);
-  }
+  for (const e of edges) {}
   return map;
 }
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: expected 1 to be greater than 1

[Killed] BlockStatement
src/core/rank.ts:18:15
   const map = new Map<string, Set<string>>();
   for (const e of edges) {
     let set = map.get(e.caller);
-    if (!set) {
-      set = new Set();
-      map.set(e.caller, set);
-    }
+    if (!set) {}
     set.add(e.callee);
   }
killedBy: edgesFromCallerCallees builds a graph fake stream for rank integration
statusReason: Cannot read properties of undefined (reading 'add')

[Killed] ConditionalExpression
src/core/rank.ts:18:9
   const map = new Map<string, Set<string>>();
   for (const e of edges) {
     let set = map.get(e.caller);
-    if (!set) {
+    if (true) {
       set = new Set();
       map.set(e.caller, set);
killedBy: Rank computation (Dependable Dependencies) proportional split: one step from P=4 to three callees adds 4/3 each
statusReason: expected 1 to be close to 2.333333333333333, received difference is 1.333333333333333, but expected 0.000005

[Killed] BlockStatement
src/core/rank.ts:27:69
   return map;
 }
 
-export function allNodeIds(edges: readonly CallEdge[]): Set<string> {
-  const ids = new Set<string>();
-  for (const e of edges) {
-    ids.add(e.caller);
-    ids.add(e.callee);
-  }
-  return ids;
-}
+export function allNodeIds(edges: readonly CallEdge[]): Set<string> {}
 
 /**
killedBy: Rank computation (Dependable Dependencies) star: callee called by six rank-1 callers converges to R=7
statusReason: nodeIds is not iterable

[Killed] BlockStatement
src/core/rank.ts:29:26
 
 export function allNodeIds(edges: readonly CallEdge[]): Set<string> {
   const ids = new Set<string>();
-  for (const e of edges) {
-    ids.add(e.caller);
-    ids.add(e.callee);
-  }
+  for (const e of edges) {}
   return ids;
 }
killedBy: edgesFromCallerCallees builds a graph fake stream for rank integration
statusReason: expected undefined to be close to 3, received difference is NaN, but expected 0.0005

[Killed] BlockStatement
src/core/rank.ts:45:24
   outDegree: ReadonlyMap<string, number>,
   incomingContributions: ReadonlyMap<string, readonly { caller: string }[]>,
   rOld: ReadonlyMap<string, number>
-): Map<string, number> {
-  const next = new Map<string, number>();
-  for (const id of nodeIds) {
-    let sum = 0;
-    const incoming = incomingContributions.get(id);
-    if (incoming) {
-      for (const { caller } of incoming) {
-        const deg = outDegree.get(caller) ?? 0;
-        if (deg > 0) {
-          sum += (rOld.get(caller) ?? 1) / deg;
-        }
-      }
-    }
-    next.set(id, 1 + sum);
-  }
-  return next;
-}
+): Map<string, number> {}
 
 export function buildIncomingMap(edges: readonly CallEdge[]): Map<string, { caller: string }[]> {
killedBy: Rank computation (Dependable Dependencies) star: callee called by six rank-1 callers converges to R=7
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/core/rank.ts:47:29
   rOld: ReadonlyMap<string, number>
 ): Map<string, number> {
   const next = new Map<string, number>();
-  for (const id of nodeIds) {
-    let sum = 0;
-    const incoming = incomingContributions.get(id);
-    if (incoming) {
-      for (const { caller } of incoming) {
-        const deg = outDegree.get(caller) ?? 0;
-        if (deg > 0) {
-          sum += (rOld.get(caller) ?? 1) / deg;
-        }
-      }
-    }
-    next.set(id, 1 + sum);
-  }
+  for (const id of nodeIds) {}
   return next;
 }
killedBy: edgesFromCallerCallees builds a graph fake stream for rank integration
statusReason: expected undefined to be close to 3, received difference is NaN, but expected 0.0005

[Killed] ConditionalExpression
src/core/rank.ts:50:9
   for (const id of nodeIds) {
     let sum = 0;
     const incoming = incomingContributions.get(id);
-    if (incoming) {
+    if (true) {
       for (const { caller } of incoming) {
         const deg = outDegree.get(caller) ?? 0;
killedBy: Rank computation (Dependable Dependencies) star: callee called by six rank-1 callers converges to R=7
statusReason: incoming is not iterable

[Killed] BlockStatement
src/core/rank.ts:50:19
   for (const id of nodeIds) {
     let sum = 0;
     const incoming = incomingContributions.get(id);
-    if (incoming) {
-      for (const { caller } of incoming) {
-        const deg = outDegree.get(caller) ?? 0;
-        if (deg > 0) {
-          sum += (rOld.get(caller) ?? 1) / deg;
-        }
-      }
-    }
+    if (incoming) {}
     next.set(id, 1 + sum);
   }
killedBy: Rank computation (Dependable Dependencies) star: callee called by six rank-1 callers converges to R=7
statusReason: expected 1 to be close to 7, received difference is 6, but expected 0.000005

[Killed] BlockStatement
src/core/rank.ts:51:42
     let sum = 0;
     const incoming = incomingContributions.get(id);
     if (incoming) {
-      for (const { caller } of incoming) {
-        const deg = outDegree.get(caller) ?? 0;
-        if (deg > 0) {
-          sum += (rOld.get(caller) ?? 1) / deg;
-        }
-      }
+      for (const { caller } of incoming) {}
     }
     next.set(id, 1 + sum);
killedBy: edgesFromCallerCallees builds a graph fake stream for rank integration
statusReason: expected 1 to be close to 3, received difference is 2, but expected 0.0005

[Killed] LogicalOperator
src/core/rank.ts:52:21
     const incoming = incomingContributions.get(id);
     if (incoming) {
       for (const { caller } of incoming) {
-        const deg = outDegree.get(caller) ?? 0;
+        const deg = outDegree.get(caller) && 0;
         if (deg > 0) {
           sum += (rOld.get(caller) ?? 1) / deg;
killedBy: Rank computation (Dependable Dependencies) star: callee called by six rank-1 callers converges to R=7
statusReason: expected 1 to be close to 7, received difference is 6, but expected 0.000005

[Killed] ConditionalExpression
src/core/rank.ts:53:13
     if (incoming) {
       for (const { caller } of incoming) {
         const deg = outDegree.get(caller) ?? 0;
-        if (deg > 0) {
+        if (true) {
           sum += (rOld.get(caller) ?? 1) / deg;
         }
killedBy: mutation-killing: rank.ts rankOneStep: caller with outDegree 0 contributes nothing
statusReason: expected Infinity to be 1 // Object.is equality

[Killed] BlockStatement
src/core/rank.ts:53:22
     if (incoming) {
       for (const { caller } of incoming) {
         const deg = outDegree.get(caller) ?? 0;
-        if (deg > 0) {
-          sum += (rOld.get(caller) ?? 1) / deg;
-        }
+        if (deg > 0) {}
       }
     }
killedBy: Rank computation (Dependable Dependencies) star: callee called by six rank-1 callers converges to R=7
statusReason: expected 1 to be close to 7, received difference is 6, but expected 0.000005

[Killed] AssignmentOperator
src/core/rank.ts:54:11
       for (const { caller } of incoming) {
         const deg = outDegree.get(caller) ?? 0;
         if (deg > 0) {
-          sum += (rOld.get(caller) ?? 1) / deg;
+          sum -= (rOld.get(caller) ?? 1) / deg;
         }
       }
killedBy: Rank computation (Dependable Dependencies) star: callee called by six rank-1 callers converges to R=7
statusReason: expected -5 to be close to 7, received difference is 12, but expected 0.000005

[Killed] ArithmeticOperator
src/core/rank.ts:54:18
       for (const { caller } of incoming) {
         const deg = outDegree.get(caller) ?? 0;
         if (deg > 0) {
-          sum += (rOld.get(caller) ?? 1) / deg;
+          sum += (rOld.get(caller) ?? 1) * deg;
         }
       }
killedBy: Rank computation (Dependable Dependencies) proportional split: one step from P=4 to three callees adds 4/3 each
statusReason: expected 13 to be close to 2.333333333333333, received difference is 10.666666666666668, but expected 0.000005

[Killed] ArithmeticOperator
src/core/rank.ts:58:18
         }
       }
     }
-    next.set(id, 1 + sum);
+    next.set(id, 1 - sum);
   }
   return next;
killedBy: Rank computation (Dependable Dependencies) star: callee called by six rank-1 callers converges to R=7
statusReason: expected -5 to be close to 7, received difference is 12, but expected 0.000005

[Killed] BlockStatement
src/core/rank.ts:63:97
   return next;
 }
 
-export function buildIncomingMap(edges: readonly CallEdge[]): Map<string, { caller: string }[]> {
-  const callees = calleesByCaller(edges);
-  const incoming = new Map<string, { caller: string }[]>();
-  for (const [caller, calleesSet] of callees) {
-    for (const callee of calleesSet) {
-      let list = incoming.get(callee);
-      if (!list) {
-        list = [];
-        incoming.set(callee, list);
-      }
-      list.push({ caller });
-    }
-  }
-  return incoming;
-}
+export function buildIncomingMap(edges: readonly CallEdge[]): Map<string, { caller: string }[]> {}
 
 export function outDegreesFromCallees(callees: ReadonlyMap<string, Set<string>>): Map<string, number> {
killedBy: Rank computation (Dependable Dependencies) star: callee called by six rank-1 callers converges to R=7
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/core/rank.ts:66:47
 export function buildIncomingMap(edges: readonly CallEdge[]): Map<string, { caller: string }[]> {
   const callees = calleesByCaller(edges);
   const incoming = new Map<string, { caller: string }[]>();
-  for (const [caller, calleesSet] of callees) {
-    for (const callee of calleesSet) {
-      let list = incoming.get(callee);
-      if (!list) {
-        list = [];
-        incoming.set(callee, list);
-      }
-      list.push({ caller });
-    }
-  }
+  for (const [caller, calleesSet] of callees) {}
   return incoming;
 }
killedBy: Rank computation (Dependable Dependencies) star: callee called by six rank-1 callers converges to R=7
statusReason: expected 1 to be close to 7, received difference is 6, but expected 0.000005

[Killed] BlockStatement
src/core/rank.ts:67:38
   const callees = calleesByCaller(edges);
   const incoming = new Map<string, { caller: string }[]>();
   for (const [caller, calleesSet] of callees) {
-    for (const callee of calleesSet) {
-      let list = incoming.get(callee);
-      if (!list) {
-        list = [];
-        incoming.set(callee, list);
-      }
-      list.push({ caller });
-    }
+    for (const callee of calleesSet) {}
   }
   return incoming;
killedBy: Rank computation (Dependable Dependencies) star: callee called by six rank-1 callers converges to R=7
statusReason: expected 1 to be close to 7, received difference is 6, but expected 0.000005

[Killed] ConditionalExpression
src/core/rank.ts:69:11
   for (const [caller, calleesSet] of callees) {
     for (const callee of calleesSet) {
       let list = incoming.get(callee);
-      if (!list) {
+      if (true) {
         list = [];
         incoming.set(callee, list);
killedBy: Rank computation (Dependable Dependencies) star: callee called by six rank-1 callers converges to R=7
statusReason: expected 2 to be close to 7, received difference is 5, but expected 0.000005

[Killed] BooleanLiteral
src/core/rank.ts:69:11
   for (const [caller, calleesSet] of callees) {
     for (const callee of calleesSet) {
       let list = incoming.get(callee);
-      if (!list) {
+      if (list) {
         list = [];
         incoming.set(callee, list);
killedBy: Rank computation (Dependable Dependencies) star: callee called by six rank-1 callers converges to R=7
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/core/rank.ts:79:103
   return incoming;
 }
 
-export function outDegreesFromCallees(callees: ReadonlyMap<string, Set<string>>): Map<string, number> {
-  const deg = new Map<string, number>();
-  for (const [caller, set] of callees) {
-    deg.set(caller, set.size);
-  }
-  return deg;
-}
+export function outDegreesFromCallees(callees: ReadonlyMap<string, Set<string>>): Map<string, number> {}
 
 export function hasConverged(
killedBy: Rank computation (Dependable Dependencies) star: callee called by six rank-1 callers converges to R=7
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/core/rank.ts:81:40
 
 export function outDegreesFromCallees(callees: ReadonlyMap<string, Set<string>>): Map<string, number> {
   const deg = new Map<string, number>();
-  for (const [caller, set] of callees) {
-    deg.set(caller, set.size);
-  }
+  for (const [caller, set] of callees) {}
   return deg;
 }
killedBy: Rank computation (Dependable Dependencies) star: callee called by six rank-1 callers converges to R=7
statusReason: expected 1 to be close to 7, received difference is 6, but expected 0.000005

[Killed] BlockStatement
src/core/rank.ts:91:12
   rOld: ReadonlyMap<string, number>,
   rNew: ReadonlyMap<string, number>,
   epsilon: number
-): boolean {
-  let maxDelta = 0;
-  for (const [id, a] of rOld) {
-    const b = rNew.get(id)!;
-    maxDelta = Math.max(maxDelta, Math.abs(a - b));
-  }
-  return maxDelta < epsilon;
-}
+): boolean {}
 
 export function computeRanks(
killedBy: mutation-killing: rank.ts hasConverged: identical maps are converged for any positive epsilon
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/core/rank.ts:93:31
   epsilon: number
 ): boolean {
   let maxDelta = 0;
-  for (const [id, a] of rOld) {
-    const b = rNew.get(id)!;
-    maxDelta = Math.max(maxDelta, Math.abs(a - b));
-  }
+  for (const [id, a] of rOld) {}
   return maxDelta < epsilon;
 }
killedBy: Rank computation (Dependable Dependencies) two callers at converged R=4 into M yields R(M)=9 (paper orange box)
statusReason: expected 3 to be close to 9, received difference is 6, but expected 0.0005

[Killed] ArithmeticOperator
src/core/rank.ts:95:44
   let maxDelta = 0;
   for (const [id, a] of rOld) {
     const b = rNew.get(id)!;
-    maxDelta = Math.max(maxDelta, Math.abs(a - b));
+    maxDelta = Math.max(maxDelta, Math.abs(a + b));
   }
   return maxDelta < epsilon;
killedBy: mutation-killing: rank.ts hasConverged: identical maps are converged for any positive epsilon
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/core/rank.ts:95:16
   let maxDelta = 0;
   for (const [id, a] of rOld) {
     const b = rNew.get(id)!;
-    maxDelta = Math.max(maxDelta, Math.abs(a - b));
+    maxDelta = Math.min(maxDelta, Math.abs(a - b));
   }
   return maxDelta < epsilon;
killedBy: Rank computation (Dependable Dependencies) two callers at converged R=4 into M yields R(M)=9 (paper orange box)
statusReason: expected 3 to be close to 9, received difference is 6, but expected 0.0005

[Killed] EqualityOperator
src/core/rank.ts:97:10
     const b = rNew.get(id)!;
     maxDelta = Math.max(maxDelta, Math.abs(a - b));
   }
-  return maxDelta < epsilon;
+  return maxDelta <= epsilon;
 }
 
killedBy: mutation-killing: rank.ts hasConverged: maxDelta exactly equal to epsilon is NOT converged (strict <)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/rank.ts:97:10
     const b = rNew.get(id)!;
     maxDelta = Math.max(maxDelta, Math.abs(a - b));
   }
-  return maxDelta < epsilon;
+  return maxDelta >= epsilon;
 }
 
killedBy: Rank computation (Dependable Dependencies) two callers at converged R=4 into M yields R(M)=9 (paper orange box)
statusReason: expected 3 to be close to 9, received difference is 6, but expected 0.0005

[Killed] BlockStatement
src/core/rank.ts:103:24
 export function computeRanks(
   edges: readonly CallEdge[],
   { maxIterations = 100, epsilon = 1e-6 }: Partial<RankOptions> = {}
-): Map<string, number> {
-  const nodeIds = allNodeIds(edges);
-  const callees = calleesByCaller(edges);
-  const outDeg = outDegreesFromCallees(callees);
-  const incoming = buildIncomingMap(edges);
-
-  let r = new Map<string, number>();
-  for (const id of nodeIds) {
-    r.set(id, 1);
-  }
-
-  for (let i = 0; i < maxIterations; i++) {
-    const rNext = rankOneStep(nodeIds, outDeg, incoming, r);
-    const converged = hasConverged(r, rNext, epsilon);
-    r = rNext;
-    if (converged) {
-      break;
-    }
-  }
-  return r;
-}
+): Map<string, number> {}
 
killedBy: Rank computation (Dependable Dependencies) star: callee called by six rank-1 callers converges to R=7
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/core/rank.ts:110:29
   const incoming = buildIncomingMap(edges);
 
   let r = new Map<string, number>();
-  for (const id of nodeIds) {
-    r.set(id, 1);
-  }
+  for (const id of nodeIds) {}
 
   for (let i = 0; i < maxIterations; i++) {
killedBy: Rank computation (Dependable Dependencies) two callers at converged R=4 into M yields R(M)=9 (paper orange box)
statusReason: expected 3 to be close to 9, received difference is 6, but expected 0.0005

[Killed] BlockStatement
src/core/rank.ts:114:43
     r.set(id, 1);
   }
 
-  for (let i = 0; i < maxIterations; i++) {
-    const rNext = rankOneStep(nodeIds, outDeg, incoming, r);
-    const converged = hasConverged(r, rNext, epsilon);
-    r = rNext;
-    if (converged) {
-      break;
-    }
-  }
+  for (let i = 0; i < maxIterations; i++) {}
   return r;
 }
killedBy: Rank computation (Dependable Dependencies) star: callee called by six rank-1 callers converges to R=7
statusReason: expected 1 to be close to 7, received difference is 6, but expected 0.000005

[Killed] EqualityOperator
src/core/rank.ts:114:19
     r.set(id, 1);
   }
 
-  for (let i = 0; i < maxIterations; i++) {
+  for (let i = 0; i <= maxIterations; i++) {
     const rNext = rankOneStep(nodeIds, outDeg, incoming, r);
     const converged = hasConverged(r, rNext, epsilon);
killedBy: mutation-killing: rank.ts computeRanks: maxIterations=0 runs zero iterations
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/rank.ts:118:9
     const rNext = rankOneStep(nodeIds, outDeg, incoming, r);
     const converged = hasConverged(r, rNext, epsilon);
     r = rNext;
-    if (converged) {
+    if (true) {
       break;
     }
killedBy: Rank computation (Dependable Dependencies) two callers at converged R=4 into M yields R(M)=9 (paper orange box)
statusReason: expected 3 to be close to 9, received difference is 6, but expected 0.0005

[Timeout] BlockStatement
src/core/rank.ts:118:20
     const rNext = rankOneStep(nodeIds, outDeg, incoming, r);
     const converged = hasConverged(r, rNext, epsilon);
     r = rNext;
-    if (converged) {
-      break;
-    }
+    if (converged) {}
   }
   return r;
