[Killed] BlockStatement
src/core/rollup.ts:17:107
  * @param mode "max" highlights the worst hotspot per file; "sum" highlights cumulative file risk.
  * @returns Map from file URI to aggregated risk score.
  */
-export function rollupFileRisk(rows: readonly SymbolRiskRow[], mode: FileRollupMode): Map<string, number> {
-  const riskByFile = new Map<string, number[]>();
-  for (const row of rows) {
-    let values = riskByFile.get(row.uri);
-    if (!values) {
-      values = [];
-      riskByFile.set(row.uri, values);
-    }
-    values.push(row.f);
-  }
-  const result = new Map<string, number>();
-  for (const [uri, values] of riskByFile) {
-    if (mode === "sum") {
-      result.set(uri, values.reduce((acc, val) => acc + val, 0));
-    } else {
-      result.set(uri, Math.max(...values));
-    }
-  }
-  return result;
-}
+export function rollupFileRisk(rows: readonly SymbolRiskRow[], mode: FileRollupMode): Map<string, number> {}
 
 /** Classify file risk into decoration tiers for editor highlighting. */
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] BlockStatement
src/core/rollup.ts:19:27
  */
 export function rollupFileRisk(rows: readonly SymbolRiskRow[], mode: FileRollupMode): Map<string, number> {
   const riskByFile = new Map<string, number[]>();
-  for (const row of rows) {
-    let values = riskByFile.get(row.uri);
-    if (!values) {
-      values = [];
-      riskByFile.set(row.uri, values);
-    }
-    values.push(row.f);
-  }
+  for (const row of rows) {}
   const result = new Map<string, number>();
   for (const [uri, values] of riskByFile) {
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/rollup.ts:21:18
   const riskByFile = new Map<string, number[]>();
   for (const row of rows) {
     let values = riskByFile.get(row.uri);
-    if (!values) {
-      values = [];
-      riskByFile.set(row.uri, values);
-    }
+    if (!values) {}
     values.push(row.f);
   }
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BooleanLiteral
src/core/rollup.ts:21:9
   const riskByFile = new Map<string, number[]>();
   for (const row of rows) {
     let values = riskByFile.get(row.uri);
-    if (!values) {
+    if (values) {
       values = [];
       riskByFile.set(row.uri, values);
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/core/rollup.ts:28:43
     values.push(row.f);
   }
   const result = new Map<string, number>();
-  for (const [uri, values] of riskByFile) {
-    if (mode === "sum") {
-      result.set(uri, values.reduce((acc, val) => acc + val, 0));
-    } else {
-      result.set(uri, Math.max(...values));
-    }
-  }
+  for (const [uri, values] of riskByFile) {}
   return result;
 }
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/rollup.ts:29:9
   }
   const result = new Map<string, number>();
   for (const [uri, values] of riskByFile) {
-    if (mode === "sum") {
+    if (mode !== "sum") {
       result.set(uri, values.reduce((acc, val) => acc + val, 0));
     } else {
killedBy: AnalysisOrchestrator respects rollup mode from configuration
statusReason: expected 2 to be close to 4, received difference is 2, but expected 0.000005

[Killed] BlockStatement
src/core/rollup.ts:29:25
   }
   const result = new Map<string, number>();
   for (const [uri, values] of riskByFile) {
-    if (mode === "sum") {
-      result.set(uri, values.reduce((acc, val) => acc + val, 0));
-    } else {
+    if (mode === "sum") {} else {
       result.set(uri, Math.max(...values));
     }
killedBy: AnalysisOrchestrator respects rollup mode from configuration
statusReason: expected undefined to be close to 4, received difference is NaN, but expected 0.000005

[Killed] ArrowFunction
src/core/rollup.ts:30:37
   const result = new Map<string, number>();
   for (const [uri, values] of riskByFile) {
     if (mode === "sum") {
-      result.set(uri, values.reduce((acc, val) => acc + val, 0));
+      result.set(uri, values.reduce(() => undefined, 0));
     } else {
       result.set(uri, Math.max(...values));
killedBy: AnalysisOrchestrator respects rollup mode from configuration
statusReason: expected undefined to be close to 4, received difference is NaN, but expected 0.000005

[Killed] ArithmeticOperator
src/core/rollup.ts:30:51
   const result = new Map<string, number>();
   for (const [uri, values] of riskByFile) {
     if (mode === "sum") {
-      result.set(uri, values.reduce((acc, val) => acc + val, 0));
+      result.set(uri, values.reduce((acc, val) => acc - val, 0));
     } else {
       result.set(uri, Math.max(...values));
killedBy: AnalysisOrchestrator respects rollup mode from configuration
statusReason: expected -4 to be close to 4, received difference is 8, but expected 0.000005

[Killed] BlockStatement
src/core/rollup.ts:31:12
   for (const [uri, values] of riskByFile) {
     if (mode === "sum") {
       result.set(uri, values.reduce((acc, val) => acc + val, 0));
-    } else {
-      result.set(uri, Math.max(...values));
-    }
+    } else {}
   }
   return result;
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/core/rollup.ts:32:23
     if (mode === "sum") {
       result.set(uri, values.reduce((acc, val) => acc + val, 0));
     } else {
-      result.set(uri, Math.max(...values));
+      result.set(uri, Math.min(...values));
     }
   }
killedBy: file rollup max mode takes maximum F per uri
statusReason: expected 3 to be 10 // Object.is equality

[Killed] BlockStatement
src/core/rollup.ts:43:30
   fileMaxF: number,
   warnThreshold: number,
   errorThreshold: number
-): "none" | "warn" | "error" {
-  if (fileMaxF >= errorThreshold) {
-    return "error";
-  }
-  if (fileMaxF >= warnThreshold) {
-    return "warn";
-  }
-  return "none";
-}
+): "none" | "warn" | "error" {}
 
killedBy: decorationTier (re-export) returns error when fileMaxF >= error threshold
statusReason: expected undefined to be 'error' // Object.is equality

[Killed] BlockStatement
src/core/rollup.ts:44:35
   warnThreshold: number,
   errorThreshold: number
 ): "none" | "warn" | "error" {
-  if (fileMaxF >= errorThreshold) {
-    return "error";
-  }
+  if (fileMaxF >= errorThreshold) {}
   if (fileMaxF >= warnThreshold) {
     return "warn";
killedBy: decorationTier (re-export) returns error when fileMaxF >= error threshold
statusReason: expected 'warn' to be 'error' // Object.is equality

[Killed] EqualityOperator
src/core/rollup.ts:44:7
   warnThreshold: number,
   errorThreshold: number
 ): "none" | "warn" | "error" {
-  if (fileMaxF >= errorThreshold) {
+  if (fileMaxF < errorThreshold) {
     return "error";
   }
killedBy: decorationTier (view-model) returns error when max F >= error threshold
statusReason: expected 'warn' to be 'error' // Object.is equality

[Killed] BlockStatement
src/core/rollup.ts:47:34
   if (fileMaxF >= errorThreshold) {
     return "error";
   }
-  if (fileMaxF >= warnThreshold) {
-    return "warn";
-  }
+  if (fileMaxF >= warnThreshold) {}
   return "none";
 }
killedBy: decorationTier (re-export) returns warn between thresholds
statusReason: expected 'none' to be 'warn' // Object.is equality

[Killed] ConditionalExpression
src/core/rollup.ts:47:7
   if (fileMaxF >= errorThreshold) {
     return "error";
   }
-  if (fileMaxF >= warnThreshold) {
+  if (true) {
     return "warn";
   }
killedBy: decorationTier (re-export) returns none below warn threshold
statusReason: expected 'warn' to be 'none' // Object.is equality

[Killed] StringLiteral
src/core/rollup.ts:48:12
     return "error";
   }
   if (fileMaxF >= warnThreshold) {
-    return "warn";
+    return "";
   }
   return "none";
killedBy: decorationTier (view-model) returns warn between warn and error
statusReason: expected '' to be 'warn' // Object.is equality
