[Killed] BlockStatement
src/core/viewModel.ts:7:99
 export type SortField = "f" | "fPrime" | "g" | "cc" | "crap";
 
 /** Sort symbols by the given field, descending (highest first). */
-export function sortSymbols(symbols: readonly SymbolMetrics[], field: SortField): SymbolMetrics[] {
-  return [...symbols].sort((a, b) => b[field] - a[field]);
-}
+export function sortSymbols(symbols: readonly SymbolMetrics[], field: SortField): SymbolMetrics[] {}
 
 /** Sort symbols by failure risk F descending (highest risk first). */
killedBy: sortSymbols sorts by G descending
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArithmeticOperator
src/core/viewModel.ts:8:38
 
 /** Sort symbols by the given field, descending (highest first). */
 export function sortSymbols(symbols: readonly SymbolMetrics[], field: SortField): SymbolMetrics[] {
-  return [...symbols].sort((a, b) => b[field] - a[field]);
+  return [...symbols].sort((a, b) => b[field] + a[field]);
 }
 
killedBy: sortSymbols sorts by G descending
statusReason: expected [ 'a', 'b', 'c' ] to deeply equal [ 'b', 'c', 'a' ]

[Killed] MethodExpression
src/core/viewModel.ts:8:10
 
 /** Sort symbols by the given field, descending (highest first). */
 export function sortSymbols(symbols: readonly SymbolMetrics[], field: SortField): SymbolMetrics[] {
-  return [...symbols].sort((a, b) => b[field] - a[field]);
+  return [...symbols];
 }
 
killedBy: RiskTreeProvider getChildren groups multiple symbols under the same file node
statusReason: expected 5 to be 15 // Object.is equality

[Killed] BlockStatement
src/core/viewModel.ts:12:94
 }
 
 /** Sort symbols by failure risk F descending (highest risk first). */
-export function sortSymbolsByFDescending(symbols: readonly SymbolMetrics[]): SymbolMetrics[] {
-  return [...symbols].sort((a, b) => b.f - a.f);
-}
+export function sortSymbolsByFDescending(symbols: readonly SymbolMetrics[]): SymbolMetrics[] {}
 
 /** Filter symbols that belong to a specific file URI. */
killedBy: sortSymbolsByFDescending sorts highest F first
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArithmeticOperator
src/core/viewModel.ts:13:38
 
 /** Sort symbols by failure risk F descending (highest risk first). */
 export function sortSymbolsByFDescending(symbols: readonly SymbolMetrics[]): SymbolMetrics[] {
-  return [...symbols].sort((a, b) => b.f - a.f);
+  return [...symbols].sort((a, b) => b.f + a.f);
 }
 
killedBy: sortSymbolsByFDescending sorts highest F first
statusReason: expected [ 'a', 'b', 'c' ] to deeply equal [ 'b', 'c', 'a' ]

[Killed] ArrowFunction
src/core/viewModel.ts:13:28
 
 /** Sort symbols by failure risk F descending (highest risk first). */
 export function sortSymbolsByFDescending(symbols: readonly SymbolMetrics[]): SymbolMetrics[] {
-  return [...symbols].sort((a, b) => b.f - a.f);
+  return [...symbols].sort(() => undefined);
 }
 
killedBy: sortSymbolsByFDescending sorts highest F first
statusReason: expected [ 'a', 'b', 'c' ] to deeply equal [ 'b', 'c', 'a' ]

[Killed] BlockStatement
src/core/viewModel.ts:17:100
 }
 
 /** Filter symbols that belong to a specific file URI. */
-export function symbolsForFile(uriStr: string, symbols: readonly SymbolMetrics[]): SymbolMetrics[] {
-  return symbols.filter((s) => s.uri === uriStr);
-}
+export function symbolsForFile(uriStr: string, symbols: readonly SymbolMetrics[]): SymbolMetrics[] {}
 
 /** Format a Markdown hover breakdown showing all metric components. */
killedBy: symbolsForFile filters symbols matching the uri
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/core/viewModel.ts:18:25
 
 /** Filter symbols that belong to a specific file URI. */
 export function symbolsForFile(uriStr: string, symbols: readonly SymbolMetrics[]): SymbolMetrics[] {
-  return symbols.filter((s) => s.uri === uriStr);
+  return symbols.filter(() => undefined);
 }
 
killedBy: symbolsForFile filters symbols matching the uri
statusReason: expected [] to deeply equal [ 'a', 'c' ]

[Killed] MethodExpression
src/core/viewModel.ts:18:10
 
 /** Filter symbols that belong to a specific file URI. */
 export function symbolsForFile(uriStr: string, symbols: readonly SymbolMetrics[]): SymbolMetrics[] {
-  return symbols.filter((s) => s.uri === uriStr);
+  return symbols;
 }
 
killedBy: RiskTreeProvider getTreeItem returns max F≈0 for file node when no symbols match the URI
statusReason: expected 'max F≈99' to be 'max F≈0' // Object.is equality

[Killed] BlockStatement
src/core/viewModel.ts:22:64
 }
 
 /** Format a Markdown hover breakdown showing all metric components. */
-export function formatHoverBreakdown(s: SymbolMetrics): string {
-  return (
-    `**DDP risk**  F=${s.f.toFixed(1)}  (R×CRAP)\n\n` +
-    `- R (rank): ${s.r.toFixed(3)}\n` +
-    `- CRAP: ${s.crap.toFixed(2)}\n` +
-    `- CC: ${s.cc}\n` +
-    `- T (coverage): ${(s.t * 100).toFixed(0)}%\n\n` +
-    `High rank + high CRAP ⇒ higher impact if this unit fails.`
-  );
-}
+export function formatHoverBreakdown(s: SymbolMetrics): string {}
 
 /** Format a compact CodeLens title showing key metrics. */
killedBy: formatHoverBreakdown contains all five metric values and labels
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArithmeticOperator
src/core/viewModel.ts:28:25
     `- R (rank): ${s.r.toFixed(3)}\n` +
     `- CRAP: ${s.crap.toFixed(2)}\n` +
     `- CC: ${s.cc}\n` +
-    `- T (coverage): ${(s.t * 100).toFixed(0)}%\n\n` +
+    `- T (coverage): ${(s.t / 100).toFixed(0)}%\n\n` +
     `High rank + high CRAP ⇒ higher impact if this unit fails.`
   );
killedBy: formatHoverBreakdown contains all five metric values and labels
statusReason: expected '**DDP risk**  F=42.6  (R×CRAP)\n\n- R…' to contain 'T (coverage): 72%'

[Killed] StringLiteral
src/core/viewModel.ts:29:5
     `- CRAP: ${s.crap.toFixed(2)}\n` +
     `- CC: ${s.cc}\n` +
     `- T (coverage): ${(s.t * 100).toFixed(0)}%\n\n` +
-    `High rank + high CRAP ⇒ higher impact if this unit fails.`
+    ``
   );
 }
killedBy: formatHoverBreakdown includes interpretation string
statusReason: expected '**DDP risk**  F=2.3  (R×CRAP)\n\n- R …' to contain 'higher impact'

[Killed] BlockStatement
src/core/viewModel.ts:34:63
 }
 
 /** Format a compact CodeLens title showing key metrics. */
-export function formatCodeLensTitle(s: SymbolMetrics): string {
-  return `DDP F=${s.f.toFixed(0)}  R=${s.r.toFixed(2)}  CRAP=${s.crap.toFixed(1)}`;
-}
+export function formatCodeLensTitle(s: SymbolMetrics): string {}
 
 export { decorationTier } from "./rollup";
killedBy: formatCodeLensTitle produces compact DDP title with F, R, CRAP
statusReason: .toMatch() expects to receive a string, but got undefined
