[Killed] BlockStatement
src/ddp/adapters.ts:36:89
  * Build a vscode.RelativePattern scoped to a given folder URI,
  * or return the workspace-wide glob when no scope is provided.
  */
-function scopedPattern(glob: string, rootUri?: string): string | vscode.RelativePattern {
-  if (!rootUri) {
-    return glob;
-  }
-  return new vscode.RelativePattern(vscode.Uri.parse(rootUri), glob);
-}
+function scopedPattern(glob: string, rootUri?: string): string | vscode.RelativePattern {}
 
 // ─── DocumentProvider ────────────────────────────────────────────────────────
killedBy: VsCodeDocumentProvider findSourceFiles requests maxFiles * 2 limit when excludeTests is true
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, Anything, 10 ]

Received:

  1st vi.fn() call:

  [
-   Anything,

[Killed] ConditionalExpression
src/ddp/adapters.ts:37:7
  * or return the workspace-wide glob when no scope is provided.
  */
 function scopedPattern(glob: string, rootUri?: string): string | vscode.RelativePattern {
-  if (!rootUri) {
+  if (true) {
     return glob;
   }
killedBy: VsCodeDocumentProvider findSourceFiles passes RelativePattern when rootUri is provided
statusReason: expected 'string' not to be 'string' // Object.is equality

[Killed] ConditionalExpression
src/ddp/adapters.ts:37:7
  * or return the workspace-wide glob when no scope is provided.
  */
 function scopedPattern(glob: string, rootUri?: string): string | vscode.RelativePattern {
-  if (!rootUri) {
+  if (false) {
     return glob;
   }
killedBy: VsCodeDocumentProvider constructor defaults excludeTests to true
statusReason: Cannot read properties of undefined (reading 'indexOf')

[Killed] BlockStatement
src/ddp/adapters.ts:48:45
 export class VsCodeDocumentProvider implements DocumentProvider {
   private readonly excludeTests: boolean;
 
-  constructor(excludeTests: boolean = true) {
-    this.excludeTests = excludeTests;
-  }
+  constructor(excludeTests: boolean = true) {}
 
   async findSourceFiles(maxFiles: number, rootUri?: string): Promise<string[]> {
killedBy: VsCodeDocumentProvider constructor defaults excludeTests to true
statusReason: expected [ 'file:///src/foo.test.ts' ] to deeply equal []

[Killed] BooleanLiteral
src/ddp/adapters.ts:48:39
 export class VsCodeDocumentProvider implements DocumentProvider {
   private readonly excludeTests: boolean;
 
-  constructor(excludeTests: boolean = true) {
+  constructor(excludeTests: boolean = false) {
     this.excludeTests = excludeTests;
   }
killedBy: VsCodeDocumentProvider constructor defaults excludeTests to true
statusReason: expected [ 'file:///src/foo.test.ts' ] to deeply equal []

[Killed] BlockStatement
src/ddp/adapters.ts:52:80
     this.excludeTests = excludeTests;
   }
 
-  async findSourceFiles(maxFiles: number, rootUri?: string): Promise<string[]> {
-    const pattern = scopedPattern(SOURCE_FILE_GLOB, rootUri);
-    // Request extra files to compensate for test files that will be filtered out.
-    const limit = this.excludeTests ? maxFiles * 2 : maxFiles;
-    const uris = await vscode.workspace.findFiles(pattern, EXCLUDE_GLOB, limit);
-    let result = uris.filter((u) => u.scheme === "file").map((u) => u.toString());
-    if (this.excludeTests) {
-      result = result.filter((u) => !isTestFileUri(u));
-    }
-    return result.slice(0, maxFiles);
-  }
+  async findSourceFiles(maxFiles: number, rootUri?: string): Promise<string[]> {}
 
   async openDocument(uri: string): Promise<DocumentInfo | undefined> {
killedBy: VsCodeDocumentProvider constructor defaults excludeTests to true
statusReason: expected undefined to deeply equal []

[Killed] ArithmeticOperator
src/ddp/adapters.ts:55:39
   async findSourceFiles(maxFiles: number, rootUri?: string): Promise<string[]> {
     const pattern = scopedPattern(SOURCE_FILE_GLOB, rootUri);
     // Request extra files to compensate for test files that will be filtered out.
-    const limit = this.excludeTests ? maxFiles * 2 : maxFiles;
+    const limit = this.excludeTests ? maxFiles / 2 : maxFiles;
     const uris = await vscode.workspace.findFiles(pattern, EXCLUDE_GLOB, limit);
     let result = uris.filter((u) => u.scheme === "file").map((u) => u.toString());
killedBy: VsCodeDocumentProvider findSourceFiles requests maxFiles * 2 limit when excludeTests is true
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, Anything, 10 ]

Received:

  1st vi.fn() call:

  [
-   Anything,

[Killed] ArrowFunction
src/ddp/adapters.ts:57:30
     // Request extra files to compensate for test files that will be filtered out.
     const limit = this.excludeTests ? maxFiles * 2 : maxFiles;
     const uris = await vscode.workspace.findFiles(pattern, EXCLUDE_GLOB, limit);
-    let result = uris.filter((u) => u.scheme === "file").map((u) => u.toString());
+    let result = uris.filter(() => undefined).map((u) => u.toString());
     if (this.excludeTests) {
       result = result.filter((u) => !isTestFileUri(u));
killedBy: VsCodeDocumentProvider constructor includes test files when excludeTests is false
statusReason: expected [] to deeply equal [ 'file:///src/foo.test.ts' ]

[Killed] MethodExpression
src/ddp/adapters.ts:57:18
     // Request extra files to compensate for test files that will be filtered out.
     const limit = this.excludeTests ? maxFiles * 2 : maxFiles;
     const uris = await vscode.workspace.findFiles(pattern, EXCLUDE_GLOB, limit);
-    let result = uris.filter((u) => u.scheme === "file").map((u) => u.toString());
+    let result = uris.map((u) => u.toString());
     if (this.excludeTests) {
       result = result.filter((u) => !isTestFileUri(u));
killedBy: VsCodeDocumentProvider findSourceFiles filters out non-file scheme URIs
statusReason: expected [ 'file:///src/a.ts', …(1) ] to deeply equal [ 'file:///src/a.ts' ]

[Killed] ConditionalExpression
src/ddp/adapters.ts:58:9
     const limit = this.excludeTests ? maxFiles * 2 : maxFiles;
     const uris = await vscode.workspace.findFiles(pattern, EXCLUDE_GLOB, limit);
     let result = uris.filter((u) => u.scheme === "file").map((u) => u.toString());
-    if (this.excludeTests) {
+    if (false) {
       result = result.filter((u) => !isTestFileUri(u));
     }
killedBy: VsCodeDocumentProvider constructor defaults excludeTests to true
statusReason: expected [ 'file:///src/foo.test.ts' ] to deeply equal []

[Killed] ConditionalExpression
src/ddp/adapters.ts:58:9
     const limit = this.excludeTests ? maxFiles * 2 : maxFiles;
     const uris = await vscode.workspace.findFiles(pattern, EXCLUDE_GLOB, limit);
     let result = uris.filter((u) => u.scheme === "file").map((u) => u.toString());
-    if (this.excludeTests) {
+    if (true) {
       result = result.filter((u) => !isTestFileUri(u));
     }
killedBy: VsCodeDocumentProvider constructor includes test files when excludeTests is false
statusReason: expected [] to deeply equal [ 'file:///src/foo.test.ts' ]

[Killed] BooleanLiteral
src/ddp/adapters.ts:59:37
     const uris = await vscode.workspace.findFiles(pattern, EXCLUDE_GLOB, limit);
     let result = uris.filter((u) => u.scheme === "file").map((u) => u.toString());
     if (this.excludeTests) {
-      result = result.filter((u) => !isTestFileUri(u));
+      result = result.filter((u) => isTestFileUri(u));
     }
     return result.slice(0, maxFiles);
killedBy: VsCodeDocumentProvider constructor defaults excludeTests to true
statusReason: expected [ 'file:///src/foo.test.ts' ] to deeply equal []

[Killed] MethodExpression
src/ddp/adapters.ts:59:16
     const uris = await vscode.workspace.findFiles(pattern, EXCLUDE_GLOB, limit);
     let result = uris.filter((u) => u.scheme === "file").map((u) => u.toString());
     if (this.excludeTests) {
-      result = result.filter((u) => !isTestFileUri(u));
+      result = result;
     }
     return result.slice(0, maxFiles);
killedBy: VsCodeDocumentProvider constructor defaults excludeTests to true
statusReason: expected [ 'file:///src/foo.test.ts' ] to deeply equal []

[Killed] MethodExpression
src/ddp/adapters.ts:61:12
     if (this.excludeTests) {
       result = result.filter((u) => !isTestFileUri(u));
     }
-    return result.slice(0, maxFiles);
+    return result;
   }
 
killedBy: VsCodeDocumentProvider findSourceFiles truncates result to maxFiles after filtering
statusReason: expected [ 'file:///src/f0.ts', …(19) ] to have a length of 3 but got 20

[Killed] BlockStatement
src/ddp/adapters.ts:64:70
     return result.slice(0, maxFiles);
   }
 
-  async openDocument(uri: string): Promise<DocumentInfo | undefined> {
-    try {
-      const doc = await vscode.workspace.openTextDocument(vscode.Uri.parse(uri));
-      return {
-        uri: doc.uri.toString(),
-        languageId: doc.languageId,
-        getText(startLine: number, endLine: number): string {
-          const range = new vscode.Range(startLine, 0, endLine, doc.lineAt(endLine).text.length);
-          return doc.getText(range);
-        },
-      };
-    } catch (e) {
-      console.debug(`[DDP] Failed to open document ${uri}:`, e);
-      return undefined;
-    }
-  }
+  async openDocument(uri: string): Promise<DocumentInfo | undefined> {}
 }
 
killedBy: VsCodeDocumentProvider openDocument returns DocumentInfo with uri and languageId from opened document
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/ddp/adapters.ts:65:9
   }
 
   async openDocument(uri: string): Promise<DocumentInfo | undefined> {
-    try {
-      const doc = await vscode.workspace.openTextDocument(vscode.Uri.parse(uri));
-      return {
-        uri: doc.uri.toString(),
-        languageId: doc.languageId,
-        getText(startLine: number, endLine: number): string {
-          const range = new vscode.Range(startLine, 0, endLine, doc.lineAt(endLine).text.length);
-          return doc.getText(range);
-        },
-      };
-    } catch (e) {
+    try {} catch (e) {
       console.debug(`[DDP] Failed to open document ${uri}:`, e);
       return undefined;
killedBy: VsCodeDocumentProvider openDocument returns DocumentInfo with uri and languageId from opened document
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/ddp/adapters.ts:70:61
       return {
         uri: doc.uri.toString(),
         languageId: doc.languageId,
-        getText(startLine: number, endLine: number): string {
-          const range = new vscode.Range(startLine, 0, endLine, doc.lineAt(endLine).text.length);
-          return doc.getText(range);
-        },
+        getText(startLine: number, endLine: number): string {},
       };
     } catch (e) {
killedBy: VsCodeDocumentProvider openDocument returns DocumentInfo with working getText method
statusReason: expected undefined to be defined

[Survived] BlockStatement
src/ddp/adapters.ts:75:17
           return doc.getText(range);
         },
       };
-    } catch (e) {
-      console.debug(`[DDP] Failed to open document ${uri}:`, e);
-      return undefined;
-    }
+    } catch (e) {}
   }
 }

[Killed] BlockStatement
src/ddp/adapters.ts:85:72
 // ─── SymbolProvider ──────────────────────────────────────────────────────────
 
 export class VsCodeSymbolProvider implements SymbolProvider {
-  async getFunctionSymbols(uri: string): Promise<FunctionSymbolInfo[]> {
-    const vscUri = vscode.Uri.parse(uri);
-    let syms: vscode.DocumentSymbol[] | undefined;
-    try {
-      syms = await vscode.commands.executeCommand<vscode.DocumentSymbol[]>(
-        "vscode.executeDocumentSymbolProvider",
-        vscUri
-      );
-    } catch (e) {
-      console.debug(`[DDP] Symbol provider failed for ${uri}:`, e);
-      return [];
-    }
-    if (!syms?.length) {
-      return [];
-    }
-    return flattenFunctionSymbols(syms).map((fn) => ({
-      name: fn.name,
-      selectionStartLine: fn.selectionRange.start.line,
-      selectionStartCharacter: fn.selectionRange.start.character,
-      bodyStartLine: fn.range.start.line,
-      bodyEndLine: fn.range.end.line,
-    }));
-  }
+  async getFunctionSymbols(uri: string): Promise<FunctionSymbolInfo[]> {}
 }
 
killedBy: VsCodeSymbolProvider returns mapped FunctionSymbolInfo array from flattenFunctionSymbols output
statusReason: expected undefined to deeply equal [ { name: 'doWork', …(4) } ]

[Killed] BlockStatement
src/ddp/adapters.ts:88:9
   async getFunctionSymbols(uri: string): Promise<FunctionSymbolInfo[]> {
     const vscUri = vscode.Uri.parse(uri);
     let syms: vscode.DocumentSymbol[] | undefined;
-    try {
-      syms = await vscode.commands.executeCommand<vscode.DocumentSymbol[]>(
-        "vscode.executeDocumentSymbolProvider",
-        vscUri
-      );
-    } catch (e) {
+    try {} catch (e) {
       console.debug(`[DDP] Symbol provider failed for ${uri}:`, e);
       return [];
killedBy: VsCodeSymbolProvider returns mapped FunctionSymbolInfo array from flattenFunctionSymbols output
statusReason: expected [] to deeply equal [ { name: 'doWork', …(4) } ]

[Killed] StringLiteral
src/ddp/adapters.ts:90:9
     let syms: vscode.DocumentSymbol[] | undefined;
     try {
       syms = await vscode.commands.executeCommand<vscode.DocumentSymbol[]>(
-        "vscode.executeDocumentSymbolProvider",
+        "",
         vscUri
       );
killedBy: VsCodeSymbolProvider calls executeCommand with 'vscode.executeDocumentSymbolProvider' and parsed URI
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "vscode.executeDocumentSymbolProvider",

[Survived] BlockStatement
src/ddp/adapters.ts:93:17
         "vscode.executeDocumentSymbolProvider",
         vscUri
       );
-    } catch (e) {
-      console.debug(`[DDP] Symbol provider failed for ${uri}:`, e);
-      return [];
-    }
+    } catch (e) {}
     if (!syms?.length) {
       return [];

[Killed] ArrayDeclaration
src/ddp/adapters.ts:95:14
       );
     } catch (e) {
       console.debug(`[DDP] Symbol provider failed for ${uri}:`, e);
-      return [];
+      return ["Stryker was here"];
     }
     if (!syms?.length) {
killedBy: VsCodeSymbolProvider returns empty array when executeCommand throws
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ConditionalExpression
src/ddp/adapters.ts:97:9
       console.debug(`[DDP] Symbol provider failed for ${uri}:`, e);
       return [];
     }
-    if (!syms?.length) {
+    if (true) {
       return [];
     }
killedBy: VsCodeSymbolProvider returns mapped FunctionSymbolInfo array from flattenFunctionSymbols output
statusReason: expected [] to deeply equal [ { name: 'doWork', …(4) } ]

[Killed] OptionalChaining
src/ddp/adapters.ts:97:10
       console.debug(`[DDP] Symbol provider failed for ${uri}:`, e);
       return [];
     }
-    if (!syms?.length) {
+    if (!syms.length) {
       return [];
     }
killedBy: VsCodeSymbolProvider returns empty array when executeCommand returns undefined
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrayDeclaration
src/ddp/adapters.ts:98:14
       return [];
     }
     if (!syms?.length) {
-      return [];
+      return ["Stryker was here"];
     }
     return flattenFunctionSymbols(syms).map((fn) => ({
killedBy: VsCodeSymbolProvider returns empty array when executeCommand returns undefined
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ArrowFunction
src/ddp/adapters.ts:100:45
     if (!syms?.length) {
       return [];
     }
-    return flattenFunctionSymbols(syms).map((fn) => ({
-      name: fn.name,
-      selectionStartLine: fn.selectionRange.start.line,
-      selectionStartCharacter: fn.selectionRange.start.character,
-      bodyStartLine: fn.range.start.line,
-      bodyEndLine: fn.range.end.line,
-    }));
+    return flattenFunctionSymbols(syms).map(() => undefined);
   }
 }
killedBy: VsCodeSymbolProvider returns mapped FunctionSymbolInfo array from flattenFunctionSymbols output
statusReason: expected [ undefined ] to deeply equal [ { name: 'doWork', …(4) } ]

[Killed] ObjectLiteral
src/ddp/adapters.ts:100:54
     if (!syms?.length) {
       return [];
     }
-    return flattenFunctionSymbols(syms).map((fn) => ({
-      name: fn.name,
-      selectionStartLine: fn.selectionRange.start.line,
-      selectionStartCharacter: fn.selectionRange.start.character,
-      bodyStartLine: fn.range.start.line,
-      bodyEndLine: fn.range.end.line,
-    }));
+    return flattenFunctionSymbols(syms).map((fn) => ({}));
   }
 }
killedBy: VsCodeSymbolProvider returns mapped FunctionSymbolInfo array from flattenFunctionSymbols output
statusReason: expected [ {} ] to deeply equal [ { name: 'doWork', …(4) } ]

[Killed] BooleanLiteral
src/ddp/adapters.ts:115:46
 export class VsCodeCallGraphProvider implements CallGraphProvider {
   constructor(
     private readonly token: vscode.CancellationToken,
-    private readonly excludeTests: boolean = true,
+    private readonly excludeTests: boolean = false,
   ) {}
 
killedBy: VsCodeCallGraphProvider defaults excludeTests to true
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/ddp/adapters.ts:118:83
     private readonly excludeTests: boolean = true,
   ) {}
 
-  async collectCallEdges(maxFiles: number, rootUri?: string): Promise<CallEdge[]> {
-    return collectCallEdgesFromWorkspace({ token: this.token, maxFiles, rootUri, excludeTests: this.excludeTests });
-  }
+  async collectCallEdges(maxFiles: number, rootUri?: string): Promise<CallEdge[]> {}
 }
 
killedBy: VsCodeCallGraphProvider passes token, maxFiles, rootUri, and excludeTests to collectCallEdgesFromWorkspace
statusReason: expected "vi.fn()" to be called with arguments: [ { token: { …(2) }, …(3) } ]

Number of calls: 0

[Killed] BlockStatement
src/ddp/adapters.ts:131:108
   private readonly jacocoGlob: string;
   private readonly token: vscode.CancellationToken;
 
-  constructor(store: CoverageStore, lcovGlob: string, jacocoGlob: string, token: vscode.CancellationToken) {
-    this.store = store;
-    this.lcovGlob = lcovGlob;
-    this.jacocoGlob = jacocoGlob;
-    this.token = token;
-  }
+  constructor(store: CoverageStore, lcovGlob: string, jacocoGlob: string, token: vscode.CancellationToken) {}
 
   async loadCoverage(): Promise<void> {
killedBy: VsCodeCoverageProvider clears the store and delegates loadCoverage to loadLcovIntoStore with store, glob, and token
statusReason: Cannot read properties of undefined (reading 'clear')

[Killed] BlockStatement
src/ddp/adapters.ts:138:39
     this.token = token;
   }
 
-  async loadCoverage(): Promise<void> {
-    this.store.clear();
-    await Promise.all([
-      loadLcovIntoStore(this.store, this.lcovGlob, this.token),
-      loadJacocoIntoStore(this.store, this.jacocoGlob, this.token),
-    ]);
-  }
+  async loadCoverage(): Promise<void> {}
 
   getStatements(uri: string): StatementCover[] | undefined {
killedBy: VsCodeCoverageProvider clears the store and delegates loadCoverage to loadLcovIntoStore with store, glob, and token
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ArrayDeclaration
src/ddp/adapters.ts:140:23
 
   async loadCoverage(): Promise<void> {
     this.store.clear();
-    await Promise.all([
-      loadLcovIntoStore(this.store, this.lcovGlob, this.token),
-      loadJacocoIntoStore(this.store, this.jacocoGlob, this.token),
-    ]);
+    await Promise.all([]);
   }
 
killedBy: VsCodeCoverageProvider clears the store and delegates loadCoverage to loadLcovIntoStore with store, glob, and token
statusReason: expected "vi.fn()" to be called with arguments: [ Array(3) ]

Number of calls: 0

[Killed] BlockStatement
src/ddp/adapters.ts:146:60
     ]);
   }
 
-  getStatements(uri: string): StatementCover[] | undefined {
-    return this.store.get(uri);
-  }
+  getStatements(uri: string): StatementCover[] | undefined {}
 }
 
killedBy: VsCodeCoverageProvider delegates getStatements to store.get() with the URI
statusReason: expected "vi.fn()" to be called with arguments: [ 'file:///a.ts' ]

Number of calls: 0

[Killed] BlockStatement
src/ddp/adapters.ts:154:48
 // ─── CC Providers (per-language adapters) ────────────────────────────────────
 
 /** Resolve workspace folder cwd for a file URI, returning "" if unknown. */
-function workspaceCwd(uri: vscode.Uri): string {
-  return vscode.workspace.getWorkspaceFolder(uri)?.uri.fsPath ?? "";
-}
+function workspaceCwd(uri: vscode.Uri): string {}
 
 export class EslintCcProvider implements CyclomaticComplexityProvider {
killedBy: EslintCcProvider passes eslintPath, fsPath, and cwd to eslintCcForFile
statusReason: expected "vi.fn()" to be called with arguments: [ 'typescript', Any<String>, …(2) ]

Received:

  1st vi.fn() call:

  [
    "typescript",

[Killed] LogicalOperator
src/ddp/adapters.ts:155:10
 
 /** Resolve workspace folder cwd for a file URI, returning "" if unknown. */
 function workspaceCwd(uri: vscode.Uri): string {
-  return vscode.workspace.getWorkspaceFolder(uri)?.uri.fsPath ?? "";
+  return vscode.workspace.getWorkspaceFolder(uri)?.uri.fsPath && "";
 }
 
killedBy: EslintCcProvider passes eslintPath, fsPath, and cwd to eslintCcForFile
statusReason: expected "vi.fn()" to be called with arguments: [ 'typescript', Any<String>, …(2) ]

Received:

  1st vi.fn() call:

  [
    "typescript",

[Killed] OptionalChaining
src/ddp/adapters.ts:155:10
 
 /** Resolve workspace folder cwd for a file URI, returning "" if unknown. */
 function workspaceCwd(uri: vscode.Uri): string {
-  return vscode.workspace.getWorkspaceFolder(uri)?.uri.fsPath ?? "";
+  return vscode.workspace.getWorkspaceFolder(uri).uri.fsPath ?? "";
 }
 
killedBy: EslintCcProvider returns byLine from eslintCcForFile and empty byName for file:// URI
statusReason: Cannot read properties of undefined (reading 'uri')

[Killed] BlockStatement
src/ddp/adapters.ts:161:65
 export class EslintCcProvider implements CyclomaticComplexityProvider {
   constructor(private readonly eslintPath: string) {}
 
-  async computeComplexity(doc: DocumentInfo): Promise<CcResult> {
-    const uri = vscode.Uri.parse(doc.uri);
-    if (uri.scheme !== "file") {
-      return { byLine: new Map(), byName: new Map() };
-    }
-    const byLine = await eslintCcForFile(doc.languageId, uri.fsPath, workspaceCwd(uri), this.eslintPath);
-    return { byLine, byName: new Map() };
-  }
+  async computeComplexity(doc: DocumentInfo): Promise<CcResult> {}
 }
 
killedBy: EslintCcProvider returns byLine from eslintCcForFile and empty byName for file:// URI
statusReason: Cannot read properties of undefined (reading 'byLine')

[Killed] ConditionalExpression
src/ddp/adapters.ts:163:9
 
   async computeComplexity(doc: DocumentInfo): Promise<CcResult> {
     const uri = vscode.Uri.parse(doc.uri);
-    if (uri.scheme !== "file") {
+    if (false) {
       return { byLine: new Map(), byName: new Map() };
     }
killedBy: EslintCcProvider returns empty byLine and byName for non-file scheme URI
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/ddp/adapters.ts:163:32
 
   async computeComplexity(doc: DocumentInfo): Promise<CcResult> {
     const uri = vscode.Uri.parse(doc.uri);
-    if (uri.scheme !== "file") {
-      return { byLine: new Map(), byName: new Map() };
-    }
+    if (uri.scheme !== "file") {}
     const byLine = await eslintCcForFile(doc.languageId, uri.fsPath, workspaceCwd(uri), this.eslintPath);
     return { byLine, byName: new Map() };
killedBy: EslintCcProvider returns empty byLine and byName for non-file scheme URI
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "typescript",

[Killed] ObjectLiteral
src/ddp/adapters.ts:167:12
       return { byLine: new Map(), byName: new Map() };
     }
     const byLine = await eslintCcForFile(doc.languageId, uri.fsPath, workspaceCwd(uri), this.eslintPath);
-    return { byLine, byName: new Map() };
+    return {};
   }
 }
killedBy: EslintCcProvider returns byLine from eslintCcForFile and empty byName for file:// URI
statusReason: expected undefined to be Map{ 10 => 3, 20 => 5 } // Object.is equality

[Killed] BlockStatement
src/ddp/adapters.ts:174:65
 export class RadonCcProvider implements CyclomaticComplexityProvider {
   constructor(private readonly pythonPath: string) {}
 
-  async computeComplexity(doc: DocumentInfo): Promise<CcResult> {
-    const uri = vscode.Uri.parse(doc.uri);
-    if (uri.scheme !== "file") {
-      return { byLine: new Map(), byName: new Map() };
-    }
-    const radonMap = await radonCcForFile(doc.languageId, uri.fsPath, workspaceCwd(uri), this.pythonPath);
-    return { byLine: new Map(), byName: radonMap };
-  }
+  async computeComplexity(doc: DocumentInfo): Promise<CcResult> {}
 }
 
killedBy: RadonCcProvider returns byName from radonCcForFile and empty byLine for file:// URI
statusReason: Cannot read properties of undefined (reading 'byName')

[Killed] ConditionalExpression
src/ddp/adapters.ts:176:9
 
   async computeComplexity(doc: DocumentInfo): Promise<CcResult> {
     const uri = vscode.Uri.parse(doc.uri);
-    if (uri.scheme !== "file") {
+    if (true) {
       return { byLine: new Map(), byName: new Map() };
     }
killedBy: RadonCcProvider returns byName from radonCcForFile and empty byLine for file:// URI
statusReason: expected Map{} to be Map{ '10:foo' => 4 } // Object.is equality

[Killed] ObjectLiteral
src/ddp/adapters.ts:177:14
   async computeComplexity(doc: DocumentInfo): Promise<CcResult> {
     const uri = vscode.Uri.parse(doc.uri);
     if (uri.scheme !== "file") {
-      return { byLine: new Map(), byName: new Map() };
+      return {};
     }
     const radonMap = await radonCcForFile(doc.languageId, uri.fsPath, workspaceCwd(uri), this.pythonPath);
killedBy: RadonCcProvider returns empty maps for non-file scheme URI
statusReason: Cannot read properties of undefined (reading 'size')

[Killed] ObjectLiteral
src/ddp/adapters.ts:180:12
       return { byLine: new Map(), byName: new Map() };
     }
     const radonMap = await radonCcForFile(doc.languageId, uri.fsPath, workspaceCwd(uri), this.pythonPath);
-    return { byLine: new Map(), byName: radonMap };
+    return {};
   }
 }
killedBy: RadonCcProvider returns byName from radonCcForFile and empty byLine for file:// URI
statusReason: expected undefined to be Map{ '10:foo' => 4 } // Object.is equality

[Killed] BlockStatement
src/ddp/adapters.ts:187:65
 export class PmdCcProvider implements CyclomaticComplexityProvider {
   constructor(private readonly pmdPath: string) {}
 
-  async computeComplexity(doc: DocumentInfo): Promise<CcResult> {
-    const uri = vscode.Uri.parse(doc.uri);
-    if (uri.scheme !== "file") {
-      return { byLine: new Map(), byName: new Map() };
-    }
-    const byLine = await pmdCcForFile(doc.languageId, uri.fsPath, workspaceCwd(uri), this.pmdPath);
-    return { byLine, byName: new Map() };
-  }
+  async computeComplexity(doc: DocumentInfo): Promise<CcResult> {}
 }
 
killedBy: PmdCcProvider returns byLine from pmdCcForFile and empty byName for file:// URI
statusReason: Cannot read properties of undefined (reading 'byLine')

[Killed] EqualityOperator
src/ddp/adapters.ts:189:9
 
   async computeComplexity(doc: DocumentInfo): Promise<CcResult> {
     const uri = vscode.Uri.parse(doc.uri);
-    if (uri.scheme !== "file") {
+    if (uri.scheme === "file") {
       return { byLine: new Map(), byName: new Map() };
     }
killedBy: PmdCcProvider returns byLine from pmdCcForFile and empty byName for file:// URI
statusReason: expected Map{} to be Map{ 5 => 8 } // Object.is equality

[Killed] BlockStatement
src/ddp/adapters.ts:202:46
 export class VsCodeLogger implements Logger {
   private readonly channel: vscode.OutputChannel;
 
-  constructor(channel: vscode.OutputChannel) {
-    this.channel = channel;
-  }
+  constructor(channel: vscode.OutputChannel) {}
 
   info(message: string): void {
killedBy: VsCodeLogger formats info message as [INFO] prefix
statusReason: Cannot read properties of undefined (reading 'appendLine')

[Killed] BlockStatement
src/ddp/adapters.ts:206:31
     this.channel = channel;
   }
 
-  info(message: string): void {
-    this.channel.appendLine(`[INFO] ${message}`);
-  }
+  info(message: string): void {}
 
   warn(message: string): void {
killedBy: VsCodeLogger formats info message as [INFO] prefix
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] analysis started' ]

Number of calls: 0

[Killed] StringLiteral
src/ddp/adapters.ts:207:29
   }
 
   info(message: string): void {
-    this.channel.appendLine(`[INFO] ${message}`);
+    this.channel.appendLine(``);
   }
 
killedBy: VsCodeLogger formats info message as [INFO] prefix
statusReason: expected "vi.fn()" to be called with arguments: [ '[INFO] analysis started' ]

Received:

  1st vi.fn() call:

  [
-   "[INFO] analysis started",

[Killed] BlockStatement
src/ddp/adapters.ts:210:31
     this.channel.appendLine(`[INFO] ${message}`);
   }
 
-  warn(message: string): void {
-    this.channel.appendLine(`[WARN] ${message}`);
-  }
+  warn(message: string): void {}
 
   error(message: string, err?: unknown): void {
killedBy: VsCodeLogger formats warn message as [WARN] prefix
statusReason: expected "vi.fn()" to be called with arguments: [ '[WARN] slow query' ]

Number of calls: 0

[Killed] StringLiteral
src/ddp/adapters.ts:211:29
   }
 
   warn(message: string): void {
-    this.channel.appendLine(`[WARN] ${message}`);
+    this.channel.appendLine(``);
   }
 
killedBy: VsCodeLogger formats warn message as [WARN] prefix
statusReason: expected "vi.fn()" to be called with arguments: [ '[WARN] slow query' ]

Received:

  1st vi.fn() call:

  [
-   "[WARN] slow query",
