[Killed] BlockStatement
src/ddp/adapters.ts:214:47
     this.channel.appendLine(`[WARN] ${message}`);
   }
 
-  error(message: string, err?: unknown): void {
-    const suffix = err instanceof Error ? `: ${err.message}` : "";
-    this.channel.appendLine(`[ERROR] ${message}${suffix}`);
-  }
+  error(message: string, err?: unknown): void {}
 }
 
killedBy: VsCodeLogger formats error message as [ERROR] prefix without error object
statusReason: expected "vi.fn()" to be called with arguments: [ '[ERROR] something failed' ]

Number of calls: 0

[Killed] StringLiteral
src/ddp/adapters.ts:215:64
   }
 
   error(message: string, err?: unknown): void {
-    const suffix = err instanceof Error ? `: ${err.message}` : "";
+    const suffix = err instanceof Error ? `: ${err.message}` : "Stryker was here!";
     this.channel.appendLine(`[ERROR] ${message}${suffix}`);
   }
killedBy: VsCodeLogger formats error message as [ERROR] prefix without error object
statusReason: expected "vi.fn()" to be called with arguments: [ '[ERROR] something failed' ]

Received:

  1st vi.fn() call:

  [
-   "[ERROR] something failed",
