[Survived] ObjectLiteral
src/ddp/analysisOrchestrator.ts:30:42
 import { estimateCyclomaticComplexity } from "../core/estimateCc";
 
 
-const nullChurnProvider: ChurnProvider = {
-  getChurnCounts: () => Promise.resolve(new Map()),
-};
+const nullChurnProvider: ChurnProvider = {};
 
 export type AnalysisResult = {

[Survived] ArrowFunction
src/ddp/analysisOrchestrator.ts:31:19
 
 
 const nullChurnProvider: ChurnProvider = {
-  getChurnCounts: () => Promise.resolve(new Map()),
+  getChurnCounts: () => undefined,
 };
 

[Killed] OptionalChaining
src/ddp/analysisOrchestrator.ts:60:21
 
   async analyze(config: DdpConfiguration, ctx: AnalysisContext, scope?: AnalysisScope): Promise<AnalysisResult | undefined> {
     const { callGraphProvider, coverageProvider, logger } = this.deps;
-    const rootUri = scope?.rootUri;
+    const rootUri = scope.rootUri;
 
     // 1. Load coverage data
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: Cannot read properties of undefined (reading 'rootUri')

[Killed] ConditionalExpression
src/ddp/analysisOrchestrator.ts:64:9
 
     // 1. Load coverage data
     await coverageProvider.loadCoverage();
-    if (ctx.isCancelled()) {
+    if (true) {
       return undefined;
     }
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: expected result

[Survived] BlockStatement
src/ddp/analysisOrchestrator.ts:64:28
 
     // 1. Load coverage data
     await coverageProvider.loadCoverage();
-    if (ctx.isCancelled()) {
-      return undefined;
-    }
+    if (ctx.isCancelled()) {}
 
     // 2. Build call graph (scope-aware: only expands roots under rootUri)

[Killed] BlockStatement
src/ddp/analysisOrchestrator.ts:70:28
 
     // 2. Build call graph (scope-aware: only expands roots under rootUri)
     const edges = await callGraphProvider.collectCallEdges(config.maxFiles, rootUri);
-    if (ctx.isCancelled()) {
-      return undefined;
-    }
+    if (ctx.isCancelled()) {}
 
     // 3. Discover source files and extract symbols
killedBy: AnalysisOrchestrator returns undefined when cancelled during file iteration
statusReason: expected { Object (symbols, fileRollup, ...) } to be undefined

[Killed] ConditionalExpression
src/ddp/analysisOrchestrator.ts:70:9
 
     // 2. Build call graph (scope-aware: only expands roots under rootUri)
     const edges = await callGraphProvider.collectCallEdges(config.maxFiles, rootUri);
-    if (ctx.isCancelled()) {
+    if (false) {
       return undefined;
     }
killedBy: AnalysisOrchestrator returns undefined when cancelled during file iteration
statusReason: expected { Object (symbols, fileRollup, ...) } to be undefined

[Killed] ArrowFunction
src/ddp/analysisOrchestrator.ts:87:47
 
     const symbols = await this.applyChurnIfEnabled(rawSymbols, config);
 
-    const rows: SymbolRiskRow[] = symbols.map((s) => ({ symbolId: s.id, uri: s.uri, f: s.fPrime }));
+    const rows: SymbolRiskRow[] = symbols.map(() => undefined);
     const fileRollup = rollupFileRisk(rows, config.fileRollup);
 
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: Cannot read properties of undefined (reading 'uri')

[Killed] ObjectLiteral
src/ddp/analysisOrchestrator.ts:87:55
 
     const symbols = await this.applyChurnIfEnabled(rawSymbols, config);
 
-    const rows: SymbolRiskRow[] = symbols.map((s) => ({ symbolId: s.id, uri: s.uri, f: s.fPrime }));
+    const rows: SymbolRiskRow[] = symbols.map((s) => ({}));
     const fileRollup = rollupFileRisk(rows, config.fileRollup);
 
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/ddp/analysisOrchestrator.ts:90:17
     const rows: SymbolRiskRow[] = symbols.map((s) => ({ symbolId: s.id, uri: s.uri, f: s.fPrime }));
     const fileRollup = rollupFileRisk(rows, config.fileRollup);
 
-    logger.info(`Analysis complete: ${symbols.length} symbols, ${edges.length} edges`);
+    logger.info(``);
     return { symbols, fileRollup, edgesCount: edges.length };
   }
killedBy: bugmagnet session 2026-04-15 logging logs completion message with correct symbol and edge counts
statusReason: expected '' to contain '2 symbols'

[Killed] ObjectLiteral
src/ddp/analysisOrchestrator.ts:91:12
     const fileRollup = rollupFileRisk(rows, config.fileRollup);
 
     logger.info(`Analysis complete: ${symbols.length} symbols, ${edges.length} edges`);
-    return { symbols, fileRollup, edgesCount: edges.length };
+    return {};
   }
 
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/ddp/analysisOrchestrator.ts:97:31
   private async applyChurnIfEnabled(
     symbols: SymbolMetrics[],
     config: DdpConfiguration
-  ): Promise<SymbolMetrics[]> {
-    if (!config.churn.enabled) {
-      return symbols;
-    }
-    const churnProvider = this.deps.churnProvider ?? nullChurnProvider;
-    const now = this.deps.clock?.() ?? new Date();
-    const since = new Date(now);
-    since.setDate(since.getDate() - config.churn.lookbackDays);
-    try {
-      const counts = await churnProvider.getChurnCounts(since);
-      return applyChurn(symbols, counts);
-    } catch (err) {
-      this.deps.logger.warn(`churn data unavailable, skipping: ${err instanceof Error ? err.message : String(err)}`);
-      return symbols;
-    }
-  }
+  ): Promise<SymbolMetrics[]> {}
 
   private async discoverSourceFiles(config: DdpConfiguration, rootUri?: string): Promise<string[]> {
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/ddp/analysisOrchestrator.ts:98:9
     symbols: SymbolMetrics[],
     config: DdpConfiguration
   ): Promise<SymbolMetrics[]> {
-    if (!config.churn.enabled) {
+    if (true) {
       return symbols;
     }
killedBy: AnalysisOrchestrator applies churn multiplier when ChurnProvider is supplied
statusReason: expected 1 to be close to 3.3978952727983707, received difference is 2.3978952727983707, but expected 0.000005

[Killed] BooleanLiteral
src/ddp/analysisOrchestrator.ts:98:9
     symbols: SymbolMetrics[],
     config: DdpConfiguration
   ): Promise<SymbolMetrics[]> {
-    if (!config.churn.enabled) {
+    if (config.churn.enabled) {
       return symbols;
     }
killedBy: AnalysisOrchestrator applies churn multiplier when ChurnProvider is supplied
statusReason: expected 1 to be close to 3.3978952727983707, received difference is 2.3978952727983707, but expected 0.000005

[Killed] LogicalOperator
src/ddp/analysisOrchestrator.ts:101:27
     if (!config.churn.enabled) {
       return symbols;
     }
-    const churnProvider = this.deps.churnProvider ?? nullChurnProvider;
+    const churnProvider = this.deps.churnProvider && nullChurnProvider;
     const now = this.deps.clock?.() ?? new Date();
     const since = new Date(now);
killedBy: AnalysisOrchestrator applies churn multiplier when ChurnProvider is supplied
statusReason: expected 1 to be close to 3.3978952727983707, received difference is 2.3978952727983707, but expected 0.000005

[Killed] OptionalChaining
src/ddp/analysisOrchestrator.ts:102:17
       return symbols;
     }
     const churnProvider = this.deps.churnProvider ?? nullChurnProvider;
-    const now = this.deps.clock?.() ?? new Date();
+    const now = this.deps.clock() ?? new Date();
     const since = new Date(now);
     since.setDate(since.getDate() - config.churn.lookbackDays);
killedBy: AnalysisOrchestrator applies churn multiplier when ChurnProvider is supplied
statusReason: this.deps.clock is not a function

[Killed] LogicalOperator
src/ddp/analysisOrchestrator.ts:102:17
       return symbols;
     }
     const churnProvider = this.deps.churnProvider ?? nullChurnProvider;
-    const now = this.deps.clock?.() ?? new Date();
+    const now = this.deps.clock?.() && new Date();
     const since = new Date(now);
     since.setDate(since.getDate() - config.churn.lookbackDays);
killedBy: AnalysisOrchestrator passes a date exactly lookbackDays before the clock date to ChurnProvider
statusReason: expected 1768939662446 to be 1768914000000 // Object.is equality

[Killed] MethodExpression
src/ddp/analysisOrchestrator.ts:104:5
     const churnProvider = this.deps.churnProvider ?? nullChurnProvider;
     const now = this.deps.clock?.() ?? new Date();
     const since = new Date(now);
-    since.setDate(since.getDate() - config.churn.lookbackDays);
+    since.setTime(since.getDate() - config.churn.lookbackDays);
     try {
       const counts = await churnProvider.getChurnCounts(since);
killedBy: AnalysisOrchestrator passes a date exactly lookbackDays before the clock date to ChurnProvider
statusReason: expected -70 to be 1768914000000 // Object.is equality

[Killed] ArithmeticOperator
src/ddp/analysisOrchestrator.ts:104:19
     const churnProvider = this.deps.churnProvider ?? nullChurnProvider;
     const now = this.deps.clock?.() ?? new Date();
     const since = new Date(now);
-    since.setDate(since.getDate() - config.churn.lookbackDays);
+    since.setDate(since.getDate() + config.churn.lookbackDays);
     try {
       const counts = await churnProvider.getChurnCounts(since);
killedBy: AnalysisOrchestrator passes a date exactly lookbackDays before the clock date to ChurnProvider
statusReason: expected 1784462400000 to be 1768914000000 // Object.is equality

[Killed] BlockStatement
src/ddp/analysisOrchestrator.ts:105:9
     const now = this.deps.clock?.() ?? new Date();
     const since = new Date(now);
     since.setDate(since.getDate() - config.churn.lookbackDays);
-    try {
-      const counts = await churnProvider.getChurnCounts(since);
-      return applyChurn(symbols, counts);
-    } catch (err) {
+    try {} catch (err) {
       this.deps.logger.warn(`churn data unavailable, skipping: ${err instanceof Error ? err.message : String(err)}`);
       return symbols;
killedBy: AnalysisOrchestrator applies churn multiplier when ChurnProvider is supplied
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/ddp/analysisOrchestrator.ts:108:19
     try {
       const counts = await churnProvider.getChurnCounts(since);
       return applyChurn(symbols, counts);
-    } catch (err) {
-      this.deps.logger.warn(`churn data unavailable, skipping: ${err instanceof Error ? err.message : String(err)}`);
-      return symbols;
-    }
+    } catch (err) {}
   }
 
killedBy: AnalysisOrchestrator degrades gracefully when ChurnProvider throws — symbols get g=1
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/ddp/analysisOrchestrator.ts:114:100
     }
   }
 
-  private async discoverSourceFiles(config: DdpConfiguration, rootUri?: string): Promise<string[]> {
-    const rawUris = await this.deps.documentProvider.findSourceFiles(config.maxFiles, rootUri);
-    return config.excludeTests ? rawUris.filter((u) => !isTestFileUri(u)) : rawUris;
-  }
+  private async discoverSourceFiles(config: DdpConfiguration, rootUri?: string): Promise<string[]> {}
 
   private async collectAllSymbolInputs(
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: fileUris is not iterable

[Killed] MethodExpression
src/ddp/analysisOrchestrator.ts:116:34
 
   private async discoverSourceFiles(config: DdpConfiguration, rootUri?: string): Promise<string[]> {
     const rawUris = await this.deps.documentProvider.findSourceFiles(config.maxFiles, rootUri);
-    return config.excludeTests ? rawUris.filter((u) => !isTestFileUri(u)) : rawUris;
+    return config.excludeTests ? rawUris : rawUris;
   }
 
killedBy: test-file exclusion orchestrator safety-net excludes test files even when provider does not filter
statusReason: expected [ …(2) ] to not include 'file:///project/src/service.test.ts'

[Killed] ArrowFunction
src/ddp/analysisOrchestrator.ts:116:49
 
   private async discoverSourceFiles(config: DdpConfiguration, rootUri?: string): Promise<string[]> {
     const rawUris = await this.deps.documentProvider.findSourceFiles(config.maxFiles, rootUri);
-    return config.excludeTests ? rawUris.filter((u) => !isTestFileUri(u)) : rawUris;
+    return config.excludeTests ? rawUris.filter(() => undefined) : rawUris;
   }
 
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/ddp/analysisOrchestrator.ts:123:29
     fileUris: string[],
     config: DdpConfiguration,
     ctx: AnalysisContext
-  ): Promise<SymbolInput[]> {
-    const result: SymbolInput[] = [];
-    // Sequential: allows cancellation between files.
-    for (const uri of fileUris) {
-      if (ctx.isCancelled()) {
-        break;
-      }
-      const inputs = await this.collectFileSymbolInputs(uri, config);
-      result.push(...inputs);
-    }
-    return result;
-  }
+  ): Promise<SymbolInput[]> {}
 
   private async collectFileSymbolInputs(uri: string, config: DdpConfiguration): Promise<SymbolInput[]> {
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrayDeclaration
src/ddp/analysisOrchestrator.ts:124:35
     config: DdpConfiguration,
     ctx: AnalysisContext
   ): Promise<SymbolInput[]> {
-    const result: SymbolInput[] = [];
+    const result: SymbolInput[] = ["Stryker was here"];
     // Sequential: allows cancellation between files.
     for (const uri of fileUris) {
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: expected [ { '0': 'S', '1': 't', …(19) }, …(2) ] to have a length of 2 but got 3

[Killed] BlockStatement
src/ddp/analysisOrchestrator.ts:126:33
   ): Promise<SymbolInput[]> {
     const result: SymbolInput[] = [];
     // Sequential: allows cancellation between files.
-    for (const uri of fileUris) {
-      if (ctx.isCancelled()) {
-        break;
-      }
-      const inputs = await this.collectFileSymbolInputs(uri, config);
-      result.push(...inputs);
-    }
+    for (const uri of fileUris) {}
     return result;
   }
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/ddp/analysisOrchestrator.ts:127:11
     const result: SymbolInput[] = [];
     // Sequential: allows cancellation between files.
     for (const uri of fileUris) {
-      if (ctx.isCancelled()) {
+      if (false) {
         break;
       }
killedBy: bugmagnet session 2026-04-15 cancellation edge cases returns partial result undefined when cancelled after some files processed
statusReason: expected 2 to be less than or equal to 1

[Killed] BlockStatement
src/ddp/analysisOrchestrator.ts:127:30
     const result: SymbolInput[] = [];
     // Sequential: allows cancellation between files.
     for (const uri of fileUris) {
-      if (ctx.isCancelled()) {
-        break;
-      }
+      if (ctx.isCancelled()) {}
       const inputs = await this.collectFileSymbolInputs(uri, config);
       result.push(...inputs);
killedBy: bugmagnet session 2026-04-15 cancellation edge cases returns partial result undefined when cancelled after some files processed
statusReason: expected 2 to be less than or equal to 1

[Killed] ConditionalExpression
src/ddp/analysisOrchestrator.ts:140:9
     const { documentProvider, symbolProvider, coverageProvider, ccRegistry, logger } = this.deps;
 
     const doc = await documentProvider.openDocument(uri);
-    if (!doc) {
+    if (true) {
       logger.warn(`Skipped: could not open ${uri}`);
       return [];
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/ddp/analysisOrchestrator.ts:140:9
     const { documentProvider, symbolProvider, coverageProvider, ccRegistry, logger } = this.deps;
 
     const doc = await documentProvider.openDocument(uri);
-    if (!doc) {
+    if (false) {
       logger.warn(`Skipped: could not open ${uri}`);
       return [];
killedBy: AnalysisOrchestrator skips file and logs warning when openDocument returns undefined
statusReason: Cannot read properties of undefined (reading 'languageId')

[Killed] StringLiteral
src/ddp/analysisOrchestrator.ts:141:19
 
     const doc = await documentProvider.openDocument(uri);
     if (!doc) {
-      logger.warn(`Skipped: could not open ${uri}`);
+      logger.warn(``);
       return [];
     }
killedBy: AnalysisOrchestrator skips file and logs warning when openDocument returns undefined
statusReason: expected '' to contain 'missing.ts'

[Killed] ConditionalExpression
src/ddp/analysisOrchestrator.ts:146:9
     }
 
     const functions = await symbolProvider.getFunctionSymbols(uri);
-    if (!functions.length) {
+    if (true) {
       return [];
     }
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: expected [] to have a length of 2 but got +0

[Killed] BooleanLiteral
src/ddp/analysisOrchestrator.ts:146:9
     }
 
     const functions = await symbolProvider.getFunctionSymbols(uri);
-    if (!functions.length) {
+    if (functions.length) {
       return [];
     }
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: expected [] to have a length of 2 but got +0

[Killed] LogicalOperator
src/ddp/analysisOrchestrator.ts:152:24
 
     const ccProvider = ccRegistry.getForLanguage(doc.languageId);
     const ccResult = await ccProvider.computeComplexity(doc);
-    const statements = coverageProvider.getStatements(uri) ?? [];
+    const statements = coverageProvider.getStatements(uri) && [];
 
     return functions.map((fn) => {
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: statements is not iterable

[Killed] BlockStatement
src/ddp/analysisOrchestrator.ts:154:34
     const ccResult = await ccProvider.computeComplexity(doc);
     const statements = coverageProvider.getStatements(uri) ?? [];
 
-    return functions.map((fn) => {
-      const body = { startLine: fn.bodyStartLine, endLine: fn.bodyEndLine };
-      return {
-        id: makeSymbolId(uri, fn),
-        uri,
-        name: fn.name,
-        cc: resolveCc(fn, doc, ccResult, config),
-        t: coverageFractionForSymbol(body, statements, config.coverage.fallbackT),
-      };
-    });
+    return functions.map((fn) => {});
   }
 }
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/ddp/analysisOrchestrator.ts:168:68
 }
 
 /** Build a symbol ID from URI + selection range (matches symbolIdFromUriRange format). */
-function makeSymbolId(uri: string, fn: FunctionSymbolInfo): string {
-  return `${uri}#${fn.selectionStartLine}:${fn.selectionStartCharacter}`;
-}
+function makeSymbolId(uri: string, fn: FunctionSymbolInfo): string {}
 
 /**
killedBy: AnalysisOrchestrator computes metrics for a simple two-function workspace
statusReason: expected 1 to be greater than 1

[Killed] BlockStatement
src/ddp/analysisOrchestrator.ts:181:11
   doc: DocumentInfo,
   ccResult: { byLine: Map<number, number>; byName: Map<string, number> },
   _config: DdpConfiguration
-): number {
-  const line1 = fn.selectionStartLine + 1;
-
-  // Try line-based CC (ESLint for TS/JS, PMD for Java)
-  if (ccResult.byLine.size) {
-    const fromLine = ccResult.byLine.get(line1);
-    if (fromLine !== undefined) {
-      return fromLine;
-    }
-  }
-
-  // Try name-based CC (Radon for Python)
-  if (ccResult.byName.size) {
-    const key = `${line1}:${fn.name}`;
-    const fromName = ccResult.byName.get(key);
-    if (fromName !== undefined) {
-      return fromName;
-    }
-  }
-
-  // Fallback: regex-based estimation from source text
-  const source = doc.getText(fn.bodyStartLine, fn.bodyEndLine);
-  return estimateCyclomaticComplexity(source);
-}
+): number {}
 
killedBy: AnalysisOrchestrator applies churn multiplier when ChurnProvider is supplied
statusReason: expected NaN to be greater than NaN

[Killed] ArithmeticOperator
src/ddp/analysisOrchestrator.ts:182:17
   ccResult: { byLine: Map<number, number>; byName: Map<string, number> },
   _config: DdpConfiguration
 ): number {
-  const line1 = fn.selectionStartLine + 1;
+  const line1 = fn.selectionStartLine - 1;
 
   // Try line-based CC (ESLint for TS/JS, PMD for Java)
killedBy: AnalysisOrchestrator uses tool-specific CC when available
statusReason: expected 2 to be 15 // Object.is equality

[Killed] BlockStatement
src/ddp/analysisOrchestrator.ts:185:29
   const line1 = fn.selectionStartLine + 1;
 
   // Try line-based CC (ESLint for TS/JS, PMD for Java)
-  if (ccResult.byLine.size) {
-    const fromLine = ccResult.byLine.get(line1);
-    if (fromLine !== undefined) {
-      return fromLine;
-    }
-  }
+  if (ccResult.byLine.size) {}
 
   // Try name-based CC (Radon for Python)
killedBy: AnalysisOrchestrator uses tool-specific CC when available
statusReason: expected 2 to be 15 // Object.is equality

[Killed] ConditionalExpression
src/ddp/analysisOrchestrator.ts:185:7
   const line1 = fn.selectionStartLine + 1;
 
   // Try line-based CC (ESLint for TS/JS, PMD for Java)
-  if (ccResult.byLine.size) {
+  if (false) {
     const fromLine = ccResult.byLine.get(line1);
     if (fromLine !== undefined) {
killedBy: AnalysisOrchestrator uses tool-specific CC when available
statusReason: expected 2 to be 15 // Object.is equality

[Killed] ConditionalExpression
src/ddp/analysisOrchestrator.ts:187:9
   // Try line-based CC (ESLint for TS/JS, PMD for Java)
   if (ccResult.byLine.size) {
     const fromLine = ccResult.byLine.get(line1);
-    if (fromLine !== undefined) {
+    if (false) {
       return fromLine;
     }
killedBy: AnalysisOrchestrator uses tool-specific CC when available
statusReason: expected 2 to be 15 // Object.is equality

[Killed] ConditionalExpression
src/ddp/analysisOrchestrator.ts:187:9
   // Try line-based CC (ESLint for TS/JS, PMD for Java)
   if (ccResult.byLine.size) {
     const fromLine = ccResult.byLine.get(line1);
-    if (fromLine !== undefined) {
+    if (true) {
       return fromLine;
     }
killedBy: AnalysisOrchestrator falls back to line-based CC miss then name-based CC miss then regex estimator
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
src/ddp/analysisOrchestrator.ts:193:29
   }
 
   // Try name-based CC (Radon for Python)
-  if (ccResult.byName.size) {
-    const key = `${line1}:${fn.name}`;
-    const fromName = ccResult.byName.get(key);
-    if (fromName !== undefined) {
-      return fromName;
-    }
-  }
+  if (ccResult.byName.size) {}
 
   // Fallback: regex-based estimation from source text
killedBy: AnalysisOrchestrator uses name-based CC when line-based has no match
statusReason: expected 1 to be 8 // Object.is equality

[Killed] ConditionalExpression
src/ddp/analysisOrchestrator.ts:193:7
   }
 
   // Try name-based CC (Radon for Python)
-  if (ccResult.byName.size) {
+  if (false) {
     const key = `${line1}:${fn.name}`;
     const fromName = ccResult.byName.get(key);
killedBy: AnalysisOrchestrator uses name-based CC when line-based has no match
statusReason: expected 1 to be 8 // Object.is equality

[Killed] ConditionalExpression
src/ddp/analysisOrchestrator.ts:196:9
   if (ccResult.byName.size) {
     const key = `${line1}:${fn.name}`;
     const fromName = ccResult.byName.get(key);
-    if (fromName !== undefined) {
+    if (false) {
       return fromName;
     }
killedBy: AnalysisOrchestrator uses name-based CC when line-based has no match
statusReason: expected 1 to be 8 // Object.is equality

[Killed] EqualityOperator
src/ddp/analysisOrchestrator.ts:196:9
   if (ccResult.byName.size) {
     const key = `${line1}:${fn.name}`;
     const fromName = ccResult.byName.get(key);
-    if (fromName !== undefined) {
+    if (fromName === undefined) {
       return fromName;
     }
killedBy: AnalysisOrchestrator uses name-based CC when line-based has no match
statusReason: expected 1 to be 8 // Object.is equality
