[Killed] BlockStatement
src/ddp/analysisService.ts:31:17
   readonly coverageStore = new CoverageStore();
   private readonly logger: VsCodeLogger;
 
-  constructor() {
-    const channel = vscode.window.createOutputChannel("DDP Risk");
-    this.logger = new VsCodeLogger(channel);
-  }
+  constructor() {}
 
   async analyze(token: vscode.CancellationToken, scope?: AnalysisScope): Promise<AnalysisResult | undefined> {
killedBy: AnalysisService constructor creates OutputChannel named 'DDP Risk'
statusReason: expected "vi.fn()" to be called with arguments: [ 'DDP Risk' ]

Number of calls: 0

[Killed] StringLiteral
src/ddp/analysisService.ts:37:57
   }
 
   async analyze(token: vscode.CancellationToken, scope?: AnalysisScope): Promise<AnalysisResult | undefined> {
-    const rawConfig = vscode.workspace.getConfiguration("ddp");
+    const rawConfig = vscode.workspace.getConfiguration("");
     const config = buildConfiguration(<T>(key: string, def: T) => rawConfig.get<T>(key, def));
 
killedBy: AnalysisService configuration reads workspace configuration from 'ddp' section
statusReason: expected "vi.fn()" to be called with arguments: [ 'ddp' ]

Received:

  1st vi.fn() call:

  [
-   "ddp",

[Killed] ArrowFunction
src/ddp/analysisService.ts:38:39
 
   async analyze(token: vscode.CancellationToken, scope?: AnalysisScope): Promise<AnalysisResult | undefined> {
     const rawConfig = vscode.workspace.getConfiguration("ddp");
-    const config = buildConfiguration(<T>(key: string, def: T) => rawConfig.get<T>(key, def));
+    const config = buildConfiguration(() => undefined);
 
     const ccRegistry = new CcProviderRegistry();
killedBy: AnalysisService configuration delegates configuration getter to rawConfig.get
statusReason: expected "vi.fn()" to be called with arguments: [ 'some.key', 42 ]

Number of calls: 0

[Killed] ConditionalExpression
src/ddp/analysisService.ts:41:9
     const config = buildConfiguration(<T>(key: string, def: T) => rawConfig.get<T>(key, def));
 
     const ccRegistry = new CcProviderRegistry();
-    if (config.cc.useEslintForTsJs) {
+    if (false) {
       ccRegistry.register({
         supportedLanguages: ["typescript", "javascript", "typescriptreact", "javascriptreact"],
killedBy: AnalysisService CC provider registry registers ESLint provider for TS/JS when useEslintForTsJs is true
statusReason: expected "vi.fn()" to be called 3 times, but got 2 times

[Killed] BlockStatement
src/ddp/analysisService.ts:41:37
     const config = buildConfiguration(<T>(key: string, def: T) => rawConfig.get<T>(key, def));
 
     const ccRegistry = new CcProviderRegistry();
-    if (config.cc.useEslintForTsJs) {
-      ccRegistry.register({
-        supportedLanguages: ["typescript", "javascript", "typescriptreact", "javascriptreact"],
-        provider: new EslintCcProvider(config.cc.eslintPath),
-      });
-    }
+    if (config.cc.useEslintForTsJs) {}
     ccRegistry.register({
       supportedLanguages: ["python"],
killedBy: AnalysisService CC provider registry registers ESLint provider for TS/JS when useEslintForTsJs is true
statusReason: expected "vi.fn()" to be called 3 times, but got 2 times

[Killed] StringLiteral
src/ddp/analysisService.ts:43:77
     const ccRegistry = new CcProviderRegistry();
     if (config.cc.useEslintForTsJs) {
       ccRegistry.register({
-        supportedLanguages: ["typescript", "javascript", "typescriptreact", "javascriptreact"],
+        supportedLanguages: ["typescript", "javascript", "typescriptreact", ""],
         provider: new EslintCcProvider(config.cc.eslintPath),
       });
killedBy: AnalysisService CC provider registry registers ESLint provider for TS/JS when useEslintForTsJs is true
statusReason: expected [ 'typescript', 'javascript', …(2) ] to deeply equal [ 'typescript', 'javascript', …(2) ]

[Killed] StringLiteral
src/ddp/analysisService.ts:43:58
     const ccRegistry = new CcProviderRegistry();
     if (config.cc.useEslintForTsJs) {
       ccRegistry.register({
-        supportedLanguages: ["typescript", "javascript", "typescriptreact", "javascriptreact"],
+        supportedLanguages: ["typescript", "javascript", "", "javascriptreact"],
         provider: new EslintCcProvider(config.cc.eslintPath),
       });
killedBy: AnalysisService CC provider registry registers ESLint provider for TS/JS when useEslintForTsJs is true
statusReason: expected [ Array(4) ] to deeply equal [ 'typescript', 'javascript', …(2) ]

[Killed] ObjectLiteral
src/ddp/analysisService.ts:47:25
         provider: new EslintCcProvider(config.cc.eslintPath),
       });
     }
-    ccRegistry.register({
-      supportedLanguages: ["python"],
-      provider: new RadonCcProvider(config.cc.pythonPath),
-    });
+    ccRegistry.register({});
     ccRegistry.register({
       supportedLanguages: ["java"],
killedBy: AnalysisService CC provider registry skips ESLint registration when useEslintForTsJs is false
statusReason: expected [ undefined, [ 'java' ] ] to deeply equal [ [ 'python' ], [ 'java' ] ]

[Killed] StringLiteral
src/ddp/analysisService.ts:48:28
       });
     }
     ccRegistry.register({
-      supportedLanguages: ["python"],
+      supportedLanguages: [""],
       provider: new RadonCcProvider(config.cc.pythonPath),
     });
killedBy: AnalysisService CC provider registry skips ESLint registration when useEslintForTsJs is false
statusReason: expected [ [ '' ], [ 'java' ] ] to deeply equal [ [ 'python' ], [ 'java' ] ]

[Killed] ObjectLiteral
src/ddp/analysisService.ts:51:25
       supportedLanguages: ["python"],
       provider: new RadonCcProvider(config.cc.pythonPath),
     });
-    ccRegistry.register({
-      supportedLanguages: ["java"],
-      provider: new PmdCcProvider(config.cc.pmdPath),
-    });
+    ccRegistry.register({});
 
     const workspaceRootUri = vscode.workspace.workspaceFolders?.[0]?.uri.toString();
killedBy: AnalysisService CC provider registry skips ESLint registration when useEslintForTsJs is false
statusReason: expected [ [ 'python' ], undefined ] to deeply equal [ [ 'python' ], [ 'java' ] ]

[Killed] StringLiteral
src/ddp/analysisService.ts:52:28
       provider: new RadonCcProvider(config.cc.pythonPath),
     });
     ccRegistry.register({
-      supportedLanguages: ["java"],
+      supportedLanguages: [""],
       provider: new PmdCcProvider(config.cc.pmdPath),
     });
killedBy: AnalysisService CC provider registry skips ESLint registration when useEslintForTsJs is false
statusReason: expected [ [ 'python' ], [ '' ] ] to deeply equal [ [ 'python' ], [ 'java' ] ]

[Killed] OptionalChaining
src/ddp/analysisService.ts:56:30
       provider: new PmdCcProvider(config.cc.pmdPath),
     });
 
-    const workspaceRootUri = vscode.workspace.workspaceFolders?.[0]?.uri.toString();
+    const workspaceRootUri = vscode.workspace.workspaceFolders[0]?.uri.toString();
     const churnProvider = config.churn.enabled && workspaceRootUri
       ? new GitChurnAdapter(workspaceRootUri)
killedBy: AnalysisService churn adapter wiring passes undefined churnProvider when no workspace folders are open
statusReason: Cannot read properties of undefined (reading '0')

[Survived] OptionalChaining
src/ddp/analysisService.ts:56:30
       provider: new PmdCcProvider(config.cc.pmdPath),
     });
 
-    const workspaceRootUri = vscode.workspace.workspaceFolders?.[0]?.uri.toString();
+    const workspaceRootUri = vscode.workspace.workspaceFolders?.[0].uri.toString();
     const churnProvider = config.churn.enabled && workspaceRootUri
       ? new GitChurnAdapter(workspaceRootUri)

[Killed] ConditionalExpression
src/ddp/analysisService.ts:57:27
     });
 
     const workspaceRootUri = vscode.workspace.workspaceFolders?.[0]?.uri.toString();
-    const churnProvider = config.churn.enabled && workspaceRootUri
+    const churnProvider = false
       ? new GitChurnAdapter(workspaceRootUri)
       : undefined;
killedBy: AnalysisService churn adapter wiring creates GitChurnAdapter with workspace root URI when churn is enabled
statusReason: expected "vi.fn()" to be called with arguments: [ 'file:///c%3A/code/proj' ]

Number of calls: 0

[Killed] LogicalOperator
src/ddp/analysisService.ts:57:27
     });
 
     const workspaceRootUri = vscode.workspace.workspaceFolders?.[0]?.uri.toString();
-    const churnProvider = config.churn.enabled && workspaceRootUri
+    const churnProvider = config.churn.enabled || workspaceRootUri
       ? new GitChurnAdapter(workspaceRootUri)
       : undefined;
killedBy: AnalysisService churn adapter wiring does not create GitChurnAdapter when churn is disabled
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "file:///c%3A/code/proj",

[Killed] ArrowFunction
src/ddp/analysisService.ts:71:56
       churnProvider,
     });
 
-    return orchestrator.analyze(config, { isCancelled: () => token.isCancellationRequested }, scope);
+    return orchestrator.analyze(config, { isCancelled: () => undefined }, scope);
   }
 }
killedBy: AnalysisService cancellation forwarding delegates isCancelled to token.isCancellationRequested
statusReason: expected undefined to be false // Object.is equality
