[Killed] BooleanLiteral
src/ddp/analyzeCommand.ts:20:23
 };
 
 export class AnalyzeCommand {
-  private analyzing = false;
+  private analyzing = true;
 
   constructor(
killedBy: AnalyzeCommand scope storage stores the scope in state when a folder analysis succeeds
statusReason: expected undefined to deeply equal { rootUri: 'file:///c%3A/code/src' }

[Killed] ConditionalExpression
src/ddp/analyzeCommand.ts:29:9
   ) {}
 
   async execute(scope?: AnalysisScope): Promise<void> {
-    if (this.analyzing) {
+    if (false) {
       return;
     }
killedBy: AnalyzeCommand debounce guard ignores a second call while the first is still in progress
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/ddp/analyzeCommand.ts:29:25
   ) {}
 
   async execute(scope?: AnalysisScope): Promise<void> {
-    if (this.analyzing) {
-      return;
-    }
+    if (this.analyzing) {}
     this.analyzing = true;
     const title = scope
killedBy: AnalyzeCommand debounce guard ignores a second call while the first is still in progress
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BooleanLiteral
src/ddp/analyzeCommand.ts:32:22
     if (this.analyzing) {
       return;
     }
-    this.analyzing = true;
+    this.analyzing = false;
     const title = scope
       ? `DDP: analyzing folder\u2026`
killedBy: AnalyzeCommand debounce guard ignores a second call while the first is still in progress
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/ddp/analyzeCommand.ts:36:9
     const title = scope
       ? `DDP: analyzing folder\u2026`
       : "DDP: analyzing workspace\u2026";
-    try {
-      await vscode.window.withProgress(
-        {
-          location: vscode.ProgressLocation.Notification,
-          title,
-          cancellable: true,
-        },
-        async (_progress, token) => {
-          const result = await this.runAnalysis(token, scope);
-          if (result) {
-            this.state.setAnalysis(result, scope);
-          }
-          this.ui.refreshTree();
-          this.ui.invalidateCodeLens();
-          this.ui.applyDecorations();
-        }
-      );
-    } finally {
+    try {} finally {
       this.analyzing = false;
     }
killedBy: AnalyzeCommand scope storage stores the scope in state when a folder analysis succeeds
statusReason: expected undefined to deeply equal { rootUri: 'file:///c%3A/code/src' }

[Killed] BooleanLiteral
src/ddp/analyzeCommand.ts:41:24
         {
           location: vscode.ProgressLocation.Notification,
           title,
-          cancellable: true,
+          cancellable: false,
         },
         async (_progress, token) => {
killedBy: AnalyzeCommand progress options shows notification with folder title when scope is provided
statusReason: expected "vi.fn()" to be called with arguments: [ { location: 15, …(2) }, …(1) ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
src/ddp/analyzeCommand.ts:43:37
           title,
           cancellable: true,
         },
-        async (_progress, token) => {
-          const result = await this.runAnalysis(token, scope);
-          if (result) {
-            this.state.setAnalysis(result, scope);
-          }
-          this.ui.refreshTree();
-          this.ui.invalidateCodeLens();
-          this.ui.applyDecorations();
-        }
+        async (_progress, token) => {}
       );
     } finally {
killedBy: AnalyzeCommand scope storage stores the scope in state when a folder analysis succeeds
statusReason: expected undefined to deeply equal { rootUri: 'file:///c%3A/code/src' }

[Killed] ConditionalExpression
src/ddp/analyzeCommand.ts:45:15
         },
         async (_progress, token) => {
           const result = await this.runAnalysis(token, scope);
-          if (result) {
+          if (true) {
             this.state.setAnalysis(result, scope);
           }
killedBy: AnalyzeCommand result handling does not store analysis when runAnalysis returns undefined
statusReason: expected "setAnalysis" to not be called at all, but actually been called 1 times

Received:

  1st setAnalysis call:

    Array [
      undefined,

[Killed] BlockStatement
src/ddp/analyzeCommand.ts:45:23
         },
         async (_progress, token) => {
           const result = await this.runAnalysis(token, scope);
-          if (result) {
-            this.state.setAnalysis(result, scope);
-          }
+          if (result) {}
           this.ui.refreshTree();
           this.ui.invalidateCodeLens();
killedBy: AnalyzeCommand scope storage stores the scope in state when a folder analysis succeeds
statusReason: expected undefined to deeply equal { rootUri: 'file:///c%3A/code/src' }

[Killed] BlockStatement
src/ddp/analyzeCommand.ts:53:15
           this.ui.applyDecorations();
         }
       );
-    } finally {
-      this.analyzing = false;
-    }
+    } finally {}
   }
 }
killedBy: AnalyzeCommand scope storage stores undefined scope for workspace-wide analysis
statusReason: expected { rootUri: 'file:///c%3A/code/src' } to be undefined

[Killed] BooleanLiteral
src/ddp/analyzeCommand.ts:54:24
         }
       );
     } finally {
-      this.analyzing = false;
+      this.analyzing = true;
     }
   }
killedBy: AnalyzeCommand scope storage stores undefined scope for workspace-wide analysis
statusReason: expected { rootUri: 'file:///c%3A/code/src' } to be undefined
