[Killed] BlockStatement
src/ddp/cc/eslintComplexity.ts:3:59
 import { runEslintComplexity } from "./eslintSpawn";
 
-export function isJsLanguage(languageId: string): boolean {
-  return (
-    languageId === "javascript" ||
-    languageId === "typescript" ||
-    languageId === "javascriptreact" ||
-    languageId === "typescriptreact"
-  );
-}
+export function isJsLanguage(languageId: string): boolean {}
 
 export async function eslintCcForFile(
killedBy: eslintCcForFile isJsLanguage accepts all four JS/TS language IDs and rejects others
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/ddp/cc/eslintComplexity.ts:5:5
 
 export function isJsLanguage(languageId: string): boolean {
   return (
-    languageId === "javascript" ||
-    languageId === "typescript" ||
-    languageId === "javascriptreact" ||
+    (languageId === "javascript" || languageId === "typescript") && languageId === "javascriptreact" ||
     languageId === "typescriptreact"
   );
killedBy: eslintCcForFile isJsLanguage accepts all four JS/TS language IDs and rejects others
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/ddp/cc/eslintComplexity.ts:5:5
 
 export function isJsLanguage(languageId: string): boolean {
   return (
-    languageId === "javascript" ||
+    languageId !== "javascript" ||
     languageId === "typescript" ||
     languageId === "javascriptreact" ||
killedBy: eslintCcForFile isJsLanguage accepts all four JS/TS language IDs and rejects others
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/eslintComplexity.ts:6:5
 export function isJsLanguage(languageId: string): boolean {
   return (
     languageId === "javascript" ||
-    languageId === "typescript" ||
+    false ||
     languageId === "javascriptreact" ||
     languageId === "typescriptreact"
killedBy: eslintCcForFile isJsLanguage accepts all four JS/TS language IDs and rejects others
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/ddp/cc/eslintComplexity.ts:6:5
 export function isJsLanguage(languageId: string): boolean {
   return (
     languageId === "javascript" ||
-    languageId === "typescript" ||
+    languageId !== "typescript" ||
     languageId === "javascriptreact" ||
     languageId === "typescriptreact"
killedBy: eslintCcForFile isJsLanguage accepts all four JS/TS language IDs and rejects others
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/eslintComplexity.ts:7:5
   return (
     languageId === "javascript" ||
     languageId === "typescript" ||
-    languageId === "javascriptreact" ||
+    false ||
     languageId === "typescriptreact"
   );
killedBy: eslintCcForFile isJsLanguage accepts all four JS/TS language IDs and rejects others
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/ddp/cc/eslintComplexity.ts:7:5
   return (
     languageId === "javascript" ||
     languageId === "typescript" ||
-    languageId === "javascriptreact" ||
+    languageId !== "javascriptreact" ||
     languageId === "typescriptreact"
   );
killedBy: eslintCcForFile isJsLanguage accepts all four JS/TS language IDs and rejects others
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/ddp/cc/eslintComplexity.ts:8:5
     languageId === "javascript" ||
     languageId === "typescript" ||
     languageId === "javascriptreact" ||
-    languageId === "typescriptreact"
+    languageId !== "typescriptreact"
   );
 }
killedBy: eslintCcForFile isJsLanguage accepts all four JS/TS language IDs and rejects others
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/eslintComplexity.ts:8:5
     languageId === "javascript" ||
     languageId === "typescript" ||
     languageId === "javascriptreact" ||
-    languageId === "typescriptreact"
+    false
   );
 }
killedBy: eslintCcForFile isJsLanguage accepts all four JS/TS language IDs and rejects others
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/ddp/cc/eslintComplexity.ts:17:33
   fsPath: string,
   cwd: string,
   eslintPath: string
-): Promise<Map<number, number>> {
-  if (!isJsLanguage(languageId)) {
-    return new Map();
-  }
-  return runEslintComplexity(eslintPath, fsPath, cwd, 20000);
-}
+): Promise<Map<number, number>> {}
 
killedBy: eslintCcForFile returns empty map without calling ESLint when languageId is not a JS language
statusReason: Cannot read properties of undefined (reading 'size')

[Killed] ConditionalExpression
src/ddp/cc/eslintComplexity.ts:18:7
   cwd: string,
   eslintPath: string
 ): Promise<Map<number, number>> {
-  if (!isJsLanguage(languageId)) {
+  if (true) {
     return new Map();
   }
killedBy: eslintCcForFile delegates to runEslintComplexity when languageId is javascript
statusReason: expected Map{} to be Map{ 10 => 7 } // Object.is equality

[Killed] BooleanLiteral
src/ddp/cc/eslintComplexity.ts:18:7
   cwd: string,
   eslintPath: string
 ): Promise<Map<number, number>> {
-  if (!isJsLanguage(languageId)) {
+  if (isJsLanguage(languageId)) {
     return new Map();
   }
killedBy: eslintCcForFile returns empty map without calling ESLint when languageId is not a JS language
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "/usr/bin/eslint",
