[Killed] StringLiteral
src/ddp/cc/eslintSpawn.ts:16:20
   return new Promise((resolve) => {
     const proc = cp.spawn(
       eslintPath,
-      [fileFsPath, "-f", "json", "--no-error-on-unmatched-pattern", "--no-warn-ignored"],
+      [fileFsPath, "", "json", "--no-error-on-unmatched-pattern", "--no-warn-ignored"],
       { cwd, windowsHide: true }
     );
killedBy: runEslintComplexity passes correct arguments to cp.spawn
statusReason: expected "vi.fn()" to be called with arguments: [ '/opt/eslint/bin/eslint', …(2) ]

Received:

  1st vi.fn() call:

@@ -1,10 +1,10 @@
  [

[Killed] BooleanLiteral
src/ddp/cc/eslintSpawn.ts:17:27
     const proc = cp.spawn(
       eslintPath,
       [fileFsPath, "-f", "json", "--no-error-on-unmatched-pattern", "--no-warn-ignored"],
-      { cwd, windowsHide: true }
+      { cwd, windowsHide: false }
     );
     let stdout = "";
killedBy: runEslintComplexity passes correct arguments to cp.spawn
statusReason: expected "vi.fn()" to be called with arguments: [ '/opt/eslint/bin/eslint', …(2) ]

Received:

  1st vi.fn() call:

@@ -7,8 +7,8 @@
      "--no-error-on-unmatched-pattern",

[Killed] StringLiteral
src/ddp/cc/eslintSpawn.ts:19:18
       [fileFsPath, "-f", "json", "--no-error-on-unmatched-pattern", "--no-warn-ignored"],
       { cwd, windowsHide: true }
     );
-    let stdout = "";
+    let stdout = "Stryker was here!";
     let done = false;
     const finish = (m: Map<number, number>) => {
killedBy: runEslintComplexity returns parsed map when ESLint produces valid JSON output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] BooleanLiteral
src/ddp/cc/eslintSpawn.ts:20:16
       { cwd, windowsHide: true }
     );
     let stdout = "";
-    let done = false;
+    let done = true;
     const finish = (m: Map<number, number>) => {
       if (!done) {
killedBy: runEslintComplexity returns parsed map when ESLint produces valid JSON output
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/ddp/cc/eslintSpawn.ts:21:48
     );
     let stdout = "";
     let done = false;
-    const finish = (m: Map<number, number>) => {
-      if (!done) {
-        done = true;
-        resolve(m);
-      }
-    };
+    const finish = (m: Map<number, number>) => {};
     const t = setTimeout(() => {
       proc.kill();
killedBy: runEslintComplexity returns parsed map when ESLint produces valid JSON output
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/ddp/cc/eslintSpawn.ts:22:18
     let stdout = "";
     let done = false;
     const finish = (m: Map<number, number>) => {
-      if (!done) {
-        done = true;
-        resolve(m);
-      }
+      if (!done) {}
     };
     const t = setTimeout(() => {
killedBy: runEslintComplexity returns parsed map when ESLint produces valid JSON output
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/ddp/cc/eslintSpawn.ts:22:11
     let stdout = "";
     let done = false;
     const finish = (m: Map<number, number>) => {
-      if (!done) {
+      if (false) {
         done = true;
         resolve(m);
killedBy: runEslintComplexity returns parsed map when ESLint produces valid JSON output
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] BooleanLiteral
src/ddp/cc/eslintSpawn.ts:23:16
     let done = false;
     const finish = (m: Map<number, number>) => {
       if (!done) {
-        done = true;
+        done = false;
         resolve(m);
       }

[Killed] BlockStatement
src/ddp/cc/eslintSpawn.ts:27:32
         resolve(m);
       }
     };
-    const t = setTimeout(() => {
-      proc.kill();
-      finish(new Map());
-    }, timeoutMs);
+    const t = setTimeout(() => {}, timeoutMs);
     proc.stdout?.on("data", (d: Buffer) => {
       stdout += d.toString();
killedBy: runEslintComplexity returns empty map and kills process when timeout expires
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] OptionalChaining
src/ddp/cc/eslintSpawn.ts:31:5
       proc.kill();
       finish(new Map());
     }, timeoutMs);
-    proc.stdout?.on("data", (d: Buffer) => {
+    proc.stdout.on("data", (d: Buffer) => {
       stdout += d.toString();
     });
killedBy: runEslintComplexity returns empty map when stdout is null
statusReason: Cannot read properties of null (reading 'on')

[Killed] BlockStatement
src/ddp/cc/eslintSpawn.ts:31:44
       proc.kill();
       finish(new Map());
     }, timeoutMs);
-    proc.stdout?.on("data", (d: Buffer) => {
-      stdout += d.toString();
-    });
+    proc.stdout?.on("data", (d: Buffer) => {});
     proc.on("close", () => {
       clearTimeout(t);
killedBy: runEslintComplexity returns parsed map when ESLint produces valid JSON output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] AssignmentOperator
src/ddp/cc/eslintSpawn.ts:32:7
       finish(new Map());
     }, timeoutMs);
     proc.stdout?.on("data", (d: Buffer) => {
-      stdout += d.toString();
+      stdout -= d.toString();
     });
     proc.on("close", () => {
killedBy: runEslintComplexity returns parsed map when ESLint produces valid JSON output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] BlockStatement
src/ddp/cc/eslintSpawn.ts:34:28
     proc.stdout?.on("data", (d: Buffer) => {
       stdout += d.toString();
     });
-    proc.on("close", () => {
-      clearTimeout(t);
-      finish(parseEslintComplexityJson(stdout));
-    });
+    proc.on("close", () => {});
     proc.on("error", () => {
       clearTimeout(t);
killedBy: runEslintComplexity returns parsed map when ESLint produces valid JSON output
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/ddp/cc/eslintSpawn.ts:38:28
       clearTimeout(t);
       finish(parseEslintComplexityJson(stdout));
     });
-    proc.on("error", () => {
-      clearTimeout(t);
-      finish(new Map());
-    });
+    proc.on("error", () => {});
   });
 }
killedBy: runEslintComplexity returns empty map when spawn emits error
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
