[Killed] BlockStatement
src/ddp/cc/pmdComplexity.ts:12:33
   fsPath: string,
   cwd: string,
   pmdPath: string
-): Promise<Map<number, number>> {
-  if (languageId !== "java") {
-    return new Map();
-  }
-  return runPmdCyclomaticComplexity(pmdPath, fsPath, cwd, 30000);
-}
+): Promise<Map<number, number>> {}
 
killedBy: pmdCcForFile returns empty map without calling PMD when languageId is not java
statusReason: Cannot read properties of undefined (reading 'size')

[Killed] BlockStatement
src/ddp/cc/pmdComplexity.ts:13:30
   cwd: string,
   pmdPath: string
 ): Promise<Map<number, number>> {
-  if (languageId !== "java") {
-    return new Map();
-  }
+  if (languageId !== "java") {}
   return runPmdCyclomaticComplexity(pmdPath, fsPath, cwd, 30000);
 }
killedBy: pmdCcForFile returns empty map without calling PMD when languageId is not java
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "/usr/bin/pmd",

[Killed] ConditionalExpression
src/ddp/cc/pmdComplexity.ts:13:7
   cwd: string,
   pmdPath: string
 ): Promise<Map<number, number>> {
-  if (languageId !== "java") {
+  if (true) {
     return new Map();
   }
killedBy: pmdCcForFile delegates to runPmdCyclomaticComplexity when languageId is java
statusReason: expected Map{} to be Map{ 10 => 7 } // Object.is equality
