[Killed] Regex
src/ddp/cc/pmdParse.ts:21:23
 export function parsePmdCyclomaticXml(xmlText: string): Map<number, number> {
   const byLine = new Map<number, number>();
   // Match every <violation> that mentions a Cyclomatic rule.
-  const violationRe = /<violation\s([^>]*)>([\s\S]*?)<\/violation>/gi;
+  const violationRe = /<violation\s([>]*)>([\s\S]*?)<\/violation>/gi;
   const beginlineRe = /\bbeginline="(\d+)"/i;
   const ruleRe = /\brule="[a-z]*cyclomatic[a-z]*"/i;
killedBy: runPmdCyclomaticComplexity returns parsed map when PMD produces valid XML output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] Regex
src/ddp/cc/pmdParse.ts:21:23
 export function parsePmdCyclomaticXml(xmlText: string): Map<number, number> {
   const byLine = new Map<number, number>();
   // Match every <violation> that mentions a Cyclomatic rule.
-  const violationRe = /<violation\s([^>]*)>([\s\S]*?)<\/violation>/gi;
+  const violationRe = /<violation\s([^>]*)>([\s\s]*?)<\/violation>/gi;
   const beginlineRe = /\bbeginline="(\d+)"/i;
   const ruleRe = /\brule="[a-z]*cyclomatic[a-z]*"/i;
killedBy: runPmdCyclomaticComplexity returns parsed map when PMD produces valid XML output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] Regex
src/ddp/cc/pmdParse.ts:22:23
   const byLine = new Map<number, number>();
   // Match every <violation> that mentions a Cyclomatic rule.
   const violationRe = /<violation\s([^>]*)>([\s\S]*?)<\/violation>/gi;
-  const beginlineRe = /\bbeginline="(\d+)"/i;
+  const beginlineRe = /\bbeginline="(\d)"/i;
   const ruleRe = /\brule="[a-z]*cyclomatic[a-z]*"/i;
 
killedBy: runPmdCyclomaticComplexity returns parsed map when PMD produces valid XML output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] Regex
src/ddp/cc/pmdParse.ts:22:23
   const byLine = new Map<number, number>();
   // Match every <violation> that mentions a Cyclomatic rule.
   const violationRe = /<violation\s([^>]*)>([\s\S]*?)<\/violation>/gi;
-  const beginlineRe = /\bbeginline="(\d+)"/i;
+  const beginlineRe = /\bbeginline="(\D+)"/i;
   const ruleRe = /\brule="[a-z]*cyclomatic[a-z]*"/i;
 
killedBy: runPmdCyclomaticComplexity returns parsed map when PMD produces valid XML output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] Regex
src/ddp/cc/pmdParse.ts:23:18
   // Match every <violation> that mentions a Cyclomatic rule.
   const violationRe = /<violation\s([^>]*)>([\s\S]*?)<\/violation>/gi;
   const beginlineRe = /\bbeginline="(\d+)"/i;
-  const ruleRe = /\brule="[a-z]*cyclomatic[a-z]*"/i;
+  const ruleRe = /\brule="[a-z]cyclomatic[a-z]*"/i;
 
   let match: RegExpExecArray | null;
killedBy: runPmdCyclomaticComplexity returns parsed map when PMD produces valid XML output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] EqualityOperator
src/ddp/cc/pmdParse.ts:26:10
   const ruleRe = /\brule="[a-z]*cyclomatic[a-z]*"/i;
 
   let match: RegExpExecArray | null;
-  while ((match = violationRe.exec(xmlText)) !== null) {
+  while ((match = violationRe.exec(xmlText)) === null) {
     const attrs = match[1];
     const body = match[2];
killedBy: runPmdCyclomaticComplexity returns parsed map when PMD produces valid XML output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] BlockStatement
src/ddp/cc/pmdParse.ts:26:56
   const ruleRe = /\brule="[a-z]*cyclomatic[a-z]*"/i;
 
   let match: RegExpExecArray | null;
-  while ((match = violationRe.exec(xmlText)) !== null) {
-    const attrs = match[1];
-    const body = match[2];
-    if (!ruleRe.test(attrs)) {
-      continue;
-    }
-    const lineMatch = beginlineRe.exec(attrs);
-    if (!lineMatch) {
-      continue;
-    }
-    const line = Number.parseInt(lineMatch[1], 10);
-    const cc = extractComplexityFromMessage(body);
-    if (!Number.isNaN(line) && cc !== undefined) {
-      const prev = byLine.get(line) ?? 0;
-      byLine.set(line, Math.max(prev, cc));
-    }
-  }
+  while ((match = violationRe.exec(xmlText)) !== null) {}
   return byLine;
 }
killedBy: parsePmdCyclomaticXml parses a single CyclomaticComplexity violation
statusReason: expected undefined to be 7 // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/pmdParse.ts:29:9
   while ((match = violationRe.exec(xmlText)) !== null) {
     const attrs = match[1];
     const body = match[2];
-    if (!ruleRe.test(attrs)) {
+    if (false) {
       continue;
     }
killedBy: mutation-killing: pmdParse.ts skips violation with non-cyclomatic rule even if message contains complexity
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/ddp/cc/pmdParse.ts:29:30
   while ((match = violationRe.exec(xmlText)) !== null) {
     const attrs = match[1];
     const body = match[2];
-    if (!ruleRe.test(attrs)) {
-      continue;
-    }
+    if (!ruleRe.test(attrs)) {}
     const lineMatch = beginlineRe.exec(attrs);
     if (!lineMatch) {
killedBy: mutation-killing: pmdParse.ts skips violation with non-cyclomatic rule even if message contains complexity
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/pmdParse.ts:33:9
       continue;
     }
     const lineMatch = beginlineRe.exec(attrs);
-    if (!lineMatch) {
+    if (false) {
       continue;
     }
killedBy: mutation-killing: pmdParse.ts skips violation without beginline attribute
statusReason: Cannot read properties of null (reading '1')

[Killed] BooleanLiteral
src/ddp/cc/pmdParse.ts:33:9
       continue;
     }
     const lineMatch = beginlineRe.exec(attrs);
-    if (!lineMatch) {
+    if (lineMatch) {
       continue;
     }
killedBy: parsePmdCyclomaticXml parses a single CyclomaticComplexity violation
statusReason: expected undefined to be 7 // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/pmdParse.ts:38:32
     }
     const line = Number.parseInt(lineMatch[1], 10);
     const cc = extractComplexityFromMessage(body);
-    if (!Number.isNaN(line) && cc !== undefined) {
+    if (!Number.isNaN(line) && true) {
       const prev = byLine.get(line) ?? 0;
       byLine.set(line, Math.max(prev, cc));
killedBy: mutation-killing: pmdParse.ts skips violation where complexity cannot be extracted from message
statusReason: expected 1 to be +0 // Object.is equality

[Killed] LogicalOperator
src/ddp/cc/pmdParse.ts:38:9
     }
     const line = Number.parseInt(lineMatch[1], 10);
     const cc = extractComplexityFromMessage(body);
-    if (!Number.isNaN(line) && cc !== undefined) {
+    if (!Number.isNaN(line) || cc !== undefined) {
       const prev = byLine.get(line) ?? 0;
       byLine.set(line, Math.max(prev, cc));
killedBy: mutation-killing: pmdParse.ts skips violation where complexity cannot be extracted from message
statusReason: expected 1 to be +0 // Object.is equality

[Killed] LogicalOperator
src/ddp/cc/pmdParse.ts:39:20
     const line = Number.parseInt(lineMatch[1], 10);
     const cc = extractComplexityFromMessage(body);
     if (!Number.isNaN(line) && cc !== undefined) {
-      const prev = byLine.get(line) ?? 0;
+      const prev = byLine.get(line) && 0;
       byLine.set(line, Math.max(prev, cc));
     }
killedBy: parsePmdCyclomaticXml parses a single CyclomaticComplexity violation
statusReason: expected NaN to be 7 // Object.is equality

[Killed] MethodExpression
src/ddp/cc/pmdParse.ts:40:24
     const cc = extractComplexityFromMessage(body);
     if (!Number.isNaN(line) && cc !== undefined) {
       const prev = byLine.get(line) ?? 0;
-      byLine.set(line, Math.max(prev, cc));
+      byLine.set(line, Math.min(prev, cc));
     }
   }
killedBy: parsePmdCyclomaticXml parses a single CyclomaticComplexity violation
statusReason: expected +0 to be 7 // Object.is equality

[Killed] BlockStatement
src/ddp/cc/pmdParse.ts:47:83
 }
 
 /** Extract the numeric complexity from PMD's violation message text. */
-export function extractComplexityFromMessage(message: string): number | undefined {
-  const re = /complexity of (\d+)/i;
-  const m = re.exec(message);
-  if (m) {
-    return Number.parseInt(m[1], 10);
-  }
-  return undefined;
-}
+export function extractComplexityFromMessage(message: string): number | undefined {}
 
killedBy: extractComplexityFromMessage extracts complexity number from PMD message
statusReason: expected undefined to be 12 // Object.is equality

[Killed] Regex
src/ddp/cc/pmdParse.ts:48:14
 
 /** Extract the numeric complexity from PMD's violation message text. */
 export function extractComplexityFromMessage(message: string): number | undefined {
-  const re = /complexity of (\d+)/i;
+  const re = /complexity of (\d)/i;
   const m = re.exec(message);
   if (m) {
killedBy: extractComplexityFromMessage extracts complexity number from PMD message
statusReason: expected 1 to be 12 // Object.is equality

[Killed] BlockStatement
src/ddp/cc/pmdParse.ts:50:10
 export function extractComplexityFromMessage(message: string): number | undefined {
   const re = /complexity of (\d+)/i;
   const m = re.exec(message);
-  if (m) {
-    return Number.parseInt(m[1], 10);
-  }
+  if (m) {}
   return undefined;
 }
killedBy: extractComplexityFromMessage extracts complexity number from PMD message
statusReason: expected undefined to be 12 // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/pmdParse.ts:50:7
 export function extractComplexityFromMessage(message: string): number | undefined {
   const re = /complexity of (\d+)/i;
   const m = re.exec(message);
-  if (m) {
+  if (false) {
     return Number.parseInt(m[1], 10);
   }
killedBy: extractComplexityFromMessage extracts complexity number from PMD message
statusReason: expected undefined to be 12 // Object.is equality
