[Killed] StringLiteral
src/ddp/cc/pmdSpawn.ts:26:7
     const args = [
       "check",
       "-d", fileFsPath,
-      "-R", "category/java/design.xml",
+      "", "category/java/design.xml",
       "-f", "xml",
       "--no-cache",
killedBy: runPmdCyclomaticComplexity passes correct arguments to cp.spawn
statusReason: expected "vi.fn()" to be called with arguments: [ '/opt/pmd/bin/pmd', …(2) ]

Received:

  1st vi.fn() call:

@@ -2,11 +2,11 @@
    "/opt/pmd/bin/pmd",

[Killed] BooleanLiteral
src/ddp/cc/pmdSpawn.ts:31:62
       "--no-cache",
     ];
 
-    const proc = cp.spawn(pmdPath, args, { cwd, windowsHide: true });
+    const proc = cp.spawn(pmdPath, args, { cwd, windowsHide: false });
     let stdout = "";
     let done = false;
killedBy: runPmdCyclomaticComplexity passes correct arguments to cp.spawn
statusReason: expected "vi.fn()" to be called with arguments: [ '/opt/pmd/bin/pmd', …(2) ]

Received:

  1st vi.fn() call:

@@ -10,8 +10,8 @@
      "xml",

[Killed] ObjectLiteral
src/ddp/cc/pmdSpawn.ts:31:42
       "--no-cache",
     ];
 
-    const proc = cp.spawn(pmdPath, args, { cwd, windowsHide: true });
+    const proc = cp.spawn(pmdPath, args, {});
     let stdout = "";
     let done = false;
killedBy: runPmdCyclomaticComplexity passes correct arguments to cp.spawn
statusReason: expected "vi.fn()" to be called with arguments: [ '/opt/pmd/bin/pmd', …(2) ]

Received:

  1st vi.fn() call:

@@ -8,10 +8,7 @@
      "category/java/design.xml",

[Killed] BlockStatement
src/ddp/cc/pmdSpawn.ts:47:28
     proc.stdout?.on("data", (d: Buffer) => {
       stdout += d.toString();
     });
-    proc.on("close", () => {
-      clearTimeout(t);
-      // PMD exits with code 4 when violations are found — that's expected, not an error.
-      finish(parsePmdCyclomaticXml(stdout));
-    });
+    proc.on("close", () => {});
     proc.on("error", () => {
       clearTimeout(t);
killedBy: runPmdCyclomaticComplexity returns parsed map when PMD produces valid XML output
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
