[Killed] BlockStatement
src/ddp/cc/radonCc.ts:8:33
   fsPath: string,
   cwd: string,
   pythonPath: string
-): Promise<Map<string, number>> {
-  if (languageId !== "python") {
-    return new Map();
-  }
-  return runRadonCc(pythonPath, fsPath, cwd, 15000);
-}
+): Promise<Map<string, number>> {}
 
killedBy: radonCcForFile returns empty map without calling radon when languageId is not python
statusReason: Cannot read properties of undefined (reading 'size')

[Killed] BlockStatement
src/ddp/cc/radonCc.ts:9:32
   cwd: string,
   pythonPath: string
 ): Promise<Map<string, number>> {
-  if (languageId !== "python") {
-    return new Map();
-  }
+  if (languageId !== "python") {}
   return runRadonCc(pythonPath, fsPath, cwd, 15000);
 }
killedBy: radonCcForFile returns empty map without calling radon when languageId is not python
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "/usr/bin/python3",

[Killed] EqualityOperator
src/ddp/cc/radonCc.ts:9:7
   cwd: string,
   pythonPath: string
 ): Promise<Map<string, number>> {
-  if (languageId !== "python") {
+  if (languageId === "python") {
     return new Map();
   }
killedBy: radonCcForFile returns empty map without calling radon when languageId is not python
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "/usr/bin/python3",
