[Killed] BlockStatement
src/ddp/cc/radonParse.ts:6:94
 /**
  * Parse `radon cc -j` output for a single file (object keyed by path).
  */
-export function parseRadonCcJson(jsonText: string, absFilePath: string): Map<string, number> {
-  const out = new Map<string, number>();
-  try {
-    const root = JSON.parse(jsonText) as Record<string, unknown>;
-    const resolvedTarget = path.resolve(absFilePath);
-    for (const filePath of Object.keys(root)) {
-      if (path.resolve(filePath) !== resolvedTarget) {
-        continue;
-      }
-      const blocks = root[filePath];
-      if (!Array.isArray(blocks)) {
-        continue;
-      }
-      for (const b of blocks as { name?: string; lineno?: number; complexity?: number }[]) {
-        if (typeof b.name === "string" && typeof b.complexity === "number" && typeof b.lineno === "number") {
-          const key = `${b.lineno}:${b.name}`;
-          out.set(key, b.complexity);
-        }
-      }
-    }
-  } catch {
-    /* ignore */
-  }
-  return out;
-}
+export function parseRadonCcJson(jsonText: string, absFilePath: string): Map<string, number> {}
 
killedBy: runRadonCc returns parsed map when radon produces valid JSON output
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/ddp/cc/radonParse.ts:8:7
  */
 export function parseRadonCcJson(jsonText: string, absFilePath: string): Map<string, number> {
   const out = new Map<string, number>();
-  try {
-    const root = JSON.parse(jsonText) as Record<string, unknown>;
-    const resolvedTarget = path.resolve(absFilePath);
-    for (const filePath of Object.keys(root)) {
-      if (path.resolve(filePath) !== resolvedTarget) {
-        continue;
-      }
-      const blocks = root[filePath];
-      if (!Array.isArray(blocks)) {
-        continue;
-      }
-      for (const b of blocks as { name?: string; lineno?: number; complexity?: number }[]) {
-        if (typeof b.name === "string" && typeof b.complexity === "number" && typeof b.lineno === "number") {
-          const key = `${b.lineno}:${b.name}`;
-          out.set(key, b.complexity);
-        }
-      }
-    }
-  } catch {
+  try {} catch {
     /* ignore */
   }
killedBy: runRadonCc returns parsed map when radon produces valid JSON output
statusReason: expected undefined to be 4 // Object.is equality

[Killed] BlockStatement
src/ddp/cc/radonParse.ts:11:47
   try {
     const root = JSON.parse(jsonText) as Record<string, unknown>;
     const resolvedTarget = path.resolve(absFilePath);
-    for (const filePath of Object.keys(root)) {
-      if (path.resolve(filePath) !== resolvedTarget) {
-        continue;
-      }
-      const blocks = root[filePath];
-      if (!Array.isArray(blocks)) {
-        continue;
-      }
-      for (const b of blocks as { name?: string; lineno?: number; complexity?: number }[]) {
-        if (typeof b.name === "string" && typeof b.complexity === "number" && typeof b.lineno === "number") {
-          const key = `${b.lineno}:${b.name}`;
-          out.set(key, b.complexity);
-        }
-      }
-    }
+    for (const filePath of Object.keys(root)) {}
   } catch {
     /* ignore */
killedBy: runRadonCc returns parsed map when radon produces valid JSON output
statusReason: expected undefined to be 4 // Object.is equality

[Killed] BlockStatement
src/ddp/cc/radonParse.ts:12:54
     const root = JSON.parse(jsonText) as Record<string, unknown>;
     const resolvedTarget = path.resolve(absFilePath);
     for (const filePath of Object.keys(root)) {
-      if (path.resolve(filePath) !== resolvedTarget) {
-        continue;
-      }
+      if (path.resolve(filePath) !== resolvedTarget) {}
       const blocks = root[filePath];
       if (!Array.isArray(blocks)) {
killedBy: bugmagnet session 2026-04-16 complex output scenarios returns empty map when radon output has wrong file path key
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/radonParse.ts:12:11
     const root = JSON.parse(jsonText) as Record<string, unknown>;
     const resolvedTarget = path.resolve(absFilePath);
     for (const filePath of Object.keys(root)) {
-      if (path.resolve(filePath) !== resolvedTarget) {
+      if (false) {
         continue;
       }
killedBy: bugmagnet session 2026-04-16 complex output scenarios returns empty map when radon output has wrong file path key
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/ddp/cc/radonParse.ts:16:11
         continue;
       }
       const blocks = root[filePath];
-      if (!Array.isArray(blocks)) {
+      if (Array.isArray(blocks)) {
         continue;
       }
killedBy: runRadonCc returns parsed map when radon produces valid JSON output
statusReason: expected undefined to be 4 // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/radonParse.ts:16:11
         continue;
       }
       const blocks = root[filePath];
-      if (!Array.isArray(blocks)) {
+      if (true) {
         continue;
       }
killedBy: runRadonCc returns parsed map when radon produces valid JSON output
statusReason: expected undefined to be 4 // Object.is equality

[Killed] BlockStatement
src/ddp/cc/radonParse.ts:19:92
       if (!Array.isArray(blocks)) {
         continue;
       }
-      for (const b of blocks as { name?: string; lineno?: number; complexity?: number }[]) {
-        if (typeof b.name === "string" && typeof b.complexity === "number" && typeof b.lineno === "number") {
-          const key = `${b.lineno}:${b.name}`;
-          out.set(key, b.complexity);
-        }
-      }
+      for (const b of blocks as { name?: string; lineno?: number; complexity?: number }[]) {}
     }
   } catch {
killedBy: runRadonCc returns parsed map when radon produces valid JSON output
statusReason: expected undefined to be 4 // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/radonParse.ts:20:79
         continue;
       }
       for (const b of blocks as { name?: string; lineno?: number; complexity?: number }[]) {
-        if (typeof b.name === "string" && typeof b.complexity === "number" && typeof b.lineno === "number") {
+        if (typeof b.name === "string" && typeof b.complexity === "number" && true) {
           const key = `${b.lineno}:${b.name}`;
           out.set(key, b.complexity);
killedBy: parseRadonCcJson skips blocks with non-number lineno
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/radonParse.ts:20:13
         continue;
       }
       for (const b of blocks as { name?: string; lineno?: number; complexity?: number }[]) {
-        if (typeof b.name === "string" && typeof b.complexity === "number" && typeof b.lineno === "number") {
+        if (false) {
           const key = `${b.lineno}:${b.name}`;
           out.set(key, b.complexity);
killedBy: runRadonCc returns parsed map when radon produces valid JSON output
statusReason: expected undefined to be 4 // Object.is equality

[Killed] StringLiteral
src/ddp/cc/radonParse.ts:21:23
       }
       for (const b of blocks as { name?: string; lineno?: number; complexity?: number }[]) {
         if (typeof b.name === "string" && typeof b.complexity === "number" && typeof b.lineno === "number") {
-          const key = `${b.lineno}:${b.name}`;
+          const key = ``;
           out.set(key, b.complexity);
         }
killedBy: parseRadonCcJson reads function blocks with lineno name complexity
statusReason: expected undefined to be 4 // Object.is equality
