[Killed] ObjectLiteral
src/ddp/cc/radonSpawn.ts:11:78
   timeoutMs: number
 ): Promise<Map<string, number>> {
   return new Promise((resolve) => {
-    const proc = cp.spawn(pythonPath, ["-m", "radon", "cc", "-j", filePath], {
-      cwd,
-      windowsHide: true,
-    });
+    const proc = cp.spawn(pythonPath, ["-m", "radon", "cc", "-j", filePath], {});
     let stdout = "";
     let done = false;
killedBy: runRadonCc passes correct arguments to cp.spawn
statusReason: expected "vi.fn()" to be called with arguments: [ '/usr/bin/python3', …(2) ]

Received:

  1st vi.fn() call:

@@ -5,10 +5,7 @@
      "radon",

[Killed] BooleanLiteral
src/ddp/cc/radonSpawn.ts:13:20
   return new Promise((resolve) => {
     const proc = cp.spawn(pythonPath, ["-m", "radon", "cc", "-j", filePath], {
       cwd,
-      windowsHide: true,
+      windowsHide: false,
     });
     let stdout = "";
killedBy: runRadonCc passes correct arguments to cp.spawn
statusReason: expected "vi.fn()" to be called with arguments: [ '/usr/bin/python3', …(2) ]

Received:

  1st vi.fn() call:

@@ -7,8 +7,8 @@
      "-j",

[Killed] BlockStatement
src/ddp/cc/radonSpawn.ts:17:50
     });
     let stdout = "";
     let done = false;
-    const finish = (map: Map<string, number>) => {
-      if (!done) {
-        done = true;
-        resolve(map);
-      }
-    };
+    const finish = (map: Map<string, number>) => {};
     const t = setTimeout(() => {
       proc.kill();
killedBy: runRadonCc returns parsed map when radon produces valid JSON output
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/ddp/cc/radonSpawn.ts:18:18
     let stdout = "";
     let done = false;
     const finish = (map: Map<string, number>) => {
-      if (!done) {
-        done = true;
-        resolve(map);
-      }
+      if (!done) {}
     };
     const t = setTimeout(() => {
killedBy: runRadonCc returns parsed map when radon produces valid JSON output
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/ddp/cc/radonSpawn.ts:18:11
     let stdout = "";
     let done = false;
     const finish = (map: Map<string, number>) => {
-      if (!done) {
+      if (false) {
         done = true;
         resolve(map);
killedBy: runRadonCc returns parsed map when radon produces valid JSON output
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/ddp/cc/radonSpawn.ts:30:28
     proc.stdout?.on("data", (d: Buffer) => {
       stdout += d.toString();
     });
-    proc.on("close", () => {
-      clearTimeout(t);
-      finish(parseRadonCcJson(stdout, filePath));
-    });
+    proc.on("close", () => {});
     proc.on("error", () => {
       clearTimeout(t);
killedBy: runRadonCc returns parsed map when radon produces valid JSON output
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/ddp/cc/radonSpawn.ts:30:13
     proc.stdout?.on("data", (d: Buffer) => {
       stdout += d.toString();
     });
-    proc.on("close", () => {
+    proc.on("", () => {
       clearTimeout(t);
       finish(parseRadonCcJson(stdout, filePath));
killedBy: runRadonCc returns parsed map when radon produces valid JSON output
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
