[Killed] BlockStatement
src/ddp/churn/gitChurnAdapter.ts:12:36
   private readonly repoRootFs: string;
   private readonly repoRootUri: string;
 
-  constructor(repoRootUri: string) {
-    this.repoRootUri = repoRootUri.replace(/\/$/, "");
-    try {
-      this.repoRootFs = fileURLToPath(repoRootUri);
-    } catch {
-      throw new TypeError(`GitChurnAdapter: invalid repo root URI "${repoRootUri}"`);
-    }
-  }
+  constructor(repoRootUri: string) {}
 
   async getChurnCounts(since: Date): Promise<Map<string, number>> {
killedBy: GitChurnAdapter returns commit counts keyed by absolute file URI
statusReason: expected undefined to be 2 // Object.is equality

[Killed] Regex
src/ddp/churn/gitChurnAdapter.ts:13:44
   private readonly repoRootUri: string;
 
   constructor(repoRootUri: string) {
-    this.repoRootUri = repoRootUri.replace(/\/$/, "");
+    this.repoRootUri = repoRootUri.replace(/\//, "");
     try {
       this.repoRootFs = fileURLToPath(repoRootUri);
killedBy: GitChurnAdapter returns commit counts keyed by absolute file URI
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
src/ddp/churn/gitChurnAdapter.ts:14:9
 
   constructor(repoRootUri: string) {
     this.repoRootUri = repoRootUri.replace(/\/$/, "");
-    try {
-      this.repoRootFs = fileURLToPath(repoRootUri);
-    } catch {
+    try {} catch {
       throw new TypeError(`GitChurnAdapter: invalid repo root URI "${repoRootUri}"`);
     }
killedBy: GitChurnAdapter throws a descriptive error when constructed with a malformed URI
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/ddp/churn/gitChurnAdapter.ts:16:13
     this.repoRootUri = repoRootUri.replace(/\/$/, "");
     try {
       this.repoRootFs = fileURLToPath(repoRootUri);
-    } catch {
-      throw new TypeError(`GitChurnAdapter: invalid repo root URI "${repoRootUri}"`);
-    }
+    } catch {}
   }
 
killedBy: GitChurnAdapter throws a descriptive error when constructed with a malformed URI
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/ddp/churn/gitChurnAdapter.ts:21:67
     }
   }
 
-  async getChurnCounts(since: Date): Promise<Map<string, number>> {
-    const stdout = await runGitLog(this.repoRootFs, since, GIT_TIMEOUT_MS);
-    const relativeCounts = parseGitLogToChurnCounts(stdout);
-    const uriCounts = new Map<string, number>();
-    for (const [relativePath, count] of relativeCounts) {
-      // git always uses forward slashes — safe to concatenate directly with URI base
-      uriCounts.set(`${this.repoRootUri}/${relativePath}`, count);
-    }
-    return uriCounts;
-  }
+  async getChurnCounts(since: Date): Promise<Map<string, number>> {}
 }
 
killedBy: GitChurnAdapter returns commit counts keyed by absolute file URI
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/ddp/churn/gitChurnAdapter.ts:25:57
     const stdout = await runGitLog(this.repoRootFs, since, GIT_TIMEOUT_MS);
     const relativeCounts = parseGitLogToChurnCounts(stdout);
     const uriCounts = new Map<string, number>();
-    for (const [relativePath, count] of relativeCounts) {
-      // git always uses forward slashes — safe to concatenate directly with URI base
-      uriCounts.set(`${this.repoRootUri}/${relativePath}`, count);
-    }
+    for (const [relativePath, count] of relativeCounts) {}
     return uriCounts;
   }
killedBy: GitChurnAdapter returns commit counts keyed by absolute file URI
statusReason: expected undefined to be 2 // Object.is equality

[Killed] StringLiteral
src/ddp/churn/gitChurnAdapter.ts:27:21
     const uriCounts = new Map<string, number>();
     for (const [relativePath, count] of relativeCounts) {
       // git always uses forward slashes — safe to concatenate directly with URI base
-      uriCounts.set(`${this.repoRootUri}/${relativePath}`, count);
+      uriCounts.set(``, count);
     }
     return uriCounts;
killedBy: GitChurnAdapter returns commit counts keyed by absolute file URI
statusReason: expected undefined to be 2 // Object.is equality
