[Killed] BlockStatement
src/ddp/churn/gitSpawn.ts:3:94
 import * as cp from "child_process";
 
-export function runGitLog(repoRoot: string, since: Date, timeoutMs: number): Promise<string> {
-  return new Promise((resolve) => {
-    const proc = cp.spawn(
-      "git",
-      ["log", "--name-only", "--pretty=format:", `--since=${since.toISOString()}`, "--diff-filter=ACDMR"],
-      { cwd: repoRoot, windowsHide: true }
-    );
-    let stdout = "";
-    let done = false;
-    const finish = (output: string) => {
-      if (!done) {
-        done = true;
-        resolve(output);
-      }
-    };
-    const t = setTimeout(() => {
-      proc.kill();
-      finish("");
-    }, timeoutMs);
-    proc.stdout?.on("data", (d: Buffer) => { stdout += d.toString(); });
-    proc.on("close", () => { clearTimeout(t); finish(stdout); });
-    proc.on("error", () => { clearTimeout(t); finish(""); });
-  });
-}
+export function runGitLog(repoRoot: string, since: Date, timeoutMs: number): Promise<string> {}
 
killedBy: runGitLog (integration) returns non-empty output for recent history
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] BlockStatement
src/ddp/churn/gitSpawn.ts:4:35
 import * as cp from "child_process";
 
 export function runGitLog(repoRoot: string, since: Date, timeoutMs: number): Promise<string> {
-  return new Promise((resolve) => {
-    const proc = cp.spawn(
-      "git",
-      ["log", "--name-only", "--pretty=format:", `--since=${since.toISOString()}`, "--diff-filter=ACDMR"],
-      { cwd: repoRoot, windowsHide: true }
-    );
-    let stdout = "";
-    let done = false;
-    const finish = (output: string) => {
-      if (!done) {
-        done = true;
-        resolve(output);
-      }
-    };
-    const t = setTimeout(() => {
-      proc.kill();
-      finish("");
-    }, timeoutMs);
-    proc.stdout?.on("data", (d: Buffer) => { stdout += d.toString(); });
-    proc.on("close", () => { clearTimeout(t); finish(stdout); });
-    proc.on("error", () => { clearTimeout(t); finish(""); });
-  });
+  return new Promise((resolve) => {});
 }
 
killedBy: runGitLog (integration) returns non-empty output for recent history
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrayDeclaration
src/ddp/churn/gitSpawn.ts:7:7
   return new Promise((resolve) => {
     const proc = cp.spawn(
       "git",
-      ["log", "--name-only", "--pretty=format:", `--since=${since.toISOString()}`, "--diff-filter=ACDMR"],
+      [],
       { cwd: repoRoot, windowsHide: true }
     );
killedBy: runGitLog (integration) returns empty output for a date in the far future
statusReason: expected 'usage: git [-v | --version] [-h | --h…' to be '' // Object.is equality

[Killed] BooleanLiteral
src/ddp/churn/gitSpawn.ts:8:37
     const proc = cp.spawn(
       "git",
       ["log", "--name-only", "--pretty=format:", `--since=${since.toISOString()}`, "--diff-filter=ACDMR"],
-      { cwd: repoRoot, windowsHide: true }
+      { cwd: repoRoot, windowsHide: false }
     );
     let stdout = "";
killedBy: runGitLog calls git log with --name-only, --pretty=format:, and --since
statusReason: expected { cwd: '/repo', windowsHide: false } to match object { cwd: '/repo', windowsHide: true }

[Killed] BlockStatement
src/ddp/churn/gitSpawn.ts:12:40
     );
     let stdout = "";
     let done = false;
-    const finish = (output: string) => {
-      if (!done) {
-        done = true;
-        resolve(output);
-      }
-    };
+    const finish = (output: string) => {};
     const t = setTimeout(() => {
       proc.kill();
killedBy: runGitLog (integration) returns non-empty output for recent history
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/ddp/churn/gitSpawn.ts:13:18
     let stdout = "";
     let done = false;
     const finish = (output: string) => {
-      if (!done) {
-        done = true;
-        resolve(output);
-      }
+      if (!done) {}
     };
     const t = setTimeout(() => {
killedBy: runGitLog returns stdout output on successful close
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/ddp/churn/gitSpawn.ts:13:11
     let stdout = "";
     let done = false;
     const finish = (output: string) => {
-      if (!done) {
+      if (false) {
         done = true;
         resolve(output);
killedBy: runGitLog (integration) returns non-empty output for recent history
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/ddp/churn/gitSpawn.ts:18:32
         resolve(output);
       }
     };
-    const t = setTimeout(() => {
-      proc.kill();
-      finish("");
-    }, timeoutMs);
+    const t = setTimeout(() => {}, timeoutMs);
     proc.stdout?.on("data", (d: Buffer) => { stdout += d.toString(); });
     proc.on("close", () => { clearTimeout(t); finish(stdout); });
killedBy: runGitLog returns empty string on timeout and kills the process
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/ddp/churn/gitSpawn.ts:22:44
       proc.kill();
       finish("");
     }, timeoutMs);
-    proc.stdout?.on("data", (d: Buffer) => { stdout += d.toString(); });
+    proc.stdout?.on("data", (d: Buffer) => {});
     proc.on("close", () => { clearTimeout(t); finish(stdout); });
     proc.on("error", () => { clearTimeout(t); finish(""); });
killedBy: runGitLog returns stdout output on successful close
statusReason: expected '' to be '\nsrc/foo.ts\n\nsrc/bar.ts\n' // Object.is equality

[Killed] AssignmentOperator
src/ddp/churn/gitSpawn.ts:22:46
       proc.kill();
       finish("");
     }, timeoutMs);
-    proc.stdout?.on("data", (d: Buffer) => { stdout += d.toString(); });
+    proc.stdout?.on("data", (d: Buffer) => { stdout -= d.toString(); });
     proc.on("close", () => { clearTimeout(t); finish(stdout); });
     proc.on("error", () => { clearTimeout(t); finish(""); });
killedBy: runGitLog returns stdout output on successful close
statusReason: expected NaN to be '\nsrc/foo.ts\n\nsrc/bar.ts\n' // Object.is equality

[Killed] BlockStatement
src/ddp/churn/gitSpawn.ts:23:28
       finish("");
     }, timeoutMs);
     proc.stdout?.on("data", (d: Buffer) => { stdout += d.toString(); });
-    proc.on("close", () => { clearTimeout(t); finish(stdout); });
+    proc.on("close", () => {});
     proc.on("error", () => { clearTimeout(t); finish(""); });
   });
killedBy: runGitLog (integration) returns non-empty output for recent history
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/ddp/churn/gitSpawn.ts:24:28
     }, timeoutMs);
     proc.stdout?.on("data", (d: Buffer) => { stdout += d.toString(); });
     proc.on("close", () => { clearTimeout(t); finish(stdout); });
-    proc.on("error", () => { clearTimeout(t); finish(""); });
+    proc.on("error", () => {});
   });
 }
killedBy: runGitLog returns empty string when spawn emits error
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/ddp/churn/gitSpawn.ts:24:13
     }, timeoutMs);
     proc.stdout?.on("data", (d: Buffer) => { stdout += d.toString(); });
     proc.on("close", () => { clearTimeout(t); finish(stdout); });
-    proc.on("error", () => { clearTimeout(t); finish(""); });
+    proc.on("", () => { clearTimeout(t); finish(""); });
   });
 }
killedBy: runGitLog returns empty string when spawn emits error
statusReason: ENOENT
