[Killed] BlockStatement
src/ddp/codeLensProvider.ts:17:22
     private readonly getConfig: () => DdpConfiguration
   ) {}
 
-  invalidate(): void {
-    this._onDidChange.fire();
-  }
+  invalidate(): void {}
 
   async provideCodeLenses(
killedBy: DdpCodeLensProvider invalidate fires onDidChangeCodeLenses event when called
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ConditionalExpression
src/ddp/codeLensProvider.ts:25:9
     document: vscode.TextDocument,
     _token: vscode.CancellationToken
   ): Promise<vscode.CodeLens[]> {
-    if (!this.getConfig().codelensEnabled) {
+    if (false) {
       return [];
     }
killedBy: DdpCodeLensProvider provideCodeLenses returns empty array when codelensEnabled is false
statusReason: functions is not iterable

[Killed] ConditionalExpression
src/ddp/codeLensProvider.ts:25:9
     document: vscode.TextDocument,
     _token: vscode.CancellationToken
   ): Promise<vscode.CodeLens[]> {
-    if (!this.getConfig().codelensEnabled) {
+    if (true) {
       return [];
     }
killedBy: DdpCodeLensProvider provideCodeLenses returns CodeLens with correct title from formatCodeLensTitle
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrayDeclaration
src/ddp/codeLensProvider.ts:26:14
     _token: vscode.CancellationToken
   ): Promise<vscode.CodeLens[]> {
     if (!this.getConfig().codelensEnabled) {
-      return [];
+      return ["Stryker was here"];
     }
     const byId = this.state.symbolById;
killedBy: DdpCodeLensProvider provideCodeLenses returns empty array when codelensEnabled is false
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
src/ddp/codeLensProvider.ts:29:21
       return [];
     }
     const byId = this.state.symbolById;
-    if (!byId.size) {
-      return [];
-    }
+    if (!byId.size) {}
     const functions = await getFlatFunctionSymbols(document.uri);
     const lenses: vscode.CodeLens[] = [];
killedBy: DdpCodeLensProvider provideCodeLenses returns empty array when symbolById map is empty
statusReason: functions is not iterable

[Killed] ConditionalExpression
src/ddp/codeLensProvider.ts:29:9
       return [];
     }
     const byId = this.state.symbolById;
-    if (!byId.size) {
+    if (false) {
       return [];
     }
killedBy: DdpCodeLensProvider provideCodeLenses returns empty array when symbolById map is empty
statusReason: functions is not iterable

[Killed] BlockStatement
src/ddp/codeLensProvider.ts:34:33
     }
     const functions = await getFlatFunctionSymbols(document.uri);
     const lenses: vscode.CodeLens[] = [];
-    for (const fn of functions) {
-      const id = symbolIdFromUriRange(document.uri, fn.selectionRange);
-      const m = byId.get(id);
-      if (!m) {
-        continue;
-      }
-      const range = fn.selectionRange;
-      lenses.push(
-        new vscode.CodeLens(range, {
-          title: formatCodeLensTitle(m),
-          tooltip: `R=${m.r.toFixed(3)} CRAP=${m.crap.toFixed(2)} CC=${m.cc} T=${(m.t * 100).toFixed(0)}%`,
-          command: "ddp.revealSymbol",
-          arguments: [id],
-        })
-      );
-    }
+    for (const fn of functions) {}
     return lenses;
   }
killedBy: DdpCodeLensProvider provideCodeLenses returns CodeLens with correct title from formatCodeLensTitle
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
src/ddp/codeLensProvider.ts:37:11
     for (const fn of functions) {
       const id = symbolIdFromUriRange(document.uri, fn.selectionRange);
       const m = byId.get(id);
-      if (!m) {
+      if (m) {
         continue;
       }
killedBy: DdpCodeLensProvider provideCodeLenses skips functions without matching metrics in symbolById
statusReason: Cannot read properties of undefined (reading 'r')

[Killed] ConditionalExpression
src/ddp/codeLensProvider.ts:37:11
     for (const fn of functions) {
       const id = symbolIdFromUriRange(document.uri, fn.selectionRange);
       const m = byId.get(id);
-      if (!m) {
+      if (false) {
         continue;
       }
killedBy: DdpCodeLensProvider provideCodeLenses skips functions without matching metrics in symbolById
statusReason: Cannot read properties of undefined (reading 'r')

[Killed] ObjectLiteral
src/ddp/codeLensProvider.ts:42:36
       }
       const range = fn.selectionRange;
       lenses.push(
-        new vscode.CodeLens(range, {
-          title: formatCodeLensTitle(m),
-          tooltip: `R=${m.r.toFixed(3)} CRAP=${m.crap.toFixed(2)} CC=${m.cc} T=${(m.t * 100).toFixed(0)}%`,
-          command: "ddp.revealSymbol",
-          arguments: [id],
-        })
+        new vscode.CodeLens(range, {})
       );
     }
killedBy: DdpCodeLensProvider provideCodeLenses returns CodeLens with correct title from formatCodeLensTitle
statusReason: expected undefined to be 'DDP F=5  R=1.50  CRAP=3.0' // Object.is equality

[Killed] ArithmeticOperator
src/ddp/codeLensProvider.ts:44:83
       lenses.push(
         new vscode.CodeLens(range, {
           title: formatCodeLensTitle(m),
-          tooltip: `R=${m.r.toFixed(3)} CRAP=${m.crap.toFixed(2)} CC=${m.cc} T=${(m.t * 100).toFixed(0)}%`,
+          tooltip: `R=${m.r.toFixed(3)} CRAP=${m.crap.toFixed(2)} CC=${m.cc} T=${(m.t / 100).toFixed(0)}%`,
           command: "ddp.revealSymbol",
           arguments: [id],
killedBy: DdpCodeLensProvider provideCodeLenses returns CodeLens with tooltip containing R, CRAP, CC, and T values
statusReason: expected 'R=1.234 CRAP=5.67 CC=3 T=0%' to be 'R=1.234 CRAP=5.67 CC=3 T=85%' // Object.is equality

[Killed] StringLiteral
src/ddp/codeLensProvider.ts:44:20
       lenses.push(
         new vscode.CodeLens(range, {
           title: formatCodeLensTitle(m),
-          tooltip: `R=${m.r.toFixed(3)} CRAP=${m.crap.toFixed(2)} CC=${m.cc} T=${(m.t * 100).toFixed(0)}%`,
+          tooltip: ``,
           command: "ddp.revealSymbol",
           arguments: [id],
killedBy: DdpCodeLensProvider provideCodeLenses returns CodeLens with tooltip containing R, CRAP, CC, and T values
statusReason: expected '' to be 'R=1.234 CRAP=5.67 CC=3 T=85%' // Object.is equality

[Killed] ArrayDeclaration
src/ddp/codeLensProvider.ts:46:22
           title: formatCodeLensTitle(m),
           tooltip: `R=${m.r.toFixed(3)} CRAP=${m.crap.toFixed(2)} CC=${m.cc} T=${(m.t * 100).toFixed(0)}%`,
           command: "ddp.revealSymbol",
-          arguments: [id],
+          arguments: [],
         })
       );
killedBy: DdpCodeLensProvider provideCodeLenses returns CodeLens with command ddp.revealSymbol and symbol ID as argument
statusReason: expected [] to deeply equal [ 'file:///a.ts#5:0' ]
