[Survived] StringLiteral
src/ddp/configuration.ts:58:39
 };
 
 export const DEFAULT_CONFIGURATION: DdpConfiguration = {
-  coverage: { fallbackT: 0, lcovGlob: "**/coverage/lcov.info", jacocoGlob: "**/jacoco.xml" },
+  coverage: { fallbackT: 0, lcovGlob: "", jacocoGlob: "**/jacoco.xml" },
   rank: { maxIterations: 100, epsilon: 1e-6 },
   cc: {

[Survived] StringLiteral
src/ddp/configuration.ts:58:76
 };
 
 export const DEFAULT_CONFIGURATION: DdpConfiguration = {
-  coverage: { fallbackT: 0, lcovGlob: "**/coverage/lcov.info", jacocoGlob: "**/jacoco.xml" },
+  coverage: { fallbackT: 0, lcovGlob: "**/coverage/lcov.info", jacocoGlob: "" },
   rank: { maxIterations: 100, epsilon: 1e-6 },
   cc: {

[Survived] ObjectLiteral
src/ddp/configuration.ts:60:7
 export const DEFAULT_CONFIGURATION: DdpConfiguration = {
   coverage: { fallbackT: 0, lcovGlob: "**/coverage/lcov.info", jacocoGlob: "**/jacoco.xml" },
   rank: { maxIterations: 100, epsilon: 1e-6 },
-  cc: {
-    eslintPath: "eslint",
-    pythonPath: "python",
-    pmdPath: "pmd",
-    useEslintForTsJs: true,
-  },
+  cc: {},
   decoration: { warnThreshold: 50, errorThreshold: 150 },
   churn: { enabled: false, lookbackDays: 90 },

[Survived] StringLiteral
src/ddp/configuration.ts:61:17
   coverage: { fallbackT: 0, lcovGlob: "**/coverage/lcov.info", jacocoGlob: "**/jacoco.xml" },
   rank: { maxIterations: 100, epsilon: 1e-6 },
   cc: {
-    eslintPath: "eslint",
+    eslintPath: "",
     pythonPath: "python",
     pmdPath: "pmd",

[Survived] BooleanLiteral
src/ddp/configuration.ts:64:23
     eslintPath: "eslint",
     pythonPath: "python",
     pmdPath: "pmd",
-    useEslintForTsJs: true,
+    useEslintForTsJs: false,
   },
   decoration: { warnThreshold: 50, errorThreshold: 150 },

[Survived] BooleanLiteral
src/ddp/configuration.ts:67:21
     useEslintForTsJs: true,
   },
   decoration: { warnThreshold: 50, errorThreshold: 150 },
-  churn: { enabled: false, lookbackDays: 90 },
+  churn: { enabled: true, lookbackDays: 90 },
   fileRollup: "max",
   codelensEnabled: true,

[Survived] BooleanLiteral
src/ddp/configuration.ts:69:20
   decoration: { warnThreshold: 50, errorThreshold: 150 },
   churn: { enabled: false, lookbackDays: 90 },
   fileRollup: "max",
-  codelensEnabled: true,
+  codelensEnabled: false,
   excludeTests: true,
   maxFiles: 400,

[Survived] BooleanLiteral
src/ddp/configuration.ts:70:17
   churn: { enabled: false, lookbackDays: 90 },
   fileRollup: "max",
   codelensEnabled: true,
-  excludeTests: true,
+  excludeTests: false,
   maxFiles: 400,
 };

[Killed] StringLiteral
src/ddp/configuration.ts:80:30
 ): DdpConfiguration {
   return {
     coverage: {
-      fallbackT: get<number>("coverage.fallbackT", DEFAULT_CONFIGURATION.coverage.fallbackT),
+      fallbackT: get<number>("", DEFAULT_CONFIGURATION.coverage.fallbackT),
       lcovGlob: get<string>("coverage.lcovGlob", DEFAULT_CONFIGURATION.coverage.lcovGlob),
       jacocoGlob: get<string>("coverage.jacocoGlob", DEFAULT_CONFIGURATION.coverage.jacocoGlob),
killedBy: buildConfiguration reads overridden values from getter
statusReason: expected +0 to be 0.5 // Object.is equality

[Killed] StringLiteral
src/ddp/configuration.ts:82:31
     coverage: {
       fallbackT: get<number>("coverage.fallbackT", DEFAULT_CONFIGURATION.coverage.fallbackT),
       lcovGlob: get<string>("coverage.lcovGlob", DEFAULT_CONFIGURATION.coverage.lcovGlob),
-      jacocoGlob: get<string>("coverage.jacocoGlob", DEFAULT_CONFIGURATION.coverage.jacocoGlob),
+      jacocoGlob: get<string>("", DEFAULT_CONFIGURATION.coverage.jacocoGlob),
     },
     rank: {
killedBy: buildConfiguration returns correct values when all fields are overridden
statusReason: expected { coverage: { …(3) }, …(8) } to deeply equal { coverage: { …(3) }, …(8) }

[Killed] ObjectLiteral
src/ddp/configuration.ts:84:11
       lcovGlob: get<string>("coverage.lcovGlob", DEFAULT_CONFIGURATION.coverage.lcovGlob),
       jacocoGlob: get<string>("coverage.jacocoGlob", DEFAULT_CONFIGURATION.coverage.jacocoGlob),
     },
-    rank: {
-      maxIterations: get<number>("rank.maxIterations", DEFAULT_CONFIGURATION.rank.maxIterations),
-      epsilon: get<number>("rank.epsilon", DEFAULT_CONFIGURATION.rank.epsilon),
-    },
+    rank: {},
     cc: {
       eslintPath: get<string>("cc.eslintPath", DEFAULT_CONFIGURATION.cc.eslintPath),
killedBy: buildConfiguration returns defaults when getter returns defaults
statusReason: expected { …(9) } to deeply equal { …(9) }

[Killed] StringLiteral
src/ddp/configuration.ts:86:28
     },
     rank: {
       maxIterations: get<number>("rank.maxIterations", DEFAULT_CONFIGURATION.rank.maxIterations),
-      epsilon: get<number>("rank.epsilon", DEFAULT_CONFIGURATION.rank.epsilon),
+      epsilon: get<number>("", DEFAULT_CONFIGURATION.rank.epsilon),
     },
     cc: {
killedBy: buildConfiguration returns correct values when all fields are overridden
statusReason: expected { coverage: { …(3) }, …(8) } to deeply equal { coverage: { …(3) }, …(8) }

[Killed] StringLiteral
src/ddp/configuration.ts:92:38
       eslintPath: get<string>("cc.eslintPath", DEFAULT_CONFIGURATION.cc.eslintPath),
       pythonPath: get<string>("cc.pythonPath", DEFAULT_CONFIGURATION.cc.pythonPath),
       pmdPath: get<string>("cc.pmdPath", DEFAULT_CONFIGURATION.cc.pmdPath),
-      useEslintForTsJs: get<boolean>("cc.useEslintForTsJs", DEFAULT_CONFIGURATION.cc.useEslintForTsJs),
+      useEslintForTsJs: get<boolean>("", DEFAULT_CONFIGURATION.cc.useEslintForTsJs),
     },
     decoration: {
killedBy: buildConfiguration returns correct values when all fields are overridden
statusReason: expected { coverage: { …(3) }, …(8) } to deeply equal { coverage: { …(3) }, …(8) }

[Killed] StringLiteral
src/ddp/configuration.ts:95:34
       useEslintForTsJs: get<boolean>("cc.useEslintForTsJs", DEFAULT_CONFIGURATION.cc.useEslintForTsJs),
     },
     decoration: {
-      warnThreshold: get<number>("decoration.warnThreshold", DEFAULT_CONFIGURATION.decoration.warnThreshold),
+      warnThreshold: get<number>("", DEFAULT_CONFIGURATION.decoration.warnThreshold),
       errorThreshold: get<number>("decoration.errorThreshold", DEFAULT_CONFIGURATION.decoration.errorThreshold),
     },
killedBy: buildConfiguration returns correct values when all fields are overridden
statusReason: expected { coverage: { …(3) }, …(8) } to deeply equal { coverage: { …(3) }, …(8) }

[Survived] StringLiteral
src/ddp/configuration.ts:111:29
 
 /** Default glob for source files to analyze. */
 export const SOURCE_FILE_GLOB = "**/*.{ts,tsx,js,jsx,mjs,cjs,py,java}";
-export const EXCLUDE_GLOB = "**/node_modules/**";
+export const EXCLUDE_GLOB = "";
 
 /** Test-file name pattern: matches .test. or .spec. before the final extension. */

[Survived] Regex
src/ddp/configuration.ts:114:22
 export const EXCLUDE_GLOB = "**/node_modules/**";
 
 /** Test-file name pattern: matches .test. or .spec. before the final extension. */
-const TEST_FILE_RE = /\.(?:test|spec)\.[^/\\]+$/i;
+const TEST_FILE_RE = /\.(?:test|spec)\.[^/\\]$/i;
 
 /** Java convention: class name ending in Test/Tests/IT before the extension. */

[Survived] Regex
src/ddp/configuration.ts:117:22
 const TEST_FILE_RE = /\.(?:test|spec)\.[^/\\]+$/i;
 
 /** Java convention: class name ending in Test/Tests/IT before the extension. */
-const JAVA_TEST_RE = /(?:Test|Tests|IT)\.[^/\\]+$/;
+const JAVA_TEST_RE = /(?:Test|Tests|IT)\.[^/\\]+/;
 
 /** Test-directory segments that indicate a test folder. */

[Survived] Regex
src/ddp/configuration.ts:117:22
 const TEST_FILE_RE = /\.(?:test|spec)\.[^/\\]+$/i;
 
 /** Java convention: class name ending in Test/Tests/IT before the extension. */
-const JAVA_TEST_RE = /(?:Test|Tests|IT)\.[^/\\]+$/;
+const JAVA_TEST_RE = /(?:Test|Tests|IT)\.[^/\\]$/;
 
 /** Test-directory segments that indicate a test folder. */

[Survived] Regex
src/ddp/configuration.ts:120:21
 const JAVA_TEST_RE = /(?:Test|Tests|IT)\.[^/\\]+$/;
 
 /** Test-directory segments that indicate a test folder. */
-const TEST_DIR_RE = /(?:^|[/\\])(?:__tests__|tests?|test_[^/\\]+)(?:[/\\]|$)/i;
+const TEST_DIR_RE = /(?:^|[/\\])(?:__tests__|tests?|test_[/\\]+)(?:[/\\]|$)/i;
 
 /**

[Survived] Regex
src/ddp/configuration.ts:120:21
 const JAVA_TEST_RE = /(?:Test|Tests|IT)\.[^/\\]+$/;
 
 /** Test-directory segments that indicate a test folder. */
-const TEST_DIR_RE = /(?:^|[/\\])(?:__tests__|tests?|test_[^/\\]+)(?:[/\\]|$)/i;
+const TEST_DIR_RE = /(?:[/\\])(?:__tests__|tests?|test_[^/\\]+)(?:[/\\]|$)/i;
 
 /**

[Killed] BlockStatement
src/ddp/configuration.ts:126:53
  * Pure check: does a URI (or file path) look like a test file?
  * Matches common conventions across JS/TS/Python/Java.
  */
-export function isTestFileUri(uri: string): boolean {
-  return TEST_FILE_RE.test(uri) || JAVA_TEST_RE.test(uri) || TEST_DIR_RE.test(uri);
-}
+export function isTestFileUri(uri: string): boolean {}
 
killedBy: collectCallEdgesFromWorkspace test file filtering filters out test files and slices to maxFiles when excludeTests is true
statusReason: expected [ 'file:///src/app.ts', …(3) ] to not include 'file:///src/app.test.ts'

[Killed] LogicalOperator
src/ddp/configuration.ts:127:10
  * Matches common conventions across JS/TS/Python/Java.
  */
 export function isTestFileUri(uri: string): boolean {
-  return TEST_FILE_RE.test(uri) || JAVA_TEST_RE.test(uri) || TEST_DIR_RE.test(uri);
+  return (TEST_FILE_RE.test(uri) || JAVA_TEST_RE.test(uri)) && TEST_DIR_RE.test(uri);
 }
 
killedBy: collectCallEdgesFromWorkspace test file filtering filters out test files and slices to maxFiles when excludeTests is true
statusReason: expected [ 'file:///src/app.ts', …(3) ] to not include 'file:///src/app.test.ts'

[Killed] LogicalOperator
src/ddp/configuration.ts:127:10
  * Matches common conventions across JS/TS/Python/Java.
  */
 export function isTestFileUri(uri: string): boolean {
-  return TEST_FILE_RE.test(uri) || JAVA_TEST_RE.test(uri) || TEST_DIR_RE.test(uri);
+  return TEST_FILE_RE.test(uri) && JAVA_TEST_RE.test(uri) || TEST_DIR_RE.test(uri);
 }
 
killedBy: test-file exclusion excludes test files from results when excludeTests is true
statusReason: expected [ …(2) ] to not include 'file:///project/src/service.test.ts'
