[Survived] BooleanLiteral
src/ddp/decorationManager.ts:8:18
 
 export class DecorationManager {
   private readonly warnDeco = vscode.window.createTextEditorDecorationType({
-    isWholeLine: true,
+    isWholeLine: false,
     backgroundColor: "rgba(255, 200, 0, 0.12)",
   });

[Survived] StringLiteral
src/ddp/decorationManager.ts:9:22
 export class DecorationManager {
   private readonly warnDeco = vscode.window.createTextEditorDecorationType({
     isWholeLine: true,
-    backgroundColor: "rgba(255, 200, 0, 0.12)",
+    backgroundColor: "",
   });
   private readonly errorDeco = vscode.window.createTextEditorDecorationType({

[Survived] ObjectLiteral
src/ddp/decorationManager.ts:11:77
     isWholeLine: true,
     backgroundColor: "rgba(255, 200, 0, 0.12)",
   });
-  private readonly errorDeco = vscode.window.createTextEditorDecorationType({
-    isWholeLine: true,
-    backgroundColor: "rgba(255, 80, 80, 0.15)",
-  });
+  private readonly errorDeco = vscode.window.createTextEditorDecorationType({});
 
   constructor(

[Survived] BooleanLiteral
src/ddp/decorationManager.ts:12:18
     backgroundColor: "rgba(255, 200, 0, 0.12)",
   });
   private readonly errorDeco = vscode.window.createTextEditorDecorationType({
-    isWholeLine: true,
+    isWholeLine: false,
     backgroundColor: "rgba(255, 80, 80, 0.15)",
   });

[Killed] BlockStatement
src/ddp/decorationManager.ts:21:19
     private readonly getDecoConfig: () => DecorationConfig
   ) {}
 
-  dispose(): void {
-    this.warnDeco.dispose();
-    this.errorDeco.dispose();
-  }
+  dispose(): void {}
 
   applyActiveEditor(editor: vscode.TextEditor | undefined): void {
killedBy: DecorationManager dispose disposes both warn and error decoration types
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] OptionalChaining
src/ddp/decorationManager.ts:27:10
   }
 
   applyActiveEditor(editor: vscode.TextEditor | undefined): void {
-    if (!editor?.document) {
+    if (!editor.document) {
       return;
     }
killedBy: DecorationManager applyActiveEditor — early returns returns without setting decorations when editor is undefined
statusReason: Cannot read properties of undefined (reading 'document')

[Killed] BlockStatement
src/ddp/decorationManager.ts:27:28
   }
 
   applyActiveEditor(editor: vscode.TextEditor | undefined): void {
-    if (!editor?.document) {
-      return;
-    }
+    if (!editor?.document) {}
     const uri = editor.document.uri.toString();
     const analysis = this.state.lastAnalysis;
killedBy: DecorationManager applyActiveEditor — early returns returns without setting decorations when editor is undefined
statusReason: Cannot read properties of undefined (reading 'document')

[Killed] OptionalChaining
src/ddp/decorationManager.ts:32:18
     }
     const uri = editor.document.uri.toString();
     const analysis = this.state.lastAnalysis;
-    const maxF = analysis?.fileRollup.get(uri);
+    const maxF = analysis.fileRollup.get(uri);
     if (maxF === undefined) {
       editor.setDecorations(this.warnDeco, []);
killedBy: DecorationManager applyActiveEditor — clears decorations clears both decorations when lastAnalysis is undefined
statusReason: Cannot read properties of undefined (reading 'fileRollup')

[Killed] EqualityOperator
src/ddp/decorationManager.ts:33:9
     const uri = editor.document.uri.toString();
     const analysis = this.state.lastAnalysis;
     const maxF = analysis?.fileRollup.get(uri);
-    if (maxF === undefined) {
+    if (maxF !== undefined) {
       editor.setDecorations(this.warnDeco, []);
       editor.setDecorations(this.errorDeco, []);
killedBy: DecorationManager applyActiveEditor — clears decorations clears both decorations when lastAnalysis is undefined
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      undefined,

[Killed] BlockStatement
src/ddp/decorationManager.ts:33:29
     const uri = editor.document.uri.toString();
     const analysis = this.state.lastAnalysis;
     const maxF = analysis?.fileRollup.get(uri);
-    if (maxF === undefined) {
-      editor.setDecorations(this.warnDeco, []);
-      editor.setDecorations(this.errorDeco, []);
-      return;
-    }
+    if (maxF === undefined) {}
     const decoConfig = this.getDecoConfig();
     const tier = decorationTier(maxF, decoConfig.warnThreshold, decoConfig.errorThreshold);
killedBy: DecorationManager applyActiveEditor — clears decorations clears both decorations when lastAnalysis is undefined
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      undefined,

[Killed] ArrayDeclaration
src/ddp/decorationManager.ts:34:44
     const analysis = this.state.lastAnalysis;
     const maxF = analysis?.fileRollup.get(uri);
     if (maxF === undefined) {
-      editor.setDecorations(this.warnDeco, []);
+      editor.setDecorations(this.warnDeco, ["Stryker was here"]);
       editor.setDecorations(this.errorDeco, []);
       return;
killedBy: DecorationManager applyActiveEditor — URI matching does not match when URI differs by case or encoding
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ArrayDeclaration
src/ddp/decorationManager.ts:35:45
     const maxF = analysis?.fileRollup.get(uri);
     if (maxF === undefined) {
       editor.setDecorations(this.warnDeco, []);
-      editor.setDecorations(this.errorDeco, []);
+      editor.setDecorations(this.errorDeco, ["Stryker was here"]);
       return;
     }
killedBy: DecorationManager applyActiveEditor — URI matching does not match when URI differs by case or encoding
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ConditionalExpression
src/ddp/decorationManager.ts:41:9
     const decoConfig = this.getDecoConfig();
     const tier = decorationTier(maxF, decoConfig.warnThreshold, decoConfig.errorThreshold);
     const full = [fullDocumentRange(editor.document)];
-    if (tier === "error") {
+    if (false) {
       editor.setDecorations(this.warnDeco, []);
       editor.setDecorations(this.errorDeco, full);
killedBy: DecorationManager applyActiveEditor — applies tier-based decoration sets error decoration and clears warn when tier is error
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/ddp/decorationManager.ts:41:9
     const decoConfig = this.getDecoConfig();
     const tier = decorationTier(maxF, decoConfig.warnThreshold, decoConfig.errorThreshold);
     const full = [fullDocumentRange(editor.document)];
-    if (tier === "error") {
+    if (true) {
       editor.setDecorations(this.warnDeco, []);
       editor.setDecorations(this.errorDeco, full);
killedBy: DecorationManager applyActiveEditor — applies tier-based decoration clears both decorations when tier is none
statusReason: expected [ Range{ startLine: +0, …(3) } ] to deeply equal []

[Killed] EqualityOperator
src/ddp/decorationManager.ts:44:16
     if (tier === "error") {
       editor.setDecorations(this.warnDeco, []);
       editor.setDecorations(this.errorDeco, full);
-    } else if (tier === "warn") {
+    } else if (tier !== "warn") {
       editor.setDecorations(this.errorDeco, []);
       editor.setDecorations(this.warnDeco, full);
killedBy: DecorationManager applyActiveEditor — applies tier-based decoration sets warn decoration and clears error when tier is warn
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/ddp/decorationManager.ts:44:33
     if (tier === "error") {
       editor.setDecorations(this.warnDeco, []);
       editor.setDecorations(this.errorDeco, full);
-    } else if (tier === "warn") {
-      editor.setDecorations(this.errorDeco, []);
-      editor.setDecorations(this.warnDeco, full);
-    } else {
+    } else if (tier === "warn") {} else {
       editor.setDecorations(this.warnDeco, []);
       editor.setDecorations(this.errorDeco, []);
killedBy: DecorationManager applyActiveEditor — applies tier-based decoration sets warn decoration and clears error when tier is warn
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] BlockStatement
src/ddp/decorationManager.ts:47:12
     } else if (tier === "warn") {
       editor.setDecorations(this.errorDeco, []);
       editor.setDecorations(this.warnDeco, full);
-    } else {
-      editor.setDecorations(this.warnDeco, []);
-      editor.setDecorations(this.errorDeco, []);
-    }
+    } else {}
   }
 }
killedBy: DecorationManager applyActiveEditor — applies tier-based decoration clears both decorations when tier is none
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] ArrayDeclaration
src/ddp/decorationManager.ts:48:44
       editor.setDecorations(this.errorDeco, []);
       editor.setDecorations(this.warnDeco, full);
     } else {
-      editor.setDecorations(this.warnDeco, []);
+      editor.setDecorations(this.warnDeco, ["Stryker was here"]);
       editor.setDecorations(this.errorDeco, []);
     }
killedBy: DecorationManager applyActiveEditor — applies tier-based decoration clears both decorations when tier is none
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
src/ddp/decorationManager.ts:54:68
   }
 }
 
-function fullDocumentRange(doc: vscode.TextDocument): vscode.Range {
-  if (doc.lineCount === 0) {
-    return new vscode.Range(0, 0, 0, 0);
-  }
-  const last = doc.lineCount - 1;
-  return new vscode.Range(0, 0, last, doc.lineAt(last).text.length);
-}
+function fullDocumentRange(doc: vscode.TextDocument): vscode.Range {}
 
killedBy: DecorationManager applyActiveEditor — full document range passes range spanning entire document to setDecorations
statusReason: Cannot read properties of undefined (reading 'startLine')

[Killed] EqualityOperator
src/ddp/decorationManager.ts:55:7
 }
 
 function fullDocumentRange(doc: vscode.TextDocument): vscode.Range {
-  if (doc.lineCount === 0) {
+  if (doc.lineCount !== 0) {
     return new vscode.Range(0, 0, 0, 0);
   }
killedBy: DecorationManager applyActiveEditor — full document range passes range spanning entire document to setDecorations
statusReason: expected +0 to be 4 // Object.is equality

[Killed] BlockStatement
src/ddp/decorationManager.ts:55:28
 }
 
 function fullDocumentRange(doc: vscode.TextDocument): vscode.Range {
-  if (doc.lineCount === 0) {
-    return new vscode.Range(0, 0, 0, 0);
-  }
+  if (doc.lineCount === 0) {}
   const last = doc.lineCount - 1;
   return new vscode.Range(0, 0, last, doc.lineAt(last).text.length);
killedBy: DecorationManager fullDocumentRange — edge cases returns Range(0,0,0,0) when document has lineCount 0
statusReason: expected -1 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/ddp/decorationManager.ts:58:16
   if (doc.lineCount === 0) {
     return new vscode.Range(0, 0, 0, 0);
   }
-  const last = doc.lineCount - 1;
+  const last = doc.lineCount + 1;
   return new vscode.Range(0, 0, last, doc.lineAt(last).text.length);
 }
killedBy: DecorationManager applyActiveEditor — full document range passes range spanning entire document to setDecorations
statusReason: expected 6 to be 4 // Object.is equality
