[Killed] ArrayDeclaration
src/ddp/documentSymbols.ts:6:34
 /** Flatten document symbols: functions, methods, constructors. */
 export function flattenFunctionSymbols(
   symbols: readonly vscode.DocumentSymbol[],
-  out: vscode.DocumentSymbol[] = []
+  out: vscode.DocumentSymbol[] = ["Stryker was here"]
 ): vscode.DocumentSymbol[] {
   for (const s of symbols) {
killedBy: collectCallEdgesFromWorkspace test file filtering filters out test files and slices to maxFiles when excludeTests is true
statusReason: Cannot read properties of undefined (reading 'start')

[Killed] BlockStatement
src/ddp/documentSymbols.ts:7:28
 export function flattenFunctionSymbols(
   symbols: readonly vscode.DocumentSymbol[],
   out: vscode.DocumentSymbol[] = []
-): vscode.DocumentSymbol[] {
-  for (const s of symbols) {
-    if (
-      s.kind === vscode.SymbolKind.Function ||
-      s.kind === vscode.SymbolKind.Method ||
-      s.kind === vscode.SymbolKind.Constructor
-    ) {
-      out.push(s);
-    }
-    if (s.children?.length) {
-      flattenFunctionSymbols(s.children, out);
-    }
-  }
-  return out;
-}
+): vscode.DocumentSymbol[] {}
 
 export function isFunctionLike(kind: vscode.SymbolKind): boolean {
killedBy: collectCallEdgesFromWorkspace test file filtering filters out test files and slices to maxFiles when excludeTests is true
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/ddp/documentSymbols.ts:8:28
   symbols: readonly vscode.DocumentSymbol[],
   out: vscode.DocumentSymbol[] = []
 ): vscode.DocumentSymbol[] {
-  for (const s of symbols) {
-    if (
-      s.kind === vscode.SymbolKind.Function ||
-      s.kind === vscode.SymbolKind.Method ||
-      s.kind === vscode.SymbolKind.Constructor
-    ) {
-      out.push(s);
-    }
-    if (s.children?.length) {
-      flattenFunctionSymbols(s.children, out);
-    }
-  }
+  for (const s of symbols) {}
   return out;
 }
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] LogicalOperator
src/ddp/documentSymbols.ts:10:7
 ): vscode.DocumentSymbol[] {
   for (const s of symbols) {
     if (
-      s.kind === vscode.SymbolKind.Function ||
-      s.kind === vscode.SymbolKind.Method ||
+      s.kind === vscode.SymbolKind.Function && s.kind === vscode.SymbolKind.Method ||
       s.kind === vscode.SymbolKind.Constructor
     ) {
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] EqualityOperator
src/ddp/documentSymbols.ts:10:7
 ): vscode.DocumentSymbol[] {
   for (const s of symbols) {
     if (
-      s.kind === vscode.SymbolKind.Function ||
+      s.kind !== vscode.SymbolKind.Function ||
       s.kind === vscode.SymbolKind.Method ||
       s.kind === vscode.SymbolKind.Constructor
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] ConditionalExpression
src/ddp/documentSymbols.ts:11:7
   for (const s of symbols) {
     if (
       s.kind === vscode.SymbolKind.Function ||
-      s.kind === vscode.SymbolKind.Method ||
+      false ||
       s.kind === vscode.SymbolKind.Constructor
     ) {
killedBy: collectCallEdgesFromWorkspace edge cases only extracts Function, Method, and Constructor symbols
statusReason: expected "vi.fn()" to be called 3 times, but got 2 times

[Killed] EqualityOperator
src/ddp/documentSymbols.ts:11:7
   for (const s of symbols) {
     if (
       s.kind === vscode.SymbolKind.Function ||
-      s.kind === vscode.SymbolKind.Method ||
+      s.kind !== vscode.SymbolKind.Method ||
       s.kind === vscode.SymbolKind.Constructor
     ) {
killedBy: collectCallEdgesFromWorkspace edge cases only extracts Function, Method, and Constructor symbols
statusReason: expected "vi.fn()" to be called 3 times, but got 4 times

[Killed] ConditionalExpression
src/ddp/documentSymbols.ts:12:7
     if (
       s.kind === vscode.SymbolKind.Function ||
       s.kind === vscode.SymbolKind.Method ||
-      s.kind === vscode.SymbolKind.Constructor
+      false
     ) {
       out.push(s);
killedBy: collectCallEdgesFromWorkspace edge cases only extracts Function, Method, and Constructor symbols
statusReason: expected "vi.fn()" to be called 3 times, but got 2 times

[Killed] EqualityOperator
src/ddp/documentSymbols.ts:12:7
     if (
       s.kind === vscode.SymbolKind.Function ||
       s.kind === vscode.SymbolKind.Method ||
-      s.kind === vscode.SymbolKind.Constructor
+      s.kind !== vscode.SymbolKind.Constructor
     ) {
       out.push(s);
killedBy: collectCallEdgesFromWorkspace edge cases only extracts Function, Method, and Constructor symbols
statusReason: expected "vi.fn()" to be called 3 times, but got 4 times

[Killed] BlockStatement
src/ddp/documentSymbols.ts:13:7
       s.kind === vscode.SymbolKind.Function ||
       s.kind === vscode.SymbolKind.Method ||
       s.kind === vscode.SymbolKind.Constructor
-    ) {
-      out.push(s);
-    }
+    ) {}
     if (s.children?.length) {
       flattenFunctionSymbols(s.children, out);
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] BlockStatement
src/ddp/documentSymbols.ts:16:29
     ) {
       out.push(s);
     }
-    if (s.children?.length) {
-      flattenFunctionSymbols(s.children, out);
-    }
+    if (s.children?.length) {}
   }
   return out;
killedBy: collectCallEdgesFromWorkspace edge cases handles nested function symbols inside classes
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] OptionalChaining
src/ddp/documentSymbols.ts:16:9
     ) {
       out.push(s);
     }
-    if (s.children?.length) {
+    if (s.children.length) {
       flattenFunctionSymbols(s.children, out);
     }
killedBy: flattenFunctionSymbols handles symbols with undefined children
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/ddp/documentSymbols.ts:23:66
   return out;
 }
 
-export function isFunctionLike(kind: vscode.SymbolKind): boolean {
-  return (
-    kind === vscode.SymbolKind.Function ||
-    kind === vscode.SymbolKind.Method ||
-    kind === vscode.SymbolKind.Constructor
-  );
-}
+export function isFunctionLike(kind: vscode.SymbolKind): boolean {}
 
 /** Fetch and flatten function symbols for a document URI via the VS Code symbol provider. */
killedBy: isFunctionLike returns true for Function kind
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/ddp/documentSymbols.ts:25:5
 
 export function isFunctionLike(kind: vscode.SymbolKind): boolean {
   return (
-    kind === vscode.SymbolKind.Function ||
-    kind === vscode.SymbolKind.Method ||
-    kind === vscode.SymbolKind.Constructor
+    false
   );
 }
killedBy: isFunctionLike returns true for Function kind
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ddp/documentSymbols.ts:25:5
 
 export function isFunctionLike(kind: vscode.SymbolKind): boolean {
   return (
-    kind === vscode.SymbolKind.Function ||
-    kind === vscode.SymbolKind.Method ||
+    false ||
     kind === vscode.SymbolKind.Constructor
   );
killedBy: isFunctionLike returns true for Function kind
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ddp/documentSymbols.ts:26:5
 export function isFunctionLike(kind: vscode.SymbolKind): boolean {
   return (
     kind === vscode.SymbolKind.Function ||
-    kind === vscode.SymbolKind.Method ||
+    false ||
     kind === vscode.SymbolKind.Constructor
   );
killedBy: isFunctionLike returns true for Method kind
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/ddp/documentSymbols.ts:26:5
 export function isFunctionLike(kind: vscode.SymbolKind): boolean {
   return (
     kind === vscode.SymbolKind.Function ||
-    kind === vscode.SymbolKind.Method ||
+    kind !== vscode.SymbolKind.Method ||
     kind === vscode.SymbolKind.Constructor
   );
killedBy: isFunctionLike returns true for Method kind
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/ddp/documentSymbols.ts:27:5
   return (
     kind === vscode.SymbolKind.Function ||
     kind === vscode.SymbolKind.Method ||
-    kind === vscode.SymbolKind.Constructor
+    kind !== vscode.SymbolKind.Constructor
   );
 }
killedBy: isFunctionLike returns true for Constructor kind
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ddp/documentSymbols.ts:27:5
   return (
     kind === vscode.SymbolKind.Function ||
     kind === vscode.SymbolKind.Method ||
-    kind === vscode.SymbolKind.Constructor
+    false
   );
 }
killedBy: isFunctionLike returns true for Constructor kind
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/ddp/documentSymbols.ts:32:97
 }
 
 /** Fetch and flatten function symbols for a document URI via the VS Code symbol provider. */
-export async function getFlatFunctionSymbols(uri: vscode.Uri): Promise<vscode.DocumentSymbol[]> {
-  let syms: vscode.DocumentSymbol[] | undefined;
-  try {
-    syms = await vscode.commands.executeCommand<vscode.DocumentSymbol[]>(
-      "vscode.executeDocumentSymbolProvider",
-      uri
-    );
-  } catch (e) {
-    console.debug(`[DDP] executeDocumentSymbolProvider failed for ${uri.toString()}:`, e);
-  }
-  return syms?.length ? flattenFunctionSymbols(syms) : [];
-}
+export async function getFlatFunctionSymbols(uri: vscode.Uri): Promise<vscode.DocumentSymbol[]> {}
 
killedBy: getFlatFunctionSymbols returns flattened function symbols when provider succeeds
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/ddp/documentSymbols.ts:34:7
 /** Fetch and flatten function symbols for a document URI via the VS Code symbol provider. */
 export async function getFlatFunctionSymbols(uri: vscode.Uri): Promise<vscode.DocumentSymbol[]> {
   let syms: vscode.DocumentSymbol[] | undefined;
-  try {
-    syms = await vscode.commands.executeCommand<vscode.DocumentSymbol[]>(
-      "vscode.executeDocumentSymbolProvider",
-      uri
-    );
-  } catch (e) {
+  try {} catch (e) {
     console.debug(`[DDP] executeDocumentSymbolProvider failed for ${uri.toString()}:`, e);
   }
killedBy: getFlatFunctionSymbols returns flattened function symbols when provider succeeds
statusReason: expected [] to deeply equal [ 'doIt' ]

[Survived] BlockStatement
src/ddp/documentSymbols.ts:39:15
       "vscode.executeDocumentSymbolProvider",
       uri
     );
-  } catch (e) {
-    console.debug(`[DDP] executeDocumentSymbolProvider failed for ${uri.toString()}:`, e);
-  }
+  } catch (e) {}
   return syms?.length ? flattenFunctionSymbols(syms) : [];
 }

[Killed] OptionalChaining
src/ddp/documentSymbols.ts:42:10
   } catch (e) {
     console.debug(`[DDP] executeDocumentSymbolProvider failed for ${uri.toString()}:`, e);
   }
-  return syms?.length ? flattenFunctionSymbols(syms) : [];
+  return syms.length ? flattenFunctionSymbols(syms) : [];
 }
 
killedBy: getFlatFunctionSymbols returns empty array when provider returns undefined
statusReason: Cannot read properties of undefined (reading 'length')
