[Killed] BlockStatement
src/ddp/editor.ts:3:94
 import * as vscode from "vscode";
 
-export async function openDocument(uri: vscode.Uri, selection?: vscode.Range): Promise<void> {
-  const doc = await vscode.workspace.openTextDocument(uri);
-  await vscode.window.showTextDocument(doc, selection ? { selection } : {});
-}
+export async function openDocument(uri: vscode.Uri, selection?: vscode.Range): Promise<void> {}
 
killedBy: revealSymbolById valid id with line and character opens document and shows it with selection for valid id
statusReason: expected "vi.fn()" to be called with arguments: [ { …(2) } ]

Number of calls: 0
