[Killed] BlockStatement
src/ddp/extensionState.ts:11:50
   private _byId = new Map<string, SymbolMetrics>();
   private _scope: AnalysisScope | undefined;
 
-  get lastAnalysis(): AnalysisResult | undefined {
-    return this._last;
-  }
+  get lastAnalysis(): AnalysisResult | undefined {}
 
   /** Lookup symbol metrics by ID. Rebuilt on each analysis update. */
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: expected [ undefined ] to deeply equal [ Array(3) ]

[Killed] BlockStatement
src/ddp/extensionState.ts:16:56
   }
 
   /** Lookup symbol metrics by ID. Rebuilt on each analysis update. */
-  get symbolById(): ReadonlyMap<string, SymbolMetrics> {
-    return this._byId;
-  }
+  get symbolById(): ReadonlyMap<string, SymbolMetrics> {}
 
   get analysisGeneration(): number {
killedBy: ExtensionState initial state returns empty map for symbolById before any setAnalysis call
statusReason: Cannot read properties of undefined (reading 'size')

[Killed] BlockStatement
src/ddp/extensionState.ts:20:36
     return this._byId;
   }
 
-  get analysisGeneration(): number {
-    return this._seq;
-  }
+  get analysisGeneration(): number {}
 
   get lastScope(): AnalysisScope | undefined {
killedBy: ExtensionState initial state returns 0 for analysisGeneration before any setAnalysis call
statusReason: expected undefined to deeply equal +0

[Killed] BlockStatement
src/ddp/extensionState.ts:24:46
     return this._seq;
   }
 
-  get lastScope(): AnalysisScope | undefined {
-    return this._scope;
-  }
+  get lastScope(): AnalysisScope | undefined {}
 
   setAnalysis(result: AnalysisResult | undefined, scope?: AnalysisScope): void {
killedBy: AnalyzeCommand scope storage stores the scope in state when a folder analysis succeeds
statusReason: expected undefined to deeply equal { rootUri: 'file:///c%3A/code/src' }

[Killed] BlockStatement
src/ddp/extensionState.ts:28:80
     return this._scope;
   }
 
-  setAnalysis(result: AnalysisResult | undefined, scope?: AnalysisScope): void {
-    this._last = result;
-    this._scope = scope;
-    this._seq += 1;
-    this._byId = new Map(result?.symbols.map((s) => [s.id, s]) ?? []);
-  }
+  setAnalysis(result: AnalysisResult | undefined, scope?: AnalysisScope): void {}
 }
 
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: expected [ undefined ] to deeply equal [ Array(3) ]

[Killed] AssignmentOperator
src/ddp/extensionState.ts:31:5
   setAnalysis(result: AnalysisResult | undefined, scope?: AnalysisScope): void {
     this._last = result;
     this._scope = scope;
-    this._seq += 1;
+    this._seq -= 1;
     this._byId = new Map(result?.symbols.map((s) => [s.id, s]) ?? []);
   }
killedBy: ExtensionState setAnalysis with valid result increments analysisGeneration by 1
statusReason: expected -1 to deeply equal 1

[Killed] OptionalChaining
src/ddp/extensionState.ts:32:26
     this._last = result;
     this._scope = scope;
     this._seq += 1;
-    this._byId = new Map(result?.symbols.map((s) => [s.id, s]) ?? []);
+    this._byId = new Map(result.symbols.map((s) => [s.id, s]) ?? []);
   }
 }
killedBy: RiskTreeProvider state transitions switches back to empty when analysis is cleared
statusReason: Cannot read properties of undefined (reading 'symbols')

[Killed] ArrowFunction
src/ddp/extensionState.ts:32:46
     this._last = result;
     this._scope = scope;
     this._seq += 1;
-    this._byId = new Map(result?.symbols.map((s) => [s.id, s]) ?? []);
+    this._byId = new Map(result?.symbols.map(() => undefined) ?? []);
   }
 }
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: Iterator value undefined is not an entry object
