[Killed] BlockStatement
src/ddp/hoverProvider.ts:14:40
     document: vscode.TextDocument,
     position: vscode.Position,
     _token: vscode.CancellationToken
-  ): Promise<vscode.Hover | undefined> {
-    const byId = this.state.symbolById;
-    if (!byId.size) {
-      return undefined;
-    }
-    const functions = await getFlatFunctionSymbols(document.uri);
-    for (const fn of functions) {
-      if (!fn.selectionRange.contains(position) && !fn.range.contains(position)) {
-        continue;
-      }
-      const id = symbolIdFromUriRange(document.uri, fn.selectionRange);
-      const m = byId.get(id);
-      if (!m) {
-        continue;
-      }
-      const md = new vscode.MarkdownString(formatHoverBreakdown(m));
-      md.isTrusted = true;
-      return new vscode.Hover(md, fn.range);
-    }
-    return undefined;
-  }
+  ): Promise<vscode.Hover | undefined> {}
 }
 
killedBy: DdpHoverProvider provideHover returns Hover with formatted markdown when metrics found
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/ddp/hoverProvider.ts:16:9
     _token: vscode.CancellationToken
   ): Promise<vscode.Hover | undefined> {
     const byId = this.state.symbolById;
-    if (!byId.size) {
+    if (true) {
       return undefined;
     }
killedBy: DdpHoverProvider provideHover returns Hover with formatted markdown when metrics found
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/ddp/hoverProvider.ts:16:21
     _token: vscode.CancellationToken
   ): Promise<vscode.Hover | undefined> {
     const byId = this.state.symbolById;
-    if (!byId.size) {
-      return undefined;
-    }
+    if (!byId.size) {}
     const functions = await getFlatFunctionSymbols(document.uri);
     for (const fn of functions) {
killedBy: DdpHoverProvider provideHover returns undefined when symbolById map is empty
statusReason: functions is not iterable

[Killed] BlockStatement
src/ddp/hoverProvider.ts:20:33
       return undefined;
     }
     const functions = await getFlatFunctionSymbols(document.uri);
-    for (const fn of functions) {
-      if (!fn.selectionRange.contains(position) && !fn.range.contains(position)) {
-        continue;
-      }
-      const id = symbolIdFromUriRange(document.uri, fn.selectionRange);
-      const m = byId.get(id);
-      if (!m) {
-        continue;
-      }
-      const md = new vscode.MarkdownString(formatHoverBreakdown(m));
-      md.isTrusted = true;
-      return new vscode.Hover(md, fn.range);
-    }
+    for (const fn of functions) {}
     return undefined;
   }
killedBy: DdpHoverProvider provideHover returns Hover with formatted markdown when metrics found
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/ddp/hoverProvider.ts:21:11
     }
     const functions = await getFlatFunctionSymbols(document.uri);
     for (const fn of functions) {
-      if (!fn.selectionRange.contains(position) && !fn.range.contains(position)) {
+      if (!fn.selectionRange.contains(position) || !fn.range.contains(position)) {
         continue;
       }
killedBy: DdpHoverProvider provideHover matches position via range containment when outside selectionRange
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/ddp/hoverProvider.ts:21:52
     }
     const functions = await getFlatFunctionSymbols(document.uri);
     for (const fn of functions) {
-      if (!fn.selectionRange.contains(position) && !fn.range.contains(position)) {
+      if (!fn.selectionRange.contains(position) && fn.range.contains(position)) {
         continue;
       }
killedBy: DdpHoverProvider provideHover matches position via range containment when outside selectionRange
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/ddp/hoverProvider.ts:26:11
       }
       const id = symbolIdFromUriRange(document.uri, fn.selectionRange);
       const m = byId.get(id);
-      if (!m) {
+      if (true) {
         continue;
       }
killedBy: DdpHoverProvider provideHover returns Hover with formatted markdown when metrics found
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/ddp/hoverProvider.ts:30:22
         continue;
       }
       const md = new vscode.MarkdownString(formatHoverBreakdown(m));
-      md.isTrusted = true;
+      md.isTrusted = false;
       return new vscode.Hover(md, fn.range);
     }
killedBy: DdpHoverProvider provideHover returns Hover with isTrusted markdown and fn.range
statusReason: expected false to be true // Object.is equality
