[Killed] BlockStatement
src/ddp/lcov.ts:6:27
 export function normalizeLcovPathToUri(
   workspace: vscode.WorkspaceFolder,
   lcovPath: string
-): vscode.Uri | undefined {
-  const t = lcovPath.trim();
-  if (!t) {
-    return undefined;
-  }
-  try {
-    if (t.startsWith("/") || /^[a-zA-Z]:[\\/]/.test(t)) {
-      return vscode.Uri.file(t);
-    }
-  } catch {
-    return undefined;
-  }
-  // Normalize backslashes to forward slashes for consistent path joining
-  const normalized = t.replaceAll('\\', "/");
-  return vscode.Uri.joinPath(workspace.uri, normalized);
-}
+): vscode.Uri | undefined {}
 
killedBy: normalizeLcovPathToUri returns Uri.file for Unix absolute path
statusReason: expected undefined to be defined

[Killed] MethodExpression
src/ddp/lcov.ts:7:13
   workspace: vscode.WorkspaceFolder,
   lcovPath: string
 ): vscode.Uri | undefined {
-  const t = lcovPath.trim();
+  const t = lcovPath;
   if (!t) {
     return undefined;
killedBy: normalizeLcovPathToUri trims leading and trailing whitespace from lcovPath
statusReason: expected 'file:///workspace/  src/file.ts  ' to be 'file:///workspace/src/file.ts' // Object.is equality

[Killed] BooleanLiteral
src/ddp/lcov.ts:8:7
   lcovPath: string
 ): vscode.Uri | undefined {
   const t = lcovPath.trim();
-  if (!t) {
+  if (t) {
     return undefined;
   }
killedBy: normalizeLcovPathToUri returns Uri.file for Unix absolute path
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/ddp/lcov.ts:8:7
   lcovPath: string
 ): vscode.Uri | undefined {
   const t = lcovPath.trim();
-  if (!t) {
+  if (false) {
     return undefined;
   }
killedBy: normalizeLcovPathToUri returns undefined for empty string
statusReason: expected Uri{ scheme: 'file', …(2) } to be undefined

[Killed] BlockStatement
src/ddp/lcov.ts:11:7
   if (!t) {
     return undefined;
   }
-  try {
-    if (t.startsWith("/") || /^[a-zA-Z]:[\\/]/.test(t)) {
-      return vscode.Uri.file(t);
-    }
-  } catch {
+  try {} catch {
     return undefined;
   }
killedBy: normalizeLcovPathToUri returns Uri.file for Unix absolute path
statusReason: expected 'file:///workspace//home/user/file.ts' to be 'file:////home/user/file.ts' // Object.is equality

[Killed] BlockStatement
src/ddp/lcov.ts:12:57
     return undefined;
   }
   try {
-    if (t.startsWith("/") || /^[a-zA-Z]:[\\/]/.test(t)) {
-      return vscode.Uri.file(t);
-    }
+    if (t.startsWith("/") || /^[a-zA-Z]:[\\/]/.test(t)) {}
   } catch {
     return undefined;
killedBy: normalizeLcovPathToUri returns Uri.file for Unix absolute path
statusReason: expected 'file:///workspace//home/user/file.ts' to be 'file:////home/user/file.ts' // Object.is equality

[Killed] ConditionalExpression
src/ddp/lcov.ts:12:9
     return undefined;
   }
   try {
-    if (t.startsWith("/") || /^[a-zA-Z]:[\\/]/.test(t)) {
+    if (true) {
       return vscode.Uri.file(t);
     }
killedBy: normalizeLcovPathToUri returns joined Uri for relative path
statusReason: expected 'file:///src/file.ts' to be 'file:///workspace/src/file.ts' // Object.is equality

[Killed] BlockStatement
src/ddp/lcov.ts:15:11
     if (t.startsWith("/") || /^[a-zA-Z]:[\\/]/.test(t)) {
       return vscode.Uri.file(t);
     }
-  } catch {
-    return undefined;
-  }
+  } catch {}
   // Normalize backslashes to forward slashes for consistent path joining
   const normalized = t.replaceAll('\\', "/");
killedBy: normalizeLcovPathToUri returns undefined when Uri.file throws for absolute path
statusReason: expected Uri{ scheme: 'file', …(2) } to be undefined
