[Killed] BlockStatement
src/ddp/loadJacocoIntoStore.ts:15:18
   store: CoverageStore,
   pattern: string,
   token: vscode.CancellationToken
-): Promise<void> {
-  const folders = vscode.workspace.workspaceFolders;
-  if (!folders?.length) {
-    return;
-  }
-
-  for (const folder of folders) {
-    if (token.isCancellationRequested) {
-      break;
-    }
-    await loadJacocoFromFolder(store, folder, pattern, token);
-  }
-}
+): Promise<void> {}
 
 async function loadJacocoFromFolder(
killedBy: loadJacocoIntoStore finds jacoco XML files matching the glob pattern
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] OptionalChaining
src/ddp/loadJacocoIntoStore.ts:17:8
   token: vscode.CancellationToken
 ): Promise<void> {
   const folders = vscode.workspace.workspaceFolders;
-  if (!folders?.length) {
+  if (!folders.length) {
     return;
   }
killedBy: loadJacocoIntoStore does nothing when no workspace folders exist
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/ddp/loadJacocoIntoStore.ts:17:7
   token: vscode.CancellationToken
 ): Promise<void> {
   const folders = vscode.workspace.workspaceFolders;
-  if (!folders?.length) {
+  if (true) {
     return;
   }
killedBy: loadJacocoIntoStore finds jacoco XML files matching the glob pattern
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/ddp/loadJacocoIntoStore.ts:21:33
     return;
   }
 
-  for (const folder of folders) {
-    if (token.isCancellationRequested) {
-      break;
-    }
-    await loadJacocoFromFolder(store, folder, pattern, token);
-  }
+  for (const folder of folders) {}
 }
 
killedBy: loadJacocoIntoStore finds jacoco XML files matching the glob pattern
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/ddp/loadJacocoIntoStore.ts:42:29
     50
   );
 
-  for (const file of files) {
-    if (token.isCancellationRequested) {
-      break;
-    }
-    const buf = await vscode.workspace.fs.readFile(file);
-    const text = Buffer.from(buf).toString("utf8");
-    const parsed = parseJacocoToStatementCovers(text);
-
-    for (const [jacocoKey, stmts] of parsed) {
-      const uri = await resolveJacocoSourceToUri(folder, jacocoKey);
-      if (uri) {
-        const existing = store.get(uri.toString());
-        if (existing) {
-          store.ingestStatementCovers(uri.toString(), [...existing, ...stmts]);
-        } else {
-          store.ingestStatementCovers(uri.toString(), stmts);
-        }
-      }
-    }
-  }
+  for (const file of files) {}
 }
 
killedBy: loadJacocoIntoStore parses JaCoCo XML and ingests line coverage into store
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/ddp/loadJacocoIntoStore.ts:43:9
   );
 
   for (const file of files) {
-    if (token.isCancellationRequested) {
+    if (false) {
       break;
     }
killedBy: loadJacocoIntoStore stops processing files mid-folder when cancellation is triggered
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] StringLiteral
src/ddp/loadJacocoIntoStore.ts:47:44
       break;
     }
     const buf = await vscode.workspace.fs.readFile(file);
-    const text = Buffer.from(buf).toString("utf8");
+    const text = Buffer.from(buf).toString("");
     const parsed = parseJacocoToStatementCovers(text);
 
killedBy: loadJacocoIntoStore parses JaCoCo XML and ingests line coverage into store
statusReason: Unknown encoding:

[Killed] BlockStatement
src/ddp/loadJacocoIntoStore.ts:50:46
     const text = Buffer.from(buf).toString("utf8");
     const parsed = parseJacocoToStatementCovers(text);
 
-    for (const [jacocoKey, stmts] of parsed) {
-      const uri = await resolveJacocoSourceToUri(folder, jacocoKey);
-      if (uri) {
-        const existing = store.get(uri.toString());
-        if (existing) {
-          store.ingestStatementCovers(uri.toString(), [...existing, ...stmts]);
-        } else {
-          store.ingestStatementCovers(uri.toString(), stmts);
-        }
-      }
-    }
+    for (const [jacocoKey, stmts] of parsed) {}
   }
 }
killedBy: loadJacocoIntoStore parses JaCoCo XML and ingests line coverage into store
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/ddp/loadJacocoIntoStore.ts:52:11
 
     for (const [jacocoKey, stmts] of parsed) {
       const uri = await resolveJacocoSourceToUri(folder, jacocoKey);
-      if (uri) {
+      if (true) {
         const existing = store.get(uri.toString());
         if (existing) {
killedBy: loadJacocoIntoStore skips source files not found in workspace
statusReason: Cannot read properties of undefined (reading 'toString')

[Killed] ConditionalExpression
src/ddp/loadJacocoIntoStore.ts:52:11
 
     for (const [jacocoKey, stmts] of parsed) {
       const uri = await resolveJacocoSourceToUri(folder, jacocoKey);
-      if (uri) {
+      if (false) {
         const existing = store.get(uri.toString());
         if (existing) {
killedBy: loadJacocoIntoStore parses JaCoCo XML and ingests line coverage into store
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/ddp/loadJacocoIntoStore.ts:54:13
       const uri = await resolveJacocoSourceToUri(folder, jacocoKey);
       if (uri) {
         const existing = store.get(uri.toString());
-        if (existing) {
+        if (false) {
           store.ingestStatementCovers(uri.toString(), [...existing, ...stmts]);
         } else {
killedBy: loadJacocoIntoStore merges coverage when two JaCoCo files report the same source file
statusReason: expected [ { executed: true, …(2) } ] to have a length of 2 but got 1

[Killed] BlockStatement
src/ddp/loadJacocoIntoStore.ts:54:23
       const uri = await resolveJacocoSourceToUri(folder, jacocoKey);
       if (uri) {
         const existing = store.get(uri.toString());
-        if (existing) {
-          store.ingestStatementCovers(uri.toString(), [...existing, ...stmts]);
-        } else {
+        if (existing) {} else {
           store.ingestStatementCovers(uri.toString(), stmts);
         }
killedBy: loadJacocoIntoStore merges coverage when two JaCoCo files report the same source file
statusReason: expected [ { executed: true, …(2) } ] to have a length of 2 but got 1

[Killed] ArrayDeclaration
src/ddp/loadJacocoIntoStore.ts:55:55
       if (uri) {
         const existing = store.get(uri.toString());
         if (existing) {
-          store.ingestStatementCovers(uri.toString(), [...existing, ...stmts]);
+          store.ingestStatementCovers(uri.toString(), []);
         } else {
           store.ingestStatementCovers(uri.toString(), stmts);
killedBy: loadJacocoIntoStore merges coverage when two JaCoCo files report the same source file
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/ddp/loadJacocoIntoStore.ts:56:16
         const existing = store.get(uri.toString());
         if (existing) {
           store.ingestStatementCovers(uri.toString(), [...existing, ...stmts]);
-        } else {
-          store.ingestStatementCovers(uri.toString(), stmts);
-        }
+        } else {}
       }
     }
killedBy: loadJacocoIntoStore parses JaCoCo XML and ingests line coverage into store
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/ddp/loadJacocoIntoStore.ts:71:36
 async function resolveJacocoSourceToUri(
   folder: vscode.WorkspaceFolder,
   jacocoKey: string
-): Promise<vscode.Uri | undefined> {
-  const searchPattern = new vscode.RelativePattern(folder, `**/${jacocoKey}`);
-  const matches = await vscode.workspace.findFiles(searchPattern, "**/node_modules/**", 2);
-  if (matches.length > 1) {
-    console.debug(`[DDP] Ambiguous JaCoCo source '${jacocoKey}': ${matches.length} matches, using first`);
-  }
-  return matches[0];
-}
+): Promise<vscode.Uri | undefined> {}
 
killedBy: loadJacocoIntoStore parses JaCoCo XML and ingests line coverage into store
statusReason: expected undefined to be defined

[Survived] StringLiteral
src/ddp/loadJacocoIntoStore.ts:73:67
   jacocoKey: string
 ): Promise<vscode.Uri | undefined> {
   const searchPattern = new vscode.RelativePattern(folder, `**/${jacocoKey}`);
-  const matches = await vscode.workspace.findFiles(searchPattern, "**/node_modules/**", 2);
+  const matches = await vscode.workspace.findFiles(searchPattern, "", 2);
   if (matches.length > 1) {
     console.debug(`[DDP] Ambiguous JaCoCo source '${jacocoKey}': ${matches.length} matches, using first`);

[Killed] BlockStatement
src/ddp/loadJacocoIntoStore.ts:74:27
 ): Promise<vscode.Uri | undefined> {
   const searchPattern = new vscode.RelativePattern(folder, `**/${jacocoKey}`);
   const matches = await vscode.workspace.findFiles(searchPattern, "**/node_modules/**", 2);
-  if (matches.length > 1) {
-    console.debug(`[DDP] Ambiguous JaCoCo source '${jacocoKey}': ${matches.length} matches, using first`);
-  }
+  if (matches.length > 1) {}
   return matches[0];
 }
killedBy: loadJacocoIntoStore logs a debug message when source key resolves to multiple files
statusReason: expected "debug" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
src/ddp/loadJacocoIntoStore.ts:74:7
 ): Promise<vscode.Uri | undefined> {
   const searchPattern = new vscode.RelativePattern(folder, `**/${jacocoKey}`);
   const matches = await vscode.workspace.findFiles(searchPattern, "**/node_modules/**", 2);
-  if (matches.length > 1) {
+  if (false) {
     console.debug(`[DDP] Ambiguous JaCoCo source '${jacocoKey}': ${matches.length} matches, using first`);
   }
killedBy: loadJacocoIntoStore logs a debug message when source key resolves to multiple files
statusReason: expected "debug" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0

[Killed] StringLiteral
src/ddp/loadJacocoIntoStore.ts:75:19
   const searchPattern = new vscode.RelativePattern(folder, `**/${jacocoKey}`);
   const matches = await vscode.workspace.findFiles(searchPattern, "**/node_modules/**", 2);
   if (matches.length > 1) {
-    console.debug(`[DDP] Ambiguous JaCoCo source '${jacocoKey}': ${matches.length} matches, using first`);
+    console.debug(``);
   }
   return matches[0];
killedBy: loadJacocoIntoStore logs a debug message when source key resolves to multiple files
statusReason: expected "debug" to be called with arguments: [ StringContaining{…} ]

Received:

  1st debug call:

  [
-   StringContaining "Ambiguous JaCoCo source",
