[Killed] BlockStatement
src/ddp/lspCallGraph.ts:22:89
   ): Thenable<vscode.CallHierarchyOutgoingCall[] | null | undefined>;
 };
 
-function languagesCallHierarchy(): typeof vscode.languages & LanguagesWithCallHierarchy {
-  return vscode.languages as typeof vscode.languages & LanguagesWithCallHierarchy;
-}
+function languagesCallHierarchy(): typeof vscode.languages & LanguagesWithCallHierarchy {}
 
 export type CallGraphCollectOptions = {
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:35:123
   readonly excludeTests?: boolean;
 };
 
-async function discoverFiles(maxFiles: number, rootUri: string | undefined, excludeTests: boolean): Promise<vscode.Uri[]> {
-  const pattern: string | vscode.RelativePattern = rootUri
-    ? new vscode.RelativePattern(vscode.Uri.parse(rootUri), SOURCE_FILE_GLOB)
-    : SOURCE_FILE_GLOB;
-  // Request extra files to compensate for test files that will be filtered out.
-  const limit = excludeTests ? maxFiles * 2 : maxFiles;
-  const allFiles = await vscode.workspace.findFiles(pattern, EXCLUDE_GLOB, limit);
-  // Programmatic filter — reliable across all platforms and pattern types.
-  return excludeTests
-    ? allFiles.filter((u) => !isTestFileUri(u.toString())).slice(0, maxFiles)
-    : allFiles;
-}
+async function discoverFiles(maxFiles: number, rootUri: string | undefined, excludeTests: boolean): Promise<vscode.Uri[]> {}
 
 async function collectSymbolsForFile(uri: vscode.Uri): Promise<{ id: string; uriStr: string }[]> {
killedBy: collectCallEdgesFromWorkspace file discovery glob pattern returns empty edges when findFiles returns no files
statusReason: files is not iterable

[Killed] ArithmeticOperator
src/ddp/lspCallGraph.ts:40:32
     ? new vscode.RelativePattern(vscode.Uri.parse(rootUri), SOURCE_FILE_GLOB)
     : SOURCE_FILE_GLOB;
   // Request extra files to compensate for test files that will be filtered out.
-  const limit = excludeTests ? maxFiles * 2 : maxFiles;
+  const limit = excludeTests ? maxFiles / 2 : maxFiles;
   const allFiles = await vscode.workspace.findFiles(pattern, EXCLUDE_GLOB, limit);
   // Programmatic filter — reliable across all platforms and pattern types.
killedBy: collectCallEdgesFromWorkspace test file filtering doubles the findFiles limit when excludeTests is true
statusReason: expected 5 to be 20 // Object.is equality

[Killed] MethodExpression
src/ddp/lspCallGraph.ts:44:7
   const allFiles = await vscode.workspace.findFiles(pattern, EXCLUDE_GLOB, limit);
   // Programmatic filter — reliable across all platforms and pattern types.
   return excludeTests
-    ? allFiles.filter((u) => !isTestFileUri(u.toString())).slice(0, maxFiles)
+    ? allFiles.filter(u => !isTestFileUri(u.toString()))
     : allFiles;
 }
killedBy: collectCallEdgesFromWorkspace test file filtering filters out test files and slices to maxFiles when excludeTests is true
statusReason: expected [ 'file:///src/app.ts', …(5) ] to not include 'file:///src/helper.ts'

[Killed] BooleanLiteral
src/ddp/lspCallGraph.ts:44:30
   const allFiles = await vscode.workspace.findFiles(pattern, EXCLUDE_GLOB, limit);
   // Programmatic filter — reliable across all platforms and pattern types.
   return excludeTests
-    ? allFiles.filter((u) => !isTestFileUri(u.toString())).slice(0, maxFiles)
+    ? allFiles.filter((u) => isTestFileUri(u.toString())).slice(0, maxFiles)
     : allFiles;
 }
killedBy: collectCallEdgesFromWorkspace test file filtering filters out test files and slices to maxFiles when excludeTests is true
statusReason: expected [ 'file:///src/app.test.ts', …(3) ] to not include 'file:///src/app.test.ts'

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:48:98
     : allFiles;
 }
 
-async function collectSymbolsForFile(uri: vscode.Uri): Promise<{ id: string; uriStr: string }[]> {
-  try {
-    await vscode.workspace.openTextDocument(uri);
-  } catch (e) {
-    console.debug(`[DDP] Cannot open ${uri.toString()} for call graph:`, e);
-  }
-  let syms: vscode.DocumentSymbol[] | undefined;
-  try {
-    syms = await vscode.commands.executeCommand<vscode.DocumentSymbol[]>(
-      "vscode.executeDocumentSymbolProvider",
-      uri
-    );
-  } catch (e) {
-    console.debug(`[DDP] Symbol provider failed for ${uri.toString()}:`, e);
-  }
-  if (!syms?.length) {
-    return [];
-  }
-  return flattenFunctionSymbols(syms).map((fn) => ({
-    id: symbolIdFromUriRange(uri, fn.selectionRange),
-    uriStr: uri.toString(),
-  }));
-}
+async function collectSymbolsForFile(uri: vscode.Uri): Promise<{ id: string; uriStr: string }[]> {}
 
 async function prepareCallHierarchyItem(
killedBy: collectCallEdgesFromWorkspace test file filtering filters out test files and slices to maxFiles when excludeTests is true
statusReason: symbols is not iterable (cannot read property undefined)

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:49:7
 }
 
 async function collectSymbolsForFile(uri: vscode.Uri): Promise<{ id: string; uriStr: string }[]> {
-  try {
-    await vscode.workspace.openTextDocument(uri);
-  } catch (e) {
+  try {} catch (e) {
     console.debug(`[DDP] Cannot open ${uri.toString()} for call graph:`, e);
   }
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns empty edges when openTextDocument fails during call resolution
statusReason: expected "debug" to be called with arguments: [ Array(2) ]

Number of calls: 0

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:51:15
 async function collectSymbolsForFile(uri: vscode.Uri): Promise<{ id: string; uriStr: string }[]> {
   try {
     await vscode.workspace.openTextDocument(uri);
-  } catch (e) {
-    console.debug(`[DDP] Cannot open ${uri.toString()} for call graph:`, e);
-  }
+  } catch (e) {}
   let syms: vscode.DocumentSymbol[] | undefined;
   try {
killedBy: collectCallEdgesFromWorkspace error resilience continues processing when openTextDocument throws for one file
statusReason: expected "debug" to be called with arguments: [ Array(2) ]

Number of calls: 0

[Killed] StringLiteral
src/ddp/lspCallGraph.ts:52:19
   try {
     await vscode.workspace.openTextDocument(uri);
   } catch (e) {
-    console.debug(`[DDP] Cannot open ${uri.toString()} for call graph:`, e);
+    console.debug(``, e);
   }
   let syms: vscode.DocumentSymbol[] | undefined;
killedBy: collectCallEdgesFromWorkspace error resilience continues processing when openTextDocument throws for one file
statusReason: expected "debug" to be called with arguments: [ Array(2) ]

Received:

  1st debug call:

  [
-   StringContaining "[DDP]",

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:60:15
       "vscode.executeDocumentSymbolProvider",
       uri
     );
-  } catch (e) {
-    console.debug(`[DDP] Symbol provider failed for ${uri.toString()}:`, e);
-  }
+  } catch (e) {}
   if (!syms?.length) {
     return [];
killedBy: collectCallEdgesFromWorkspace error resilience continues processing when symbol provider throws for one file
statusReason: expected "debug" to be called with arguments: [ Array(2) ]

Number of calls: 0

[Killed] StringLiteral
src/ddp/lspCallGraph.ts:61:19
       uri
     );
   } catch (e) {
-    console.debug(`[DDP] Symbol provider failed for ${uri.toString()}:`, e);
+    console.debug(``, e);
   }
   if (!syms?.length) {
killedBy: collectCallEdgesFromWorkspace error resilience continues processing when symbol provider throws for one file
statusReason: expected "debug" to be called with arguments: [ Array(2) ]

Received:

  1st debug call:

  [
-   StringContaining "[DDP]",

[Killed] ConditionalExpression
src/ddp/lspCallGraph.ts:63:7
   } catch (e) {
     console.debug(`[DDP] Symbol provider failed for ${uri.toString()}:`, e);
   }
-  if (!syms?.length) {
+  if (false) {
     return [];
   }
killedBy: collectCallEdgesFromWorkspace error resilience continues processing when symbol provider throws for one file
statusReason: symbols is not iterable

[Killed] ArrowFunction
src/ddp/lspCallGraph.ts:66:43
   if (!syms?.length) {
     return [];
   }
-  return flattenFunctionSymbols(syms).map((fn) => ({
-    id: symbolIdFromUriRange(uri, fn.selectionRange),
-    uriStr: uri.toString(),
-  }));
+  return flattenFunctionSymbols(syms).map(() => undefined);
 }
 
killedBy: collectCallEdgesFromWorkspace test file filtering filters out test files and slices to maxFiles when excludeTests is true
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/ddp/lspCallGraph.ts:66:52
   if (!syms?.length) {
     return [];
   }
-  return flattenFunctionSymbols(syms).map((fn) => ({
-    id: symbolIdFromUriRange(uri, fn.selectionRange),
-    uriStr: uri.toString(),
-  }));
+  return flattenFunctionSymbols(syms).map((fn) => ({}));
 }
 
killedBy: collectCallEdgesFromWorkspace test file filtering filters out test files and slices to maxFiles when excludeTests is true
statusReason: Cannot read properties of undefined (reading 'indexOf')

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:75:50
 async function prepareCallHierarchyItem(
   symbolId: string,
   token: vscode.CancellationToken
-): Promise<vscode.CallHierarchyItem | undefined> {
-  const parsed = parseSymbolIdParts(symbolId);
-  if (!parsed) {
-    return undefined;
-  }
-  const { uriStr, line, ch } = parsed;
-  let doc: vscode.TextDocument;
-  try {
-    doc = await vscode.workspace.openTextDocument(vscode.Uri.parse(uriStr));
-  } catch (e) {
-    console.debug(`[DDP] Cannot open ${uriStr} for outgoing calls:`, e);
-    return undefined;
-  }
-  const pos = new vscode.Position(line, ch);
-  try {
-    const items = await languagesCallHierarchy().prepareCallHierarchy(doc, pos, token);
-    return items?.[0];
-  } catch (e) {
-    console.debug(`[DDP] prepareCallHierarchy failed for ${symbolId}:`, e);
-    return undefined;
-  }
-}
+): Promise<vscode.CallHierarchyItem | undefined> {}
 
 async function resolveOutgoingCalls(
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] ConditionalExpression
src/ddp/lspCallGraph.ts:77:7
   token: vscode.CancellationToken
 ): Promise<vscode.CallHierarchyItem | undefined> {
   const parsed = parseSymbolIdParts(symbolId);
-  if (!parsed) {
+  if (false) {
     return undefined;
   }
killedBy: collectCallEdgesFromWorkspace edge cases handles URI with hash in path producing unparseable symbolId
statusReason: Cannot destructure property 'uriStr' of 'parsed' as it is undefined.

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:77:16
   token: vscode.CancellationToken
 ): Promise<vscode.CallHierarchyItem | undefined> {
   const parsed = parseSymbolIdParts(symbolId);
-  if (!parsed) {
-    return undefined;
-  }
+  if (!parsed) {}
   const { uriStr, line, ch } = parsed;
   let doc: vscode.TextDocument;
killedBy: collectCallEdgesFromWorkspace edge cases handles URI with hash in path producing unparseable symbolId
statusReason: Cannot destructure property 'uriStr' of 'parsed' as it is undefined.

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:82:7
   }
   const { uriStr, line, ch } = parsed;
   let doc: vscode.TextDocument;
-  try {
-    doc = await vscode.workspace.openTextDocument(vscode.Uri.parse(uriStr));
-  } catch (e) {
+  try {} catch (e) {
     console.debug(`[DDP] Cannot open ${uriStr} for outgoing calls:`, e);
     return undefined;
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns empty edges when openTextDocument fails during call resolution
statusReason: expected "debug" to be called with arguments: [ Array(2) ]

Number of calls: 0

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:84:15
   let doc: vscode.TextDocument;
   try {
     doc = await vscode.workspace.openTextDocument(vscode.Uri.parse(uriStr));
-  } catch (e) {
-    console.debug(`[DDP] Cannot open ${uriStr} for outgoing calls:`, e);
-    return undefined;
-  }
+  } catch (e) {}
   const pos = new vscode.Position(line, ch);
   try {
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns empty edges when openTextDocument fails during call resolution
statusReason: expected "debug" to be called with arguments: [ Array(2) ]

Number of calls: 0

[Killed] StringLiteral
src/ddp/lspCallGraph.ts:85:19
   try {
     doc = await vscode.workspace.openTextDocument(vscode.Uri.parse(uriStr));
   } catch (e) {
-    console.debug(`[DDP] Cannot open ${uriStr} for outgoing calls:`, e);
+    console.debug(``, e);
     return undefined;
   }
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns empty edges when openTextDocument fails during call resolution
statusReason: expected "debug" to be called with arguments: [ Array(2) ]

Received:

  1st debug call:

  [
-   StringContaining "[DDP]",

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:89:7
     return undefined;
   }
   const pos = new vscode.Position(line, ch);
-  try {
-    const items = await languagesCallHierarchy().prepareCallHierarchy(doc, pos, token);
-    return items?.[0];
-  } catch (e) {
+  try {} catch (e) {
     console.debug(`[DDP] prepareCallHierarchy failed for ${symbolId}:`, e);
     return undefined;
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] OptionalChaining
src/ddp/lspCallGraph.ts:91:12
   const pos = new vscode.Position(line, ch);
   try {
     const items = await languagesCallHierarchy().prepareCallHierarchy(doc, pos, token);
-    return items?.[0];
+    return items[0];
   } catch (e) {
     console.debug(`[DDP] prepareCallHierarchy failed for ${symbolId}:`, e);
killedBy: collectCallEdgesFromWorkspace outgoing call resolution does not log prepareCallHierarchy error when it returns null
statusReason: expected "debug" to not be called with arguments: [ StringContaining{…}, Anything ]

Received:

  1st debug call:

  [
-   StringContaining "prepareCallHierarchy failed",

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:92:15
   try {
     const items = await languagesCallHierarchy().prepareCallHierarchy(doc, pos, token);
     return items?.[0];
-  } catch (e) {
-    console.debug(`[DDP] prepareCallHierarchy failed for ${symbolId}:`, e);
-    return undefined;
-  }
+  } catch (e) {}
 }
 
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns empty edges when prepareCallHierarchy throws
statusReason: expected "debug" to be called with arguments: [ Array(2) ]

Number of calls: 0

[Killed] StringLiteral
src/ddp/lspCallGraph.ts:93:19
     const items = await languagesCallHierarchy().prepareCallHierarchy(doc, pos, token);
     return items?.[0];
   } catch (e) {
-    console.debug(`[DDP] prepareCallHierarchy failed for ${symbolId}:`, e);
+    console.debug(``, e);
     return undefined;
   }
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns empty edges when prepareCallHierarchy throws
statusReason: expected "debug" to be called with arguments: [ Array(2) ]

Received:

  1st debug call:

  [
-   StringContaining "[DDP]",

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:101:22
 async function resolveOutgoingCalls(
   item: vscode.CallHierarchyItem,
   token: vscode.CancellationToken
-): Promise<string[]> {
-  let outgoing: vscode.CallHierarchyOutgoingCall[];
-  try {
-    const raw = await languagesCallHierarchy().provideCallHierarchyOutgoingCalls(item, token);
-    outgoing = raw ?? [];
-  } catch (e) {
-    console.debug(`[DDP] provideCallHierarchyOutgoingCalls failed:`, e);
-    return [];
-  }
-  return outgoing.map((o) => {
-    const r = o.to.selectionRange ?? o.to.range;
-    return symbolIdFromUriRange(o.to.uri, r);
-  });
-}
+): Promise<string[]> {}
 
 function buildVscodeAdapter(maxFiles: number, token: vscode.CancellationToken, rootUri: string | undefined, excludeTests: boolean): CallHierarchyAdapter {
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:103:7
   token: vscode.CancellationToken
 ): Promise<string[]> {
   let outgoing: vscode.CallHierarchyOutgoingCall[];
-  try {
-    const raw = await languagesCallHierarchy().provideCallHierarchyOutgoingCalls(item, token);
-    outgoing = raw ?? [];
-  } catch (e) {
+  try {} catch (e) {
     console.debug(`[DDP] provideCallHierarchyOutgoingCalls failed:`, e);
     return [];
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] LogicalOperator
src/ddp/lspCallGraph.ts:105:16
   let outgoing: vscode.CallHierarchyOutgoingCall[];
   try {
     const raw = await languagesCallHierarchy().provideCallHierarchyOutgoingCalls(item, token);
-    outgoing = raw ?? [];
+    outgoing = raw && [];
   } catch (e) {
     console.debug(`[DDP] provideCallHierarchyOutgoingCalls failed:`, e);
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:106:15
   try {
     const raw = await languagesCallHierarchy().provideCallHierarchyOutgoingCalls(item, token);
     outgoing = raw ?? [];
-  } catch (e) {
-    console.debug(`[DDP] provideCallHierarchyOutgoingCalls failed:`, e);
-    return [];
-  }
+  } catch (e) {}
   return outgoing.map((o) => {
     const r = o.to.selectionRange ?? o.to.range;
killedBy: collectCallEdgesFromWorkspace multi-file error resilience returns empty edges when provideCallHierarchyOutgoingCalls throws
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:110:30
     console.debug(`[DDP] provideCallHierarchyOutgoingCalls failed:`, e);
     return [];
   }
-  return outgoing.map((o) => {
-    const r = o.to.selectionRange ?? o.to.range;
-    return symbolIdFromUriRange(o.to.uri, r);
-  });
+  return outgoing.map((o) => {});
 }
 
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [ { …(2) } ] to deeply equal [ { …(2) } ]

[Killed] LogicalOperator
src/ddp/lspCallGraph.ts:111:15
     return [];
   }
   return outgoing.map((o) => {
-    const r = o.to.selectionRange ?? o.to.range;
+    const r = o.to.selectionRange && o.to.range;
     return symbolIdFromUriRange(o.to.uri, r);
   });
killedBy: collectCallEdgesFromWorkspace outgoing call resolution uses selectionRange over range for callee symbolId
statusReason: expected 'file:///src/callee.ts#1:0' to be 'file:///src/callee.ts#3:4' // Object.is equality

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:118:33
 
 function buildVscodeAdapter(maxFiles: number, token: vscode.CancellationToken, rootUri: string | undefined, excludeTests: boolean): CallHierarchyAdapter {
   return {
-    async findFunctionSymbols() {
-      const files = await discoverFiles(maxFiles, rootUri, excludeTests);
-      const result: { id: string; uriStr: string }[] = [];
-      for (const uri of files) {
-        if (!supportedSchemes.has(uri.scheme)) {
-          continue;
-        }
-        if (token.isCancellationRequested) {
-          break;
-        }
-        const symbols = await collectSymbolsForFile(uri);
-        result.push(...symbols);
-      }
-      return result;
-    },
+    async findFunctionSymbols() {},
     async getOutgoingCalleeIds(symbolId: string) {
       const item = await prepareCallHierarchyItem(symbolId, token);
killedBy: collectCallEdgesFromWorkspace file discovery glob pattern returns empty edges when findFiles returns no files
statusReason: symbols is not iterable

[Killed] ArrayDeclaration
src/ddp/lspCallGraph.ts:120:56
   return {
     async findFunctionSymbols() {
       const files = await discoverFiles(maxFiles, rootUri, excludeTests);
-      const result: { id: string; uriStr: string }[] = [];
+      const result: { id: string; uriStr: string }[] = ["Stryker was here"];
       for (const uri of files) {
         if (!supportedSchemes.has(uri.scheme)) {
killedBy: collectCallEdgesFromWorkspace file discovery glob pattern returns empty edges when findFiles returns no files
statusReason: Cannot read properties of undefined (reading 'indexOf')

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:121:32
     async findFunctionSymbols() {
       const files = await discoverFiles(maxFiles, rootUri, excludeTests);
       const result: { id: string; uriStr: string }[] = [];
-      for (const uri of files) {
-        if (!supportedSchemes.has(uri.scheme)) {
-          continue;
-        }
-        if (token.isCancellationRequested) {
-          break;
-        }
-        const symbols = await collectSymbolsForFile(uri);
-        result.push(...symbols);
-      }
+      for (const uri of files) {}
       return result;
     },
killedBy: collectCallEdgesFromWorkspace test file filtering keeps all files including test files when excludeTests is false
statusReason: expected [] to include 'file:///src/app.ts'

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:122:48
       const files = await discoverFiles(maxFiles, rootUri, excludeTests);
       const result: { id: string; uriStr: string }[] = [];
       for (const uri of files) {
-        if (!supportedSchemes.has(uri.scheme)) {
-          continue;
-        }
+        if (!supportedSchemes.has(uri.scheme)) {}
         if (token.isCancellationRequested) {
           break;
killedBy: collectCallEdgesFromWorkspace scheme filtering skips files with unsupported URI schemes
statusReason: expected [ 'file:///src/a.ts', …(5) ] to not include 'git:///src/b.ts'

[Killed] ConditionalExpression
src/ddp/lspCallGraph.ts:122:13
       const files = await discoverFiles(maxFiles, rootUri, excludeTests);
       const result: { id: string; uriStr: string }[] = [];
       for (const uri of files) {
-        if (!supportedSchemes.has(uri.scheme)) {
+        if (true) {
           continue;
         }
killedBy: collectCallEdgesFromWorkspace test file filtering keeps all files including test files when excludeTests is false
statusReason: expected [] to include 'file:///src/app.ts'

[Killed] ConditionalExpression
src/ddp/lspCallGraph.ts:125:13
         if (!supportedSchemes.has(uri.scheme)) {
           continue;
         }
-        if (token.isCancellationRequested) {
+        if (false) {
           break;
         }
killedBy: collectCallEdgesFromWorkspace cancellation stops processing files when token is cancelled
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/ddp/lspCallGraph.ts:125:13
         if (!supportedSchemes.has(uri.scheme)) {
           continue;
         }
-        if (token.isCancellationRequested) {
+        if (true) {
           break;
         }
killedBy: collectCallEdgesFromWorkspace test file filtering keeps all files including test files when excludeTests is false
statusReason: expected [] to include 'file:///src/app.ts'

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:133:50
       }
       return result;
     },
-    async getOutgoingCalleeIds(symbolId: string) {
-      const item = await prepareCallHierarchyItem(symbolId, token);
-      if (!item) {
-        return [];
-      }
-      return resolveOutgoingCalls(item, token);
-    },
+    async getOutgoingCalleeIds(symbolId: string) {},
     isCancelled() {
       return token.isCancellationRequested;
killedBy: collectCallEdgesFromWorkspace test file filtering filters out test files and slices to maxFiles when excludeTests is true
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] ConditionalExpression
src/ddp/lspCallGraph.ts:135:11
     },
     async getOutgoingCalleeIds(symbolId: string) {
       const item = await prepareCallHierarchyItem(symbolId, token);
-      if (!item) {
+      if (true) {
         return [];
       }
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:135:18
     },
     async getOutgoingCalleeIds(symbolId: string) {
       const item = await prepareCallHierarchyItem(symbolId, token);
-      if (!item) {
-        return [];
-      }
+      if (!item) {}
       return resolveOutgoingCalls(item, token);
     },
killedBy: collectCallEdgesFromWorkspace outgoing call resolution does not call provideOutgoingCalls when prepareCallHierarchy returns undefined
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      undefined,

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:140:19
       }
       return resolveOutgoingCalls(item, token);
     },
-    isCancelled() {
-      return token.isCancellationRequested;
-    },
+    isCancelled() {},
   };
 }
killedBy: collectCallEdgesFromWorkspace bugmagnet session 2026-04-15 complex interactions handles cancellation mid-way through outgoing call collection
statusReason: expected 3 to be less than 3

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:151:24
  */
 export async function collectCallEdgesFromWorkspace(
   options: CallGraphCollectOptions = {}
-): Promise<CallEdge[]> {
-  const token = options.token ?? new vscode.CancellationTokenSource().token;
-  const maxFiles = options.maxFiles ?? 500;
-  const adapter = buildVscodeAdapter(maxFiles, token, options.rootUri, options.excludeTests ?? true);
-  return collectCallEdgesViaAdapter(adapter);
-}
+): Promise<CallEdge[]> {}
 
killedBy: collectCallEdgesFromWorkspace file discovery glob pattern returns empty edges when findFiles returns no files
statusReason: expected undefined to deeply equal []

[Killed] LogicalOperator
src/ddp/lspCallGraph.ts:152:17
 export async function collectCallEdgesFromWorkspace(
   options: CallGraphCollectOptions = {}
 ): Promise<CallEdge[]> {
-  const token = options.token ?? new vscode.CancellationTokenSource().token;
+  const token = options.token && new vscode.CancellationTokenSource().token;
   const maxFiles = options.maxFiles ?? 500;
   const adapter = buildVscodeAdapter(maxFiles, token, options.rootUri, options.excludeTests ?? true);
killedBy: collectCallEdgesFromWorkspace test file filtering filters out test files and slices to maxFiles when excludeTests is true
statusReason: Cannot read properties of undefined (reading 'isCancellationRequested')

[Killed] LogicalOperator
src/ddp/lspCallGraph.ts:153:20
   options: CallGraphCollectOptions = {}
 ): Promise<CallEdge[]> {
   const token = options.token ?? new vscode.CancellationTokenSource().token;
-  const maxFiles = options.maxFiles ?? 500;
+  const maxFiles = options.maxFiles && 500;
   const adapter = buildVscodeAdapter(maxFiles, token, options.rootUri, options.excludeTests ?? true);
   return collectCallEdgesViaAdapter(adapter);
killedBy: collectCallEdgesFromWorkspace test file filtering doubles the findFiles limit when excludeTests is true
statusReason: expected 1000 to be 20 // Object.is equality

[Killed] BooleanLiteral
src/ddp/lspCallGraph.ts:154:96
 ): Promise<CallEdge[]> {
   const token = options.token ?? new vscode.CancellationTokenSource().token;
   const maxFiles = options.maxFiles ?? 500;
-  const adapter = buildVscodeAdapter(maxFiles, token, options.rootUri, options.excludeTests ?? true);
+  const adapter = buildVscodeAdapter(maxFiles, token, options.rootUri, options.excludeTests ?? false);
   return collectCallEdgesViaAdapter(adapter);
 }
killedBy: collectCallEdgesFromWorkspace defaults defaults maxFiles to 500 and excludeTests to true
statusReason: expected 500 to be 1000 // Object.is equality

[Killed] LogicalOperator
src/ddp/lspCallGraph.ts:154:72
 ): Promise<CallEdge[]> {
   const token = options.token ?? new vscode.CancellationTokenSource().token;
   const maxFiles = options.maxFiles ?? 500;
-  const adapter = buildVscodeAdapter(maxFiles, token, options.rootUri, options.excludeTests ?? true);
+  const adapter = buildVscodeAdapter(maxFiles, token, options.rootUri, options.excludeTests && true);
   return collectCallEdgesViaAdapter(adapter);
 }
killedBy: collectCallEdgesFromWorkspace defaults defaults maxFiles to 500 and excludeTests to true
statusReason: expected 500 to be 1000 // Object.is equality
