[Killed] BlockStatement
src/ddp/lspCallGraphAdapter.ts:20:24
  */
 export async function collectCallEdgesViaAdapter(
   adapter: CallHierarchyAdapter
-): Promise<CallEdge[]> {
-  const symbols = await adapter.findFunctionSymbols();
-  const callerCallees: { callerId: string; calleeIds: string[] }[] = [];
-
-  for (const sym of symbols) {
-    if (adapter.isCancelled()) {
-      break;
-    }
-    const calleeIds = await adapter.getOutgoingCalleeIds(sym.id);
-    const filtered = calleeIds.filter((id) => id !== sym.id);
-    if (filtered.length) {
-      callerCallees.push({ callerId: sym.id, calleeIds: filtered });
-    }
-  }
-
-  return edgesFromCallerCallees(callerCallees);
-}
+): Promise<CallEdge[]> {}
 
killedBy: collectCallEdgesFromWorkspace file discovery glob pattern returns empty edges when findFiles returns no files
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
src/ddp/lspCallGraphAdapter.ts:24:30
   const symbols = await adapter.findFunctionSymbols();
   const callerCallees: { callerId: string; calleeIds: string[] }[] = [];
 
-  for (const sym of symbols) {
-    if (adapter.isCancelled()) {
-      break;
-    }
-    const calleeIds = await adapter.getOutgoingCalleeIds(sym.id);
-    const filtered = calleeIds.filter((id) => id !== sym.id);
-    if (filtered.length) {
-      callerCallees.push({ callerId: sym.id, calleeIds: filtered });
-    }
-  }
+  for (const sym of symbols) {}
 
   return edgesFromCallerCallees(callerCallees);
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] BlockStatement
src/ddp/lspCallGraphAdapter.ts:25:32
   const callerCallees: { callerId: string; calleeIds: string[] }[] = [];
 
   for (const sym of symbols) {
-    if (adapter.isCancelled()) {
-      break;
-    }
+    if (adapter.isCancelled()) {}
     const calleeIds = await adapter.getOutgoingCalleeIds(sym.id);
     const filtered = calleeIds.filter((id) => id !== sym.id);
killedBy: collectCallEdgesFromWorkspace bugmagnet session 2026-04-15 complex interactions handles cancellation mid-way through outgoing call collection
statusReason: expected 3 to be less than 3

[Killed] ConditionalExpression
src/ddp/lspCallGraphAdapter.ts:25:9
   const callerCallees: { callerId: string; calleeIds: string[] }[] = [];
 
   for (const sym of symbols) {
-    if (adapter.isCancelled()) {
+    if (false) {
       break;
     }
killedBy: collectCallEdgesFromWorkspace bugmagnet session 2026-04-15 complex interactions handles cancellation mid-way through outgoing call collection
statusReason: expected 3 to be less than 3

[Killed] ConditionalExpression
src/ddp/lspCallGraphAdapter.ts:29:47
       break;
     }
     const calleeIds = await adapter.getOutgoingCalleeIds(sym.id);
-    const filtered = calleeIds.filter((id) => id !== sym.id);
+    const filtered = calleeIds.filter((id) => false);
     if (filtered.length) {
       callerCallees.push({ callerId: sym.id, calleeIds: filtered });
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] ArrowFunction
src/ddp/lspCallGraphAdapter.ts:29:39
       break;
     }
     const calleeIds = await adapter.getOutgoingCalleeIds(sym.id);
-    const filtered = calleeIds.filter((id) => id !== sym.id);
+    const filtered = calleeIds.filter(() => undefined);
     if (filtered.length) {
       callerCallees.push({ callerId: sym.id, calleeIds: filtered });
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] ConditionalExpression
src/ddp/lspCallGraphAdapter.ts:30:9
     }
     const calleeIds = await adapter.getOutgoingCalleeIds(sym.id);
     const filtered = calleeIds.filter((id) => id !== sym.id);
-    if (filtered.length) {
+    if (false) {
       callerCallees.push({ callerId: sym.id, calleeIds: filtered });
     }
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] BlockStatement
src/ddp/lspCallGraphAdapter.ts:30:26
     }
     const calleeIds = await adapter.getOutgoingCalleeIds(sym.id);
     const filtered = calleeIds.filter((id) => id !== sym.id);
-    if (filtered.length) {
-      callerCallees.push({ callerId: sym.id, calleeIds: filtered });
-    }
+    if (filtered.length) {}
   }
 
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]
