[Survived] StringLiteral
src/ddp/riskTreeProvider.ts:6:72
 import { sortSymbols, type SortField, symbolsForFile } from "../core/viewModel";
 import type { ExtensionState } from "./extensionState";
 
-const SORT_FIELD_LABELS: Record<SortField, string> = { f: "F", fPrime: "F′", g: "G", cc: "CC", crap: "CRAP" };
+const SORT_FIELD_LABELS: Record<SortField, string> = { f: "F", fPrime: "", g: "G", cc: "CC", crap: "CRAP" };
 
 export type RiskNode =

[Survived] StringLiteral
src/ddp/riskTreeProvider.ts:6:102
 import { sortSymbols, type SortField, symbolsForFile } from "../core/viewModel";
 import type { ExtensionState } from "./extensionState";
 
-const SORT_FIELD_LABELS: Record<SortField, string> = { f: "F", fPrime: "F′", g: "G", cc: "CC", crap: "CRAP" };
+const SORT_FIELD_LABELS: Record<SortField, string> = { f: "F", fPrime: "F′", g: "G", cc: "CC", crap: "" };
 
 export type RiskNode =

[Killed] BlockStatement
src/ddp/riskTreeProvider.ts:21:40
 
   constructor(private readonly state: ExtensionState) {}
 
-  setSortField(field: SortField): void {
-    this._sortField = field;
-    this._onDidChange.fire();
-  }
+  setSortField(field: SortField): void {}
 
   get sortField(): SortField {
killedBy: RiskTreeProvider sorting file description shows F′ label when sort field is fPrime
statusReason: expected 'max F≈2' to be 'max F′≈43' // Object.is equality

[Killed] BlockStatement
src/ddp/riskTreeProvider.ts:26:30
     this._onDidChange.fire();
   }
 
-  get sortField(): SortField {
-    return this._sortField;
-  }
+  get sortField(): SortField {}
 
   refresh(): void {
killedBy: RiskTreeProvider sorting exposes the current sort field via getter
statusReason: expected undefined to be 'f' // Object.is equality

[Killed] BlockStatement
src/ddp/riskTreeProvider.ts:30:19
     return this._sortField;
   }
 
-  refresh(): void {
-    this._onDidChange.fire();
-  }
+  refresh(): void {}
 
   getTreeItem(element: RiskNode): vscode.TreeItem {
killedBy: RiskTreeProvider refresh fires onDidChangeTreeData event
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] ConditionalExpression
src/ddp/riskTreeProvider.ts:35:9
   }
 
   getTreeItem(element: RiskNode): vscode.TreeItem {
-    if (element.type === "empty") {
+    if (true) {
       const item = new vscode.TreeItem(element.message, vscode.TreeItemCollapsibleState.None);
       item.iconPath = new vscode.ThemeIcon("info");
killedBy: RiskTreeProvider getTreeItem returns expanded TreeItem for file node with correct description
statusReason: expected undefined to be 'x.ts' // Object.is equality

[Killed] ConditionalExpression
src/ddp/riskTreeProvider.ts:35:9
   }
 
   getTreeItem(element: RiskNode): vscode.TreeItem {
-    if (element.type === "empty") {
+    if (false) {
       const item = new vscode.TreeItem(element.message, vscode.TreeItemCollapsibleState.None);
       item.iconPath = new vscode.ThemeIcon("info");
killedBy: RiskTreeProvider getTreeItem returns info TreeItem for empty node
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] StringLiteral
src/ddp/riskTreeProvider.ts:37:44
   getTreeItem(element: RiskNode): vscode.TreeItem {
     if (element.type === "empty") {
       const item = new vscode.TreeItem(element.message, vscode.TreeItemCollapsibleState.None);
-      item.iconPath = new vscode.ThemeIcon("info");
+      item.iconPath = new vscode.ThemeIcon("");
       return item;
     }
killedBy: RiskTreeProvider getTreeItem returns info TreeItem for empty node
statusReason: expected '' to be 'info' // Object.is equality

[Killed] ConditionalExpression
src/ddp/riskTreeProvider.ts:40:9
       item.iconPath = new vscode.ThemeIcon("info");
       return item;
     }
-    if (element.type === "scope") {
+    if (true) {
       const item = new vscode.TreeItem(element.label, vscode.TreeItemCollapsibleState.None);
       item.iconPath = new vscode.ThemeIcon("root-folder");
killedBy: RiskTreeProvider getTreeItem returns expanded TreeItem for file node with correct description
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/ddp/riskTreeProvider.ts:40:35
       item.iconPath = new vscode.ThemeIcon("info");
       return item;
     }
-    if (element.type === "scope") {
-      const item = new vscode.TreeItem(element.label, vscode.TreeItemCollapsibleState.None);
-      item.iconPath = new vscode.ThemeIcon("root-folder");
-      item.contextValue = "ddpScope";
-      return item;
-    }
+    if (element.type === "scope") {}
     if (element.type === "file") {
       const field = this._sortField;
killedBy: RiskTreeProvider scope context renders scope node with root-folder icon and non-collapsible state
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
src/ddp/riskTreeProvider.ts:46:34
       item.contextValue = "ddpScope";
       return item;
     }
-    if (element.type === "file") {
-      const field = this._sortField;
-      const label = SORT_FIELD_LABELS[field];
-      const maxVal = Math.max(
-        0,
-        ...symbolsForFile(element.uri, this.state.lastAnalysis?.symbols ?? []).map((s) => s[field])
-      );
-      const item = new vscode.TreeItem(element.label, vscode.TreeItemCollapsibleState.Expanded);
-      item.description = `max ${label}≈${maxVal.toFixed(0)}`;
-      item.iconPath = new vscode.ThemeIcon("file-code");
-      item.contextValue = "ddpFile";
-      item.command = {
-        command: "ddp.riskView.openFile",
-        title: "Open file",
-        arguments: [vscode.Uri.parse(element.uri)],
-      };
-      return item;
-    }
+    if (element.type === "file") {}
     const s = element.symbol;
     const item = new vscode.TreeItem(s.name, vscode.TreeItemCollapsibleState.None);
killedBy: RiskTreeProvider getTreeItem returns expanded TreeItem for file node with correct description
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
src/ddp/riskTreeProvider.ts:46:9
       item.contextValue = "ddpScope";
       return item;
     }
-    if (element.type === "file") {
+    if (false) {
       const field = this._sortField;
       const label = SORT_FIELD_LABELS[field];
killedBy: RiskTreeProvider getTreeItem returns expanded TreeItem for file node with correct description
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] MethodExpression
src/ddp/riskTreeProvider.ts:49:22
     if (element.type === "file") {
       const field = this._sortField;
       const label = SORT_FIELD_LABELS[field];
-      const maxVal = Math.max(
-        0,
-        ...symbolsForFile(element.uri, this.state.lastAnalysis?.symbols ?? []).map((s) => s[field])
-      );
+      const maxVal = Math.min(0, ...symbolsForFile(element.uri, this.state.lastAnalysis?.symbols ?? []).map(s => s[field]));
       const item = new vscode.TreeItem(element.label, vscode.TreeItemCollapsibleState.Expanded);
       item.description = `max ${label}≈${maxVal.toFixed(0)}`;
killedBy: RiskTreeProvider getTreeItem returns expanded TreeItem for file node with correct description
statusReason: expected 'max F≈0' to be 'max F≈43' // Object.is equality

[Killed] LogicalOperator
src/ddp/riskTreeProvider.ts:51:40
       const label = SORT_FIELD_LABELS[field];
       const maxVal = Math.max(
         0,
-        ...symbolsForFile(element.uri, this.state.lastAnalysis?.symbols ?? []).map((s) => s[field])
+        ...symbolsForFile(element.uri, this.state.lastAnalysis?.symbols && []).map((s) => s[field])
       );
       const item = new vscode.TreeItem(element.label, vscode.TreeItemCollapsibleState.Expanded);
killedBy: RiskTreeProvider getTreeItem returns expanded TreeItem for file node with correct description
statusReason: expected 'max F≈0' to be 'max F≈43' // Object.is equality

[Killed] ArrowFunction
src/ddp/riskTreeProvider.ts:51:84
       const label = SORT_FIELD_LABELS[field];
       const maxVal = Math.max(
         0,
-        ...symbolsForFile(element.uri, this.state.lastAnalysis?.symbols ?? []).map((s) => s[field])
+        ...symbolsForFile(element.uri, this.state.lastAnalysis?.symbols ?? []).map(() => undefined)
       );
       const item = new vscode.TreeItem(element.label, vscode.TreeItemCollapsibleState.Expanded);
killedBy: RiskTreeProvider getTreeItem returns expanded TreeItem for file node with correct description
statusReason: expected 'max F≈NaN' to be 'max F≈43' // Object.is equality

[Killed] ArithmeticOperator
src/ddp/riskTreeProvider.ts:66:84
     }
     const s = element.symbol;
     const item = new vscode.TreeItem(s.name, vscode.TreeItemCollapsibleState.None);
-    item.description = `F=${s.f.toFixed(1)}  R=${s.r.toFixed(2)}  CC=${s.cc}  T=${(s.t * 100).toFixed(0)}%`;
+    item.description = `F=${s.f.toFixed(1)}  R=${s.r.toFixed(2)}  CC=${s.cc}  T=${(s.t / 100).toFixed(0)}%`;
     item.tooltip = new vscode.MarkdownString(
       `**${s.name}**\n\nR=${s.r.toFixed(3)}  CRAP=${s.crap.toFixed(2)}  F=${s.f.toFixed(2)}`
killedBy: RiskTreeProvider getTreeItem returns non-collapsible TreeItem for symbol node with formatted metrics
statusReason: expected 'F=12.3  R=0.57  CC=5  T=0%' to be 'F=12.3  R=0.57  CC=5  T=80%' // Object.is equality

[Killed] StringLiteral
src/ddp/riskTreeProvider.ts:68:7
     const item = new vscode.TreeItem(s.name, vscode.TreeItemCollapsibleState.None);
     item.description = `F=${s.f.toFixed(1)}  R=${s.r.toFixed(2)}  CC=${s.cc}  T=${(s.t * 100).toFixed(0)}%`;
     item.tooltip = new vscode.MarkdownString(
-      `**${s.name}**\n\nR=${s.r.toFixed(3)}  CRAP=${s.crap.toFixed(2)}  F=${s.f.toFixed(2)}`
+      ``
     );
     item.command = {
killedBy: RiskTreeProvider getTreeItem sets tooltip as MarkdownString for symbol node
statusReason: expected '' to contain '**fn**'

[Killed] ObjectLiteral
src/ddp/riskTreeProvider.ts:70:20
     item.tooltip = new vscode.MarkdownString(
       `**${s.name}**\n\nR=${s.r.toFixed(3)}  CRAP=${s.crap.toFixed(2)}  F=${s.f.toFixed(2)}`
     );
-    item.command = {
-      command: "ddp.revealSymbol",
-      title: "Reveal symbol",
-      arguments: [s.id],
-    };
+    item.command = {};
     return item;
   }
killedBy: RiskTreeProvider getTreeItem sets command to ddp.revealSymbol with symbol id
statusReason: expected {} to deeply equal { command: 'ddp.revealSymbol', …(2) }

[Killed] StringLiteral
src/ddp/riskTreeProvider.ts:71:16
       `**${s.name}**\n\nR=${s.r.toFixed(3)}  CRAP=${s.crap.toFixed(2)}  F=${s.f.toFixed(2)}`
     );
     item.command = {
-      command: "ddp.revealSymbol",
+      command: "",
       title: "Reveal symbol",
       arguments: [s.id],
killedBy: RiskTreeProvider getTreeItem sets command to ddp.revealSymbol with symbol id
statusReason: expected { command: '', …(2) } to deeply equal { command: 'ddp.revealSymbol', …(2) }

[Killed] StringLiteral
src/ddp/riskTreeProvider.ts:72:14
     );
     item.command = {
       command: "ddp.revealSymbol",
-      title: "Reveal symbol",
+      title: "",
       arguments: [s.id],
     };
killedBy: RiskTreeProvider getTreeItem sets command to ddp.revealSymbol with symbol id
statusReason: expected { command: 'ddp.revealSymbol', …(2) } to deeply equal { command: 'ddp.revealSymbol', …(2) }

[Killed] ConditionalExpression
src/ddp/riskTreeProvider.ts:80:9
 
   async getChildren(element?: RiskNode): Promise<RiskNode[]> {
     const analysis = this.state.lastAnalysis;
-    if (!analysis?.symbols.length) {
+    if (true) {
       return element ? [] : [{ type: "empty" as const, message: "Run “DDP: Analyze workspace” (or Refresh)" }];
     }
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: expected [ undefined ] to deeply equal [ Array(3) ]

[Killed] BlockStatement
src/ddp/riskTreeProvider.ts:80:36
 
   async getChildren(element?: RiskNode): Promise<RiskNode[]> {
     const analysis = this.state.lastAnalysis;
-    if (!analysis?.symbols.length) {
-      return element ? [] : [{ type: "empty" as const, message: "Run “DDP: Analyze workspace” (or Refresh)" }];
-    }
+    if (!analysis?.symbols.length) {}
     if (!element) {
       const rootUri = this.state.lastScope?.rootUri;
killedBy: RiskTreeProvider getChildren returns empty-message node when no analysis exists
statusReason: Cannot read properties of undefined (reading 'symbols')

[Killed] ObjectLiteral
src/ddp/riskTreeProvider.ts:81:30
   async getChildren(element?: RiskNode): Promise<RiskNode[]> {
     const analysis = this.state.lastAnalysis;
     if (!analysis?.symbols.length) {
-      return element ? [] : [{ type: "empty" as const, message: "Run “DDP: Analyze workspace” (or Refresh)" }];
+      return element ? [] : [{}];
     }
     if (!element) {
killedBy: RiskTreeProvider getChildren returns empty-message node when no analysis exists
statusReason: expected undefined to be 'empty' // Object.is equality

[Killed] ArrayDeclaration
src/ddp/riskTreeProvider.ts:81:24
   async getChildren(element?: RiskNode): Promise<RiskNode[]> {
     const analysis = this.state.lastAnalysis;
     if (!analysis?.symbols.length) {
-      return element ? [] : [{ type: "empty" as const, message: "Run “DDP: Analyze workspace” (or Refresh)" }];
+      return element ? ["Stryker was here"] : [{ type: "empty" as const, message: "Run “DDP: Analyze workspace” (or Refresh)" }];
     }
     if (!element) {
killedBy: RiskTreeProvider getChildren returns empty array when element is provided but no analysis exists
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ConditionalExpression
src/ddp/riskTreeProvider.ts:83:9
     if (!analysis?.symbols.length) {
       return element ? [] : [{ type: "empty" as const, message: "Run “DDP: Analyze workspace” (or Refresh)" }];
     }
-    if (!element) {
+    if (true) {
       const rootUri = this.state.lastScope?.rootUri;
       const scopeLabel = rootUri
killedBy: RiskTreeProvider getChildren groups multiple symbols under the same file node
statusReason: Cannot read properties of undefined (reading 'f')

[Killed] BooleanLiteral
src/ddp/riskTreeProvider.ts:83:9
     if (!analysis?.symbols.length) {
       return element ? [] : [{ type: "empty" as const, message: "Run “DDP: Analyze workspace” (or Refresh)" }];
     }
-    if (!element) {
+    if (element) {
       const rootUri = this.state.lastScope?.rootUri;
       const scopeLabel = rootUri
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] OptionalChaining
src/ddp/riskTreeProvider.ts:84:23
       return element ? [] : [{ type: "empty" as const, message: "Run “DDP: Analyze workspace” (or Refresh)" }];
     }
     if (!element) {
-      const rootUri = this.state.lastScope?.rootUri;
+      const rootUri = this.state.lastScope.rootUri;
       const scopeLabel = rootUri
         ? vscode.Uri.parse(rootUri).fsPath
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: Cannot read properties of undefined (reading 'rootUri')

[Killed] StringLiteral
src/ddp/riskTreeProvider.ts:87:11
       const rootUri = this.state.lastScope?.rootUri;
       const scopeLabel = rootUri
         ? vscode.Uri.parse(rootUri).fsPath
-        : "workspace";
+        : "";
       const scopeNode: RiskNode = { type: "scope", label: scopeLabel };
       const byFile = new Map<string, SymbolMetrics[]>();
killedBy: RiskTreeProvider scope context includes a scope node as first root when analysis exists
statusReason: expected '' to be 'workspace' // Object.is equality

[Killed] ObjectLiteral
src/ddp/riskTreeProvider.ts:88:35
       const scopeLabel = rootUri
         ? vscode.Uri.parse(rootUri).fsPath
         : "workspace";
-      const scopeNode: RiskNode = { type: "scope", label: scopeLabel };
+      const scopeNode: RiskNode = {};
       const byFile = new Map<string, SymbolMetrics[]>();
       for (const s of analysis.symbols) {
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: expected [ undefined, 'file:///b.ts', …(2) ] to deeply equal [ Array(3) ]

[Killed] BlockStatement
src/ddp/riskTreeProvider.ts:90:41
         : "workspace";
       const scopeNode: RiskNode = { type: "scope", label: scopeLabel };
       const byFile = new Map<string, SymbolMetrics[]>();
-      for (const s of analysis.symbols) {
-        let list = byFile.get(s.uri);
-        if (!list) {
-          list = [];
-          byFile.set(s.uri, list);
-        }
-        list.push(s);
-      }
+      for (const s of analysis.symbols) {}
       const field = this._sortField;
       const files = [...byFile.entries()].sort((a, b) => {
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: expected [] to deeply equal [ Array(3) ]

[Killed] BooleanLiteral
src/ddp/riskTreeProvider.ts:92:13
       const byFile = new Map<string, SymbolMetrics[]>();
       for (const s of analysis.symbols) {
         let list = byFile.get(s.uri);
-        if (!list) {
+        if (list) {
           list = [];
           byFile.set(s.uri, list);
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
src/ddp/riskTreeProvider.ts:92:13
       const byFile = new Map<string, SymbolMetrics[]>();
       for (const s of analysis.symbols) {
         let list = byFile.get(s.uri);
-        if (!list) {
+        if (false) {
           list = [];
           byFile.set(s.uri, list);
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] MethodExpression
src/ddp/riskTreeProvider.ts:99:21
         list.push(s);
       }
       const field = this._sortField;
-      const files = [...byFile.entries()].sort((a, b) => {
-        const maxA = Math.max(...a[1].map((x) => x[field]));
-        const maxB = Math.max(...b[1].map((x) => x[field]));
-        return maxB - maxA;
-      });
+      const files = [...byFile.entries()];
       return [
         scopeNode,
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: expected [ Array(3) ] to deeply equal [ Array(3) ]

[Killed] BlockStatement
src/ddp/riskTreeProvider.ts:99:58
         list.push(s);
       }
       const field = this._sortField;
-      const files = [...byFile.entries()].sort((a, b) => {
-        const maxA = Math.max(...a[1].map((x) => x[field]));
-        const maxB = Math.max(...b[1].map((x) => x[field]));
-        return maxB - maxA;
-      });
+      const files = [...byFile.entries()].sort((a, b) => {});
       return [
         scopeNode,
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: expected [ Array(3) ] to deeply equal [ Array(3) ]

[Killed] ArrowFunction
src/ddp/riskTreeProvider.ts:100:43
       }
       const field = this._sortField;
       const files = [...byFile.entries()].sort((a, b) => {
-        const maxA = Math.max(...a[1].map((x) => x[field]));
+        const maxA = Math.max(...a[1].map(() => undefined));
         const maxB = Math.max(...b[1].map((x) => x[field]));
         return maxB - maxA;
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: expected [ Array(3) ] to deeply equal [ Array(3) ]

[Survived] MethodExpression
src/ddp/riskTreeProvider.ts:100:22
       }
       const field = this._sortField;
       const files = [...byFile.entries()].sort((a, b) => {
-        const maxA = Math.max(...a[1].map((x) => x[field]));
+        const maxA = Math.min(...a[1].map(x => x[field]));
         const maxB = Math.max(...b[1].map((x) => x[field]));
         return maxB - maxA;

[Killed] ArrowFunction
src/ddp/riskTreeProvider.ts:101:43
       const field = this._sortField;
       const files = [...byFile.entries()].sort((a, b) => {
         const maxA = Math.max(...a[1].map((x) => x[field]));
-        const maxB = Math.max(...b[1].map((x) => x[field]));
+        const maxB = Math.max(...b[1].map(() => undefined));
         return maxB - maxA;
       });
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: expected [ Array(3) ] to deeply equal [ Array(3) ]

[Killed] MethodExpression
src/ddp/riskTreeProvider.ts:101:22
       const field = this._sortField;
       const files = [...byFile.entries()].sort((a, b) => {
         const maxA = Math.max(...a[1].map((x) => x[field]));
-        const maxB = Math.max(...b[1].map((x) => x[field]));
+        const maxB = Math.min(...b[1].map(x => x[field]));
         return maxB - maxA;
       });
killedBy: RiskTreeProvider getChildren sorts files correctly when multiple symbols per file have different F
statusReason: expected 'file:///b.ts' to be 'file:///a.ts' // Object.is equality

[Killed] ArithmeticOperator
src/ddp/riskTreeProvider.ts:102:16
       const files = [...byFile.entries()].sort((a, b) => {
         const maxA = Math.max(...a[1].map((x) => x[field]));
         const maxB = Math.max(...b[1].map((x) => x[field]));
-        return maxB - maxA;
+        return maxB + maxA;
       });
       return [
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: expected [ Array(3) ] to deeply equal [ Array(3) ]

[Killed] ArrayDeclaration
src/ddp/riskTreeProvider.ts:104:14
         const maxB = Math.max(...b[1].map((x) => x[field]));
         return maxB - maxA;
       });
-      return [
-        scopeNode,
-        ...files.map(([uri]) => ({
-          type: "file" as const,
-          uri,
-          label: vscode.Uri.parse(uri).fsPath.split(/[/\\]/).pop() ?? uri,
-        })),
-      ];
+      return [];
     }
     if (element.type === "file") {
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: expected [] to deeply equal [ Array(3) ]

[Killed] ArrowFunction
src/ddp/riskTreeProvider.ts:106:22
       });
       return [
         scopeNode,
-        ...files.map(([uri]) => ({
-          type: "file" as const,
-          uri,
-          label: vscode.Uri.parse(uri).fsPath.split(/[/\\]/).pop() ?? uri,
-        })),
+        ...files.map(() => undefined),
       ];
     }
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ObjectLiteral
src/ddp/riskTreeProvider.ts:106:34
       });
       return [
         scopeNode,
-        ...files.map(([uri]) => ({
-          type: "file" as const,
-          uri,
-          label: vscode.Uri.parse(uri).fsPath.split(/[/\\]/).pop() ?? uri,
-        })),
+        ...files.map(([uri]) => ({})),
       ];
     }
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: expected [ undefined, undefined, undefined ] to deeply equal [ Array(3) ]

[Killed] LogicalOperator
src/ddp/riskTreeProvider.ts:109:18
         ...files.map(([uri]) => ({
           type: "file" as const,
           uri,
-          label: vscode.Uri.parse(uri).fsPath.split(/[/\\]/).pop() ?? uri,
+          label: vscode.Uri.parse(uri).fsPath.split(/[/\\]/).pop() && uri,
         })),
       ];
killedBy: RiskTreeProvider getChildren extracts filename from URI as label for file nodes
statusReason: expected 'file:///path/to/deep/module.ts' to be 'module.ts' // Object.is equality

[Killed] BlockStatement
src/ddp/riskTreeProvider.ts:113:34
         })),
       ];
     }
-    if (element.type === "file") {
-      const list = sortSymbols(symbolsForFile(element.uri, analysis.symbols), this._sortField);
-      return list.map((symbol) => ({ type: "symbol" as const, symbol }));
-    }
+    if (element.type === "file") {}
     return [];
   }
killedBy: RiskTreeProvider getChildren groups multiple symbols under the same file node
statusReason: expected [] to have a length of 2 but got +0

[Killed] ArrowFunction
src/ddp/riskTreeProvider.ts:115:23
     }
     if (element.type === "file") {
       const list = sortSymbols(symbolsForFile(element.uri, analysis.symbols), this._sortField);
-      return list.map((symbol) => ({ type: "symbol" as const, symbol }));
+      return list.map(() => undefined);
     }
     return [];
killedBy: RiskTreeProvider getChildren groups multiple symbols under the same file node
statusReason: Cannot read properties of undefined (reading 'symbol')
