[Killed] BlockStatement
src/ddp/symbolId.ts:3:84
 import * as vscode from "vscode";
 
-export function symbolIdFromUriRange(uri: vscode.Uri, range: vscode.Range): string {
-  const s = range.start;
-  return `${uri.toString()}#${s.line}:${s.character}`;
-}
+export function symbolIdFromUriRange(uri: vscode.Uri, range: vscode.Range): string {}
 
 export function parseUriFromSymbolId(id: string): vscode.Uri | undefined {
killedBy: collectCallEdgesFromWorkspace test file filtering filters out test files and slices to maxFiles when excludeTests is true
statusReason: Cannot read properties of undefined (reading 'indexOf')

[Killed] StringLiteral
src/ddp/symbolId.ts:5:10
 
 export function symbolIdFromUriRange(uri: vscode.Uri, range: vscode.Range): string {
   const s = range.start;
-  return `${uri.toString()}#${s.line}:${s.character}`;
+  return ``;
 }
 
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] BlockStatement
src/ddp/symbolId.ts:8:74
   return `${uri.toString()}#${s.line}:${s.character}`;
 }
 
-export function parseUriFromSymbolId(id: string): vscode.Uri | undefined {
-  const hash = id.indexOf("#");
-  if (hash <= 0) {
-    return undefined;
-  }
-  try {
-    return vscode.Uri.parse(id.slice(0, hash));
-  } catch {
-    return undefined;
-  }
-}
+export function parseUriFromSymbolId(id: string): vscode.Uri | undefined {}
 
killedBy: parseUriFromSymbolId extracts URI from a valid symbolId
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/ddp/symbolId.ts:10:7
 
 export function parseUriFromSymbolId(id: string): vscode.Uri | undefined {
   const hash = id.indexOf("#");
-  if (hash <= 0) {
+  if (true) {
     return undefined;
   }
killedBy: parseUriFromSymbolId extracts URI from a valid symbolId
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/ddp/symbolId.ts:10:7
 
 export function parseUriFromSymbolId(id: string): vscode.Uri | undefined {
   const hash = id.indexOf("#");
-  if (hash <= 0) {
+  if (hash < 0) {
     return undefined;
   }
killedBy: parseUriFromSymbolId returns undefined when hash is at position 0
statusReason: expected { toString: [Function toString], …(1) } to be undefined

[Killed] BlockStatement
src/ddp/symbolId.ts:13:7
   if (hash <= 0) {
     return undefined;
   }
-  try {
-    return vscode.Uri.parse(id.slice(0, hash));
-  } catch {
+  try {} catch {
     return undefined;
   }
killedBy: parseUriFromSymbolId extracts URI from a valid symbolId
statusReason: expected undefined to be defined

[Killed] MethodExpression
src/ddp/symbolId.ts:14:29
     return undefined;
   }
   try {
-    return vscode.Uri.parse(id.slice(0, hash));
+    return vscode.Uri.parse(id);
   } catch {
     return undefined;
killedBy: parseUriFromSymbolId extracts URI from a valid symbolId
statusReason: expected 'file:///src/app.ts#10:5' to be 'file:///src/app.ts' // Object.is equality

[Survived] BlockStatement
src/ddp/symbolId.ts:15:11
   }
   try {
     return vscode.Uri.parse(id.slice(0, hash));
-  } catch {
-    return undefined;
-  }
+  } catch {}
 }
 
