[Killed] LogicalOperator
src/core/lspCallGraphParsing.ts:18:37
   const rest = symbolId.slice(hash + 1);
   const parts = rest.split(":");
   const line = Number.parseInt(parts[0] ?? "", 10);
-  const character = Number.parseInt(parts[1] ?? "", 10);
+  const character = Number.parseInt(parts[1] && "", 10);
   if (Number.isNaN(line) || Number.isNaN(character)) {
     return undefined;
killedBy: parseSymbolIdParts returns uri, line, and character for a valid symbolId
statusReason: expected undefined to deeply equal { uriStr: 'file:///a.ts', …(2) }

[Killed] ConditionalExpression
src/core/lspCallGraphParsing.ts:19:7
   const parts = rest.split(":");
   const line = Number.parseInt(parts[0] ?? "", 10);
   const character = Number.parseInt(parts[1] ?? "", 10);
-  if (Number.isNaN(line) || Number.isNaN(character)) {
+  if (true) {
     return undefined;
   }
killedBy: parseSymbolIdParts returns uri, line, and character for a valid symbolId
statusReason: expected undefined to deeply equal { uriStr: 'file:///a.ts', …(2) }

[Killed] BlockStatement
src/core/lspCallGraphParsing.ts:19:54
   const parts = rest.split(":");
   const line = Number.parseInt(parts[0] ?? "", 10);
   const character = Number.parseInt(parts[1] ?? "", 10);
-  if (Number.isNaN(line) || Number.isNaN(character)) {
-    return undefined;
-  }
+  if (Number.isNaN(line) || Number.isNaN(character)) {}
   return { uriStr, line, character };
 }
killedBy: parseSymbolIdParts returns undefined when line is non-numeric
statusReason: expected { uriStr: 'file:///a.ts', …(2) } to be undefined
