[Survived] ConditionalExpression
src/ddp/analysisOrchestrator.ts:98:9
     symbols: SymbolMetrics[],
     config: DdpConfiguration
   ): Promise<SymbolMetrics[]> {
-    if (!config.churn.enabled) {
+    if (false) {
       return symbols;
     }

[Survived] BlockStatement
src/ddp/analysisOrchestrator.ts:146:28
     }
 
     const functions = await symbolProvider.getFunctionSymbols(uri);
-    if (!functions.length) {
-      return [];
-    }
+    if (!functions.length) {}
 
     const ccProvider = ccRegistry.getForLanguage(doc.languageId);

[Survived] ConditionalExpression
src/ddp/analysisOrchestrator.ts:185:7
   const line1 = fn.selectionStartLine + 1;
 
   // Try line-based CC (ESLint for TS/JS, PMD for Java)
-  if (ccResult.byLine.size) {
+  if (true) {
     const fromLine = ccResult.byLine.get(line1);
     if (fromLine !== undefined) {

[Killed] BlockStatement
src/ddp/analysisOrchestrator.ts:187:33
   // Try line-based CC (ESLint for TS/JS, PMD for Java)
   if (ccResult.byLine.size) {
     const fromLine = ccResult.byLine.get(line1);
-    if (fromLine !== undefined) {
-      return fromLine;
-    }
+    if (fromLine !== undefined) {}
   }
 
killedBy: AnalysisOrchestrator uses tool-specific CC when available
statusReason: expected 2 to be 15 // Object.is equality

[Survived] ConditionalExpression
src/ddp/analysisOrchestrator.ts:193:7
   }
 
   // Try name-based CC (Radon for Python)
-  if (ccResult.byName.size) {
+  if (true) {
     const key = `${line1}:${fn.name}`;
     const fromName = ccResult.byName.get(key);

[Killed] BlockStatement
src/ddp/analysisOrchestrator.ts:196:33
   if (ccResult.byName.size) {
     const key = `${line1}:${fn.name}`;
     const fromName = ccResult.byName.get(key);
-    if (fromName !== undefined) {
-      return fromName;
-    }
+    if (fromName !== undefined) {}
   }
 
killedBy: AnalysisOrchestrator uses name-based CC when line-based has no match
statusReason: expected 1 to be 8 // Object.is equality
