[Killed] StringLiteral
src/ddp/riskTreeProvider.ts:81:65
   async getChildren(element?: RiskNode): Promise<RiskNode[]> {
     const analysis = this.state.lastAnalysis;
     if (!analysis?.symbols.length) {
-      return element ? [] : [{ type: "empty" as const, message: "Run “DDP: Analyze workspace” (or Refresh)" }];
+      return element ? [] : [{ type: "empty" as const, message: "" }];
     }
     if (!element) {
killedBy: RiskTreeProvider getChildren returns empty-message node when no analysis exists
statusReason: expected '' to contain 'Analyze workspace'

[Survived] ConditionalExpression
src/ddp/riskTreeProvider.ts:92:13
       const byFile = new Map<string, SymbolMetrics[]>();
       for (const s of analysis.symbols) {
         let list = byFile.get(s.uri);
-        if (!list) {
+        if (true) {
           list = [];
           byFile.set(s.uri, list);
