[Killed] BlockStatement
src/core/jacocoParse.ts:36:61
 
     let sfMatch: RegExpExecArray | null;
     sourcefileRe.lastIndex = 0;
-    while ((sfMatch = sourcefileRe.exec(pkgBody)) !== null) {
-      const sfName = sfMatch[1];
-      const sfBody = sfMatch[2];
-      const fileKey = pkgName ? `${pkgName}/${sfName}` : sfName;
-
-      const stmts: StatementCover[] = [];
-      let lineMatch: RegExpExecArray | null;
-      lineRe.lastIndex = 0;
-      while ((lineMatch = lineRe.exec(sfBody)) !== null) {
-        const nr = parseInt(lineMatch[1], 10);
-        const ci = parseInt(lineMatch[3], 10);
-        if (Number.isNaN(nr) || Number.isNaN(ci) || nr < 1) {
-          continue;
-        }
-        stmts.push({
-          executed: ci > 0,
-          startLine: nr - 1,
-          endLine: nr - 1,
-        });
-      }
-
-      if (stmts.length > 0) {
-        byFile.set(fileKey, stmts);
-      }
-    }
+    while ((sfMatch = sourcefileRe.exec(pkgBody)) !== null) {}
   }
 
killedBy: loadJacocoIntoStore parses JaCoCo XML and ingests line coverage into store
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/core/jacocoParse.ts:44:58
       const stmts: StatementCover[] = [];
       let lineMatch: RegExpExecArray | null;
       lineRe.lastIndex = 0;
-      while ((lineMatch = lineRe.exec(sfBody)) !== null) {
-        const nr = parseInt(lineMatch[1], 10);
-        const ci = parseInt(lineMatch[3], 10);
-        if (Number.isNaN(nr) || Number.isNaN(ci) || nr < 1) {
-          continue;
-        }
-        stmts.push({
-          executed: ci > 0,
-          startLine: nr - 1,
-          endLine: nr - 1,
-        });
-      }
+      while ((lineMatch = lineRe.exec(sfBody)) !== null) {}
 
       if (stmts.length > 0) {
killedBy: parseJacocoToStatementCovers parses a single sourcefile with line elements
statusReason: expected undefined to be defined
