[Killed] MethodExpression
src/core/lcovParse.ts:12:9
   let currentFile = "";
   const lines = lcovText.split(/\r?\n/);
   for (const line of lines) {
-    if (line.startsWith("SF:")) {
+    if (line.endsWith("SF:")) {
       currentFile = line.slice(3).trim();
       continue;
killedBy: parseLcovToStatementCovers parses SF and DA records with 1-based lines
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/core/lcovParse.ts:20:9
       currentFile = "";
       continue;
     }
-    if (!currentFile || !line.startsWith("DA:")) {
+    if (false) {
       continue;
     }
killedBy: parseLcovToStatementCovers ignores DA lines before any SF block
statusReason: expected 2 to deeply equal 1

[Killed] ConditionalExpression
src/core/lcovParse.ts:30:9
     }
     const lineNo = parseInt(rest.slice(0, comma), 10);
     const hits = parseInt(rest.slice(comma + 1), 10);
-    if (Number.isNaN(lineNo) || Number.isNaN(hits) || lineNo < 1) {
+    if (false) {
       continue;
     }
killedBy: parseLcovToStatementCovers skips DA line with non-numeric line number
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/core/lcovParse.ts:54:27
   maps: ReadonlyArray<Map<string, StatementCover[]>>
 ): Map<string, StatementCover[]> {
   const out = new Map<string, StatementCover[]>();
-  for (const map of maps) {
-    for (const [filePath, stmts] of map) {
-      const cur = out.get(filePath);
-      out.set(filePath, cur ? [...cur, ...stmts] : [...stmts]);
-    }
-  }
+  for (const map of maps) {}
   return out;
 }
killedBy: mergeLcovMaps returns copy of single map
statusReason: expected undefined to deeply equal [ { executed: true, …(2) } ]

[Killed] BlockStatement
src/core/lcovParse.ts:55:42
 ): Map<string, StatementCover[]> {
   const out = new Map<string, StatementCover[]>();
   for (const map of maps) {
-    for (const [filePath, stmts] of map) {
-      const cur = out.get(filePath);
-      out.set(filePath, cur ? [...cur, ...stmts] : [...stmts]);
-    }
+    for (const [filePath, stmts] of map) {}
   }
   return out;
killedBy: mergeLcovMaps returns copy of single map
statusReason: expected undefined to deeply equal [ { executed: true, …(2) } ]

[Killed] ArrayDeclaration
src/core/lcovParse.ts:57:52
   for (const map of maps) {
     for (const [filePath, stmts] of map) {
       const cur = out.get(filePath);
-      out.set(filePath, cur ? [...cur, ...stmts] : [...stmts]);
+      out.set(filePath, cur ? [...cur, ...stmts] : []);
     }
   }
killedBy: mergeLcovMaps returns copy of single map
statusReason: expected [] to deeply equal [ { executed: true, …(2) } ]
