[Killed] ConditionalExpression
src/core/rollup.ts:21:9
   const riskByFile = new Map<string, number[]>();
   for (const row of rows) {
     let values = riskByFile.get(row.uri);
-    if (!values) {
+    if (true) {
       values = [];
       riskByFile.set(row.uri, values);
killedBy: AnalysisOrchestrator respects rollup mode from configuration
statusReason: expected 2 to be close to 4, received difference is 2, but expected 0.000005
