[Killed] ConditionalExpression
src/ddp/cc/eslintComplexity.ts:5:5
 
 export function isJsLanguage(languageId: string): boolean {
   return (
-    languageId === "javascript" ||
-    languageId === "typescript" ||
-    languageId === "javascriptreact" ||
-    languageId === "typescriptreact"
+    false
   );
 }
killedBy: eslintCcForFile isJsLanguage accepts all four JS/TS language IDs and rejects others
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ddp/cc/eslintComplexity.ts:5:5
 
 export function isJsLanguage(languageId: string): boolean {
   return (
-    languageId === "javascript" ||
-    languageId === "typescript" ||
-    languageId === "javascriptreact" ||
+    false ||
     languageId === "typescriptreact"
   );
killedBy: eslintCcForFile isJsLanguage accepts all four JS/TS language IDs and rejects others
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/ddp/cc/eslintComplexity.ts:7:20
   return (
     languageId === "javascript" ||
     languageId === "typescript" ||
-    languageId === "javascriptreact" ||
+    languageId === "" ||
     languageId === "typescriptreact"
   );
killedBy: eslintCcForFile isJsLanguage accepts all four JS/TS language IDs and rejects others
statusReason: expected false to be true // Object.is equality
