[Killed] StringLiteral
src/ddp/churn/gitSpawn.ts:5:5
 
 export function runGitLog(repoRoot: string, since: Date, timeoutMs: number): Promise<string> {
   return spawnAndCollect(
-    "git",
+    "",
     ["log", "--name-only", "--pretty=format:", `--since=${since.toISOString()}`, "--diff-filter=ACDMR"],
     repoRoot,
killedBy: runGitLog (integration) returns non-empty output for recent history
statusReason: The argument 'file' cannot be empty. Received ''

[Killed] StringLiteral
src/ddp/churn/gitSpawn.ts:6:82
 export function runGitLog(repoRoot: string, since: Date, timeoutMs: number): Promise<string> {
   return spawnAndCollect(
     "git",
-    ["log", "--name-only", "--pretty=format:", `--since=${since.toISOString()}`, "--diff-filter=ACDMR"],
+    ["log", "--name-only", "--pretty=format:", `--since=${since.toISOString()}`, ""],
     repoRoot,
     timeoutMs
killedBy: runGitLog (integration) returns non-empty output for recent history
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/ddp/churn/gitSpawn.ts:6:28
 export function runGitLog(repoRoot: string, since: Date, timeoutMs: number): Promise<string> {
   return spawnAndCollect(
     "git",
-    ["log", "--name-only", "--pretty=format:", `--since=${since.toISOString()}`, "--diff-filter=ACDMR"],
+    ["log", "--name-only", "", `--since=${since.toISOString()}`, "--diff-filter=ACDMR"],
     repoRoot,
     timeoutMs
killedBy: runGitLog (integration) returns non-empty output for recent history
statusReason: expected 0 to be greater than 0
