[Killed] ConditionalExpression
src/ddp/documentSymbols.ts:10:7
 ): vscode.DocumentSymbol[] {
   for (const s of symbols) {
     if (
-      s.kind === vscode.SymbolKind.Function ||
-      s.kind === vscode.SymbolKind.Method ||
-      s.kind === vscode.SymbolKind.Constructor
+      false
     ) {
       out.push(s);
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] ConditionalExpression
src/ddp/documentSymbols.ts:10:7
 ): vscode.DocumentSymbol[] {
   for (const s of symbols) {
     if (
-      s.kind === vscode.SymbolKind.Function ||
-      s.kind === vscode.SymbolKind.Method ||
+      false ||
       s.kind === vscode.SymbolKind.Constructor
     ) {
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Survived] StringLiteral
src/ddp/documentSymbols.ts:32:19
       uri
     );
   } catch (e) {
-    console.debug(`[DDP] executeDocumentSymbolProvider failed for ${uri.toString()}:`, e);
+    console.debug(``, e);
   }
   return syms?.length ? flattenFunctionSymbols(syms) : [];
