[Killed] BlockStatement
src/ddp/revealSymbol.ts:5:67
 import { parseUriFromSymbolId } from "./symbolId";
 import { openDocument } from "./editor";
 
-export async function revealSymbolById(id: string): Promise<void> {
-  const hash = id.indexOf("#");
-  if (hash <= 0) {
-    return;
-  }
-  const uri = parseUriFromSymbolId(id);
-  if (!uri) {
-    return;
-  }
-  const rest = id.slice(hash + 1);
-  const parts = rest.split(":");
-  const line = parseInt(parts[0] ?? "", 10);
-  const character = parseInt(parts[1] ?? "", 10);
-  let selection: vscode.Range | undefined;
-  if (!Number.isNaN(line) && !Number.isNaN(character)) {
-    const p = new vscode.Position(line, character);
-    selection = new vscode.Range(p, p);
-  }
-  await openDocument(uri, selection);
-}
+export async function revealSymbolById(id: string): Promise<void> {}
 
killedBy: revealSymbolById early returns — no document opened returns without opening document when parseUriFromSymbolId returns undefined
statusReason: expected "vi.fn()" to be called with arguments: [ 'bad\u0000uri#1:2' ]

Number of calls: 0

[Killed] LogicalOperator
src/ddp/revealSymbol.ts:17:30
   const rest = id.slice(hash + 1);
   const parts = rest.split(":");
   const line = parseInt(parts[0] ?? "", 10);
-  const character = parseInt(parts[1] ?? "", 10);
+  const character = parseInt(parts[1] && "", 10);
   let selection: vscode.Range | undefined;
   if (!Number.isNaN(line) && !Number.isNaN(character)) {
killedBy: revealSymbolById valid id with line and character opens document and shows it with selection for valid id
statusReason: expected "vi.fn()" to be called with arguments: [ { uri: { …(2) } }, …(1) ]

Received:

  1st vi.fn() call:

@@ -3,18 +3,7 @@
      "uri": {

[Killed] BlockStatement
src/ddp/revealSymbol.ts:19:56
   const line = parseInt(parts[0] ?? "", 10);
   const character = parseInt(parts[1] ?? "", 10);
   let selection: vscode.Range | undefined;
-  if (!Number.isNaN(line) && !Number.isNaN(character)) {
-    const p = new vscode.Position(line, character);
-    selection = new vscode.Range(p, p);
-  }
+  if (!Number.isNaN(line) && !Number.isNaN(character)) {}
   await openDocument(uri, selection);
 }
killedBy: revealSymbolById valid id with line and character opens document and shows it with selection for valid id
statusReason: expected "vi.fn()" to be called with arguments: [ { uri: { …(2) } }, …(1) ]

Received:

  1st vi.fn() call:

@@ -3,18 +3,7 @@
      "uri": {

[Killed] ConditionalExpression
src/ddp/revealSymbol.ts:19:7
   const line = parseInt(parts[0] ?? "", 10);
   const character = parseInt(parts[1] ?? "", 10);
   let selection: vscode.Range | undefined;
-  if (!Number.isNaN(line) && !Number.isNaN(character)) {
+  if (true) {
     const p = new vscode.Position(line, character);
     selection = new vscode.Range(p, p);
killedBy: revealSymbolById shows document without selection when position is unparseable passes empty options when line is non-numeric
statusReason: expected "vi.fn()" to be called with arguments: [ { uri: { …(2) } }, {} ]

Received:

  1st vi.fn() call:

@@ -3,7 +3,18 @@
      "uri": {
