[Killed] Regex
src/ddp/cc/pmdParse.ts:22:23
  */
 export function parsePmdCyclomaticXml(xmlText: string): Map<number, number> {
   const byLine = new Map<number, number>();
-  const violationRe = /<violation\s([^>]*)>([\s\S]*?)<\/violation>/gi;
+  const violationRe = /<violation\s([^>]*)>([\s\S])<\/violation>/gi;
   const beginlineRe = /\bbeginline="(\d+)"/i;
   const ruleRe = /\brule="[a-z]*cyclomatic[a-z]*"/i;
killedBy: runPmdCyclomaticComplexity returns parsed map when PMD produces valid XML output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] Regex
src/ddp/cc/pmdParse.ts:22:23
  */
 export function parsePmdCyclomaticXml(xmlText: string): Map<number, number> {
   const byLine = new Map<number, number>();
-  const violationRe = /<violation\s([^>]*)>([\s\S]*?)<\/violation>/gi;
+  const violationRe = /<violation\s([>]*)>([\s\S]*?)<\/violation>/gi;
   const beginlineRe = /\bbeginline="(\d+)"/i;
   const ruleRe = /\brule="[a-z]*cyclomatic[a-z]*"/i;
killedBy: runPmdCyclomaticComplexity returns parsed map when PMD produces valid XML output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] Regex
src/ddp/cc/pmdParse.ts:24:18
   const byLine = new Map<number, number>();
   const violationRe = /<violation\s([^>]*)>([\s\S]*?)<\/violation>/gi;
   const beginlineRe = /\bbeginline="(\d+)"/i;
-  const ruleRe = /\brule="[a-z]*cyclomatic[a-z]*"/i;
+  const ruleRe = /\brule="[a-z]*cyclomatic[a-z]"/i;
 
   let match: RegExpExecArray | null;
killedBy: parsePmdCyclomaticXml parses a single CyclomaticComplexity violation
statusReason: expected undefined to be 7 // Object.is equality

[Killed] BlockStatement
src/ddp/cc/pmdParse.ts:27:56
   const ruleRe = /\brule="[a-z]*cyclomatic[a-z]*"/i;
 
   let match: RegExpExecArray | null;
-  while ((match = violationRe.exec(xmlText)) !== null) {
-    const attrs = match[1];
-    const body = match[2];
-    if (!ruleRe.test(attrs)) {
-      continue;
-    }
-    const lineMatch = beginlineRe.exec(attrs);
-    if (!lineMatch) {
-      continue;
-    }
-    const line = Number.parseInt(lineMatch[1], 10);
-    const cc = parseComplexityFromMessage(body);
-    if (!Number.isNaN(line) && cc !== undefined) {
-      const prev = byLine.get(line) ?? 0;
-      byLine.set(line, Math.max(prev, cc));
-    }
-  }
+  while ((match = violationRe.exec(xmlText)) !== null) {}
   return byLine;
 }
killedBy: parsePmdCyclomaticXml parses a single CyclomaticComplexity violation
statusReason: expected undefined to be 7 // Object.is equality

[Killed] BlockStatement
src/ddp/cc/pmdParse.ts:39:50
     }
     const line = Number.parseInt(lineMatch[1], 10);
     const cc = parseComplexityFromMessage(body);
-    if (!Number.isNaN(line) && cc !== undefined) {
-      const prev = byLine.get(line) ?? 0;
-      byLine.set(line, Math.max(prev, cc));
-    }
+    if (!Number.isNaN(line) && cc !== undefined) {}
   }
   return byLine;
killedBy: parsePmdCyclomaticXml parses a single CyclomaticComplexity violation
statusReason: expected undefined to be 7 // Object.is equality

[Killed] BooleanLiteral
src/ddp/cc/pmdParse.ts:39:9
     }
     const line = Number.parseInt(lineMatch[1], 10);
     const cc = parseComplexityFromMessage(body);
-    if (!Number.isNaN(line) && cc !== undefined) {
+    if (Number.isNaN(line) && cc !== undefined) {
       const prev = byLine.get(line) ?? 0;
       byLine.set(line, Math.max(prev, cc));
killedBy: parsePmdCyclomaticXml parses a single CyclomaticComplexity violation
statusReason: expected undefined to be 7 // Object.is equality
