[Survived] ConditionalExpression
src/ddp/cc/radonParse.ts:16:11
         continue;
       }
       const blocks = root[filePath];
-      if (!Array.isArray(blocks)) {
+      if (false) {
         continue;
       }

[Killed] BlockStatement
src/ddp/cc/radonParse.ts:20:109
         continue;
       }
       for (const b of blocks as { name?: string; lineno?: number; complexity?: number }[]) {
-        if (typeof b.name === "string" && typeof b.complexity === "number" && typeof b.lineno === "number") {
-          const key = `${b.lineno}:${b.name}`;
-          out.set(key, b.complexity);
-        }
+        if (typeof b.name === "string" && typeof b.complexity === "number" && typeof b.lineno === "number") {}
       }
     }
killedBy: parseRadonCcJson reads function blocks with lineno name complexity
statusReason: expected undefined to be 4 // Object.is equality
