[Survived] BlockStatement
src/ddp/cc/eslintParse.ts:9:30
   const byLine = new Map<number, number>();
   try {
     const arr = JSON.parse(jsonText) as EslintJson[];
-    if (!Array.isArray(arr)) {
-      return byLine;
-    }
+    if (!Array.isArray(arr)) {}
     for (const file of arr) {
       for (const msg of file.messages ?? []) {

[Survived] ConditionalExpression
src/ddp/cc/eslintParse.ts:9:9
   const byLine = new Map<number, number>();
   try {
     const arr = JSON.parse(jsonText) as EslintJson[];
-    if (!Array.isArray(arr)) {
+    if (false) {
       return byLine;
     }

[Killed] ConditionalExpression
src/ddp/cc/eslintParse.ts:16:12
       for (const msg of file.messages ?? []) {
         const rid = msg.ruleId ?? "";
         if (
-          (rid !== "complexity" && rid !== "@typescript-eslint/complexity") ||
+          (true && rid !== "@typescript-eslint/complexity") ||
           typeof msg.line !== "number"
         ) {
killedBy: runEslintComplexity returns parsed map when ESLint produces valid JSON output
statusReason: expected undefined to be 7 // Object.is equality

[Killed] EqualityOperator
src/ddp/cc/eslintParse.ts:16:36
       for (const msg of file.messages ?? []) {
         const rid = msg.ruleId ?? "";
         if (
-          (rid !== "complexity" && rid !== "@typescript-eslint/complexity") ||
+          (rid !== "complexity" && rid === "@typescript-eslint/complexity") ||
           typeof msg.line !== "number"
         ) {
killedBy: parseEslintComplexityJson skips messages with non-complexity ruleId
statusReason: expected 1 to be +0 // Object.is equality

[NoCoverage] StringLiteral
src/ddp/cc/eslintParse.ts:21:61
         ) {
           continue;
         }
-        const n = parseComplexityFromMessage(msg.message ?? "");
+        const n = parseComplexityFromMessage(msg.message ?? "Stryker was here!");
         if (n !== undefined) {
           const prev = byLine.get(msg.line) ?? 0;
