[Killed] BooleanLiteral
src/ddp/spawnCollect.ts:10:62
   timeoutMs: number
 ): Promise<string> {
   return new Promise((resolve) => {
-    const proc = cp.spawn(command, args, { cwd, windowsHide: true });
+    const proc = cp.spawn(command, args, { cwd, windowsHide: false });
     let stdout = "";
     let isResolved = false;
killedBy: runRadonCc passes correct arguments to cp.spawn
statusReason: expected "vi.fn()" to be called with arguments: [ '/usr/bin/python3', …(2) ]

Received:

  1st vi.fn() call:

@@ -7,8 +7,8 @@
      "-j",

[Killed] BooleanLiteral
src/ddp/spawnCollect.ts:12:22
   return new Promise((resolve) => {
     const proc = cp.spawn(command, args, { cwd, windowsHide: true });
     let stdout = "";
-    let isResolved = false;
+    let isResolved = true;
     const finish = (output: string) => {
       if (!isResolved) {
killedBy: runGitLog (integration) returns non-empty output for recent history
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/ddp/spawnCollect.ts:13:40
     const proc = cp.spawn(command, args, { cwd, windowsHide: true });
     let stdout = "";
     let isResolved = false;
-    const finish = (output: string) => {
-      if (!isResolved) {
-        isResolved = true;
-        resolve(output);
-      }
-    };
+    const finish = (output: string) => {};
     const t = setTimeout(() => {
       proc.kill();
killedBy: runEslintComplexity returns parsed map when ESLint produces valid JSON output
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/ddp/spawnCollect.ts:14:24
     let stdout = "";
     let isResolved = false;
     const finish = (output: string) => {
-      if (!isResolved) {
-        isResolved = true;
-        resolve(output);
-      }
+      if (!isResolved) {}
     };
     const t = setTimeout(() => {
killedBy: runRadonCc returns parsed map when radon produces valid JSON output
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/ddp/spawnCollect.ts:14:11
     let stdout = "";
     let isResolved = false;
     const finish = (output: string) => {
-      if (!isResolved) {
+      if (isResolved) {
         isResolved = true;
         resolve(output);
killedBy: runGitLog (integration) returns non-empty output for recent history
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] BooleanLiteral
src/ddp/spawnCollect.ts:15:22
     let isResolved = false;
     const finish = (output: string) => {
       if (!isResolved) {
-        isResolved = true;
+        isResolved = false;
         resolve(output);
       }

[Killed] BlockStatement
src/ddp/spawnCollect.ts:26:28
     proc.stdout?.on("data", (d: Buffer) => {
       stdout += d.toString();
     });
-    proc.on("close", () => {
-      clearTimeout(t);
-      finish(stdout);
-    });
+    proc.on("close", () => {});
     proc.on("error", () => {
       clearTimeout(t);
killedBy: runGitLog (integration) returns non-empty output for recent history
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/ddp/spawnCollect.ts:30:28
       clearTimeout(t);
       finish(stdout);
     });
-    proc.on("error", () => {
-      clearTimeout(t);
-      finish("");
-    });
+    proc.on("error", () => {});
   });
 }
killedBy: runGitLog returns empty string when spawn emits error
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
