[Killed] StringLiteral
src/ddp/cc/radonSpawn.ts:12:21
 ): Promise<Map<string, number>> {
   const stdout = await spawnAndCollect(
     pythonPath,
-    ["-m", "radon", "cc", "-j", filePath],
+    ["-m", "radon", "", "-j", filePath],
     cwd,
     timeoutMs
killedBy: runRadonCc passes correct arguments to cp.spawn
statusReason: expected "vi.fn()" to be called with arguments: [ '/usr/bin/python3', …(2) ]

Received:

  1st vi.fn() call:

@@ -1,11 +1,11 @@
  [
