[Killed] StringLiteral
src/ddp/cc/pmdSpawn.ts:12:73
 ): Promise<Map<number, number>> {
   return spawnAndCollect(
     pmdPath,
-    ["check", "-d", fileFsPath, "-R", "category/java/design.xml", "-f", "xml", "--no-cache"],
+    ["check", "-d", fileFsPath, "-R", "category/java/design.xml", "-f", "", "--no-cache"],
     cwd,
     timeoutMs
killedBy: runPmdCyclomaticComplexity passes correct arguments to cp.spawn
statusReason: expected "vi.fn()" to be called with arguments: [ '/opt/pmd/bin/pmd', …(2) ]

Received:

  1st vi.fn() call:

@@ -5,11 +5,11 @@
      "-d",

[Killed] ArrayDeclaration
src/ddp/cc/pmdSpawn.ts:12:5
 ): Promise<Map<number, number>> {
   return spawnAndCollect(
     pmdPath,
-    ["check", "-d", fileFsPath, "-R", "category/java/design.xml", "-f", "xml", "--no-cache"],
+    [],
     cwd,
     timeoutMs
killedBy: runPmdCyclomaticComplexity passes correct arguments to cp.spawn
statusReason: expected "vi.fn()" to be called with arguments: [ '/opt/pmd/bin/pmd', …(2) ]

Received:

  1st vi.fn() call:

  [
    "/opt/pmd/bin/pmd",
