[Killed] StringLiteral
src/ddp/cc/eslintSpawn.ts:12:24
 ): Promise<Map<number, number>> {
   const stdout = await spawnAndCollect(
     eslintPath,
-    [fileFsPath, "-f", "json", "--no-error-on-unmatched-pattern", "--no-warn-ignored"],
+    [fileFsPath, "-f", "", "--no-error-on-unmatched-pattern", "--no-warn-ignored"],
     cwd,
     timeoutMs
killedBy: runEslintComplexity passes correct arguments to cp.spawn
statusReason: expected "vi.fn()" to be called with arguments: [ '/opt/eslint/bin/eslint', …(2) ]

Received:

  1st vi.fn() call:

@@ -1,11 +1,11 @@
  [
