[Killed] EqualityOperator
src/core/viewModel.ts:13:32
 
 /** Filter symbols that belong to a specific file URI. */
 export function symbolsForFile(uriStr: string, symbols: readonly SymbolMetrics[]): SymbolMetrics[] {
-  return symbols.filter((s) => s.uri === uriStr);
+  return symbols.filter((s) => s.uri !== uriStr);
 }
 
killedBy: symbolsForFile filters symbols matching the uri
statusReason: expected [ 'b' ] to deeply equal [ 'a', 'c' ]

[Killed] StringLiteral
src/core/viewModel.ts:20:5
 export function formatHoverBreakdown(s: SymbolMetrics): string {
   return (
     `**DDP risk**  F=${s.f.toFixed(1)}  (R×CRAP)\n\n` +
-    `- R (rank): ${s.r.toFixed(3)}\n` +
+    `` +
     `- CRAP: ${s.crap.toFixed(2)}\n` +
     `- CC: ${s.cc}\n` +
killedBy: formatHoverBreakdown contains all five metric values and labels
statusReason: expected '**DDP risk**  F=42.6  (R×CRAP)\n\n- C…' to contain 'R (rank): 3.456'

[Killed] StringLiteral
src/core/viewModel.ts:22:5
     `**DDP risk**  F=${s.f.toFixed(1)}  (R×CRAP)\n\n` +
     `- R (rank): ${s.r.toFixed(3)}\n` +
     `- CRAP: ${s.crap.toFixed(2)}\n` +
-    `- CC: ${s.cc}\n` +
+    `` +
     `- T (coverage): ${(s.t * 100).toFixed(0)}%\n\n` +
     `High rank + high CRAP ⇒ higher impact if this unit fails.`
killedBy: formatHoverBreakdown contains all five metric values and labels
statusReason: expected '**DDP risk**  F=42.6  (R×CRAP)\n\n- R…' to contain 'CC: 5'
