[Killed] BlockStatement
src/ddp/lspCallGraph.ts:89:7
     return undefined;
   }
   const pos = new vscode.Position(line, character);
-  try {
-    const items = await languagesCallHierarchy().prepareCallHierarchy(doc, pos, token);
-    return items?.[0];
-  } catch (e) {
+  try {} catch (e) {
     console.debug(`[DDP] prepareCallHierarchy failed for ${symbolId}:`, e);
     return undefined;
killedBy: collectCallEdgesFromWorkspace outgoing call resolution returns edges from outgoing call hierarchy
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] BlockStatement
src/ddp/lspCallGraph.ts:158:13
     const maxFiles = options.maxFiles ?? 500;
     const adapter = buildVscodeAdapter(maxFiles, token, options.rootUri, options.excludeTests ?? true);
     return await collectCallEdgesViaAdapter(adapter);
-  } finally {
-    ownSource?.dispose();
-  }
+  } finally {}
 }
 
killedBy: collectCallEdgesFromWorkspace defaults disposes the internal CancellationTokenSource when no token provided
statusReason: expected "dispose" to be called once, but got 0 times
