[Killed] BlockStatement
src/ddp/coverageStore.ts:72:16
     const resolved = new Map<string, StatementCover[]>();
     for (const [sf, stmts] of parsed) {
       const uri = resolveLcovSfToUri(folder, sf);
-      if (uri) {
-        resolved.set(uri.toString(), stmts);
-      }
+      if (uri) {}
     }
     maps.push(resolved);
killedBy: loadLcovIntoStore loads LCOV file and ingests parsed data into store
statusReason: expected undefined to be defined
