[Killed] ConditionalExpression
src/core/metrics.ts:29:7
 
 /** Clamp a number to [0, 1], treating NaN as 0. */
 export function clamp01(t: number): number {
-  if (Number.isNaN(t)) {
+  if (true) {
     return 0;
   }
killedBy: AnalysisOrchestrator applies fallbackT when no coverage statements overlap symbol
statusReason: expected +0 to be close to 0.5, received difference is 0.5, but expected 0.000005
