[Killed] BlockStatement
src/ddp/adapters.ts:138:39
     this.token = token;
   }
 
-  async loadCoverage(): Promise<void> {
-    this.store.clear();
-    await loadLcovIntoStore(this.store, this.lcovGlob, this.token);
-    await loadJacocoIntoStore(this.store, this.jacocoGlob, this.token);
-  }
+  async loadCoverage(): Promise<void> {}
 
   getStatements(uri: string): StatementCover[] | undefined {
killedBy: VsCodeCoverageProvider clears the store and delegates loadCoverage to loadLcovIntoStore with store, glob, and token
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] StringLiteral
src/ddp/adapters.ts:153:66
 
 /** Resolve workspace folder cwd for a file URI, returning "" if unknown. */
 function workspaceCwd(uri: vscode.Uri): string {
-  return vscode.workspace.getWorkspaceFolder(uri)?.uri.fsPath ?? "";
+  return vscode.workspace.getWorkspaceFolder(uri)?.uri.fsPath ?? "Stryker was here!";
 }
 
killedBy: EslintCcProvider passes empty string as cwd when workspace folder is unknown
statusReason: expected "vi.fn()" to be called with arguments: [ 'typescript', Any<String>, '', …(1) ]

Received:

  1st vi.fn() call:

  [
    "typescript",
