[Killed] BlockStatement
src/ddp/codeLensProvider.ts:25:44
     document: vscode.TextDocument,
     _token: vscode.CancellationToken
   ): Promise<vscode.CodeLens[]> {
-    if (!this.getConfig().codelensEnabled) {
-      return [];
-    }
+    if (!this.getConfig().codelensEnabled) {}
     const byId = this.state.symbolById;
     if (!byId.size) {
killedBy: DdpCodeLensProvider provideCodeLenses returns empty array when codelensEnabled is false
statusReason: functions is not iterable
