[Killed] BlockStatement
src/ddp/decorationManager.ts:41:27
     const decoConfig = this.getDecoConfig();
     const tier = decorationTier(maxF, decoConfig.warnThreshold, decoConfig.errorThreshold);
     const full = [fullDocumentRange(editor.document)];
-    if (tier === "error") {
-      editor.setDecorations(this.warnDeco, []);
-      editor.setDecorations(this.errorDeco, full);
-    } else if (tier === "warn") {
+    if (tier === "error") {} else if (tier === "warn") {
       editor.setDecorations(this.errorDeco, []);
       editor.setDecorations(this.warnDeco, full);
killedBy: DecorationManager applyActiveEditor — applies tier-based decoration sets error decoration and clears warn when tier is error
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times
