[Killed] BooleanLiteral
src/ddp/analyzeCommand.ts:20:25
 };
 
 export class AnalyzeCommand {
-  private isAnalyzing = false;
+  private isAnalyzing = true;
 
   constructor(
killedBy: AnalyzeCommand scope storage stores the scope in state when a folder analysis succeeds
statusReason: expected undefined to deeply equal { rootUri: 'file:///c%3A/code/src' }

[Killed] BlockStatement
src/ddp/analyzeCommand.ts:29:27
   ) {}
 
   async execute(scope?: AnalysisScope): Promise<void> {
-    if (this.isAnalyzing) {
-      return;
-    }
+    if (this.isAnalyzing) {}
     this.isAnalyzing = true;
     const title = scope
killedBy: AnalyzeCommand debounce guard ignores a second call while the first is still in progress
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/ddp/analyzeCommand.ts:29:9
   ) {}
 
   async execute(scope?: AnalysisScope): Promise<void> {
-    if (this.isAnalyzing) {
+    if (false) {
       return;
     }
killedBy: AnalyzeCommand debounce guard ignores a second call while the first is still in progress
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BooleanLiteral
src/ddp/analyzeCommand.ts:32:24
     if (this.isAnalyzing) {
       return;
     }
-    this.isAnalyzing = true;
+    this.isAnalyzing = false;
     const title = scope
       ? `DDP: analyzing folder\u2026`
killedBy: AnalyzeCommand debounce guard ignores a second call while the first is still in progress
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/ddp/analyzeCommand.ts:53:15
           this.ui.applyDecorations();
         }
       );
-    } finally {
-      this.isAnalyzing = false;
-    }
+    } finally {}
   }
 }
killedBy: AnalyzeCommand scope storage stores undefined scope for workspace-wide analysis
statusReason: expected { rootUri: 'file:///c%3A/code/src' } to be undefined

[Killed] BooleanLiteral
src/ddp/analyzeCommand.ts:54:26
         }
       );
     } finally {
-      this.isAnalyzing = false;
+      this.isAnalyzing = true;
     }
   }
killedBy: AnalyzeCommand scope storage stores undefined scope for workspace-wide analysis
statusReason: expected { rootUri: 'file:///c%3A/code/src' } to be undefined
