[Killed] BlockStatement
src/ddp/extensionState.ts:28:80
     return this._scope;
   }
 
-  setAnalysis(result: AnalysisResult | undefined, scope?: AnalysisScope): void {
-    this._lastAnalysis = result;
-    this._scope = scope;
-    this._generation += 1;
-    this._symbolsById = new Map(result?.symbols.map((s) => [s.id, s]) ?? []);
-  }
+  setAnalysis(result: AnalysisResult | undefined, scope?: AnalysisScope): void {}
 }
 
killedBy: RiskTreeProvider getChildren returns file nodes sorted by max F descending
statusReason: expected [ undefined ] to deeply equal [ Array(3) ]

[Killed] AssignmentOperator
src/ddp/extensionState.ts:31:5
   setAnalysis(result: AnalysisResult | undefined, scope?: AnalysisScope): void {
     this._lastAnalysis = result;
     this._scope = scope;
-    this._generation += 1;
+    this._generation -= 1;
     this._symbolsById = new Map(result?.symbols.map((s) => [s.id, s]) ?? []);
   }
killedBy: ExtensionState setAnalysis with valid result increments analysisGeneration by 1
statusReason: expected -1 to deeply equal 1

[Killed] LogicalOperator
src/ddp/extensionState.ts:32:33
     this._lastAnalysis = result;
     this._scope = scope;
     this._generation += 1;
-    this._symbolsById = new Map(result?.symbols.map((s) => [s.id, s]) ?? []);
+    this._symbolsById = new Map(result?.symbols.map(s => [s.id, s]) && []);
   }
 }
killedBy: ExtensionState setAnalysis with valid result builds symbolById map from result symbols
statusReason: expected +0 to deeply equal 2
