[Killed] BlockStatement
src/ddp/loadJacocoIntoStore.ts:52:16
 
     for (const [jacocoKey, stmts] of parsed) {
       const uri = await resolveJacocoSourceToUri(folder, jacocoKey);
-      if (uri) {
-        const existing = store.get(uri.toString());
-        if (existing) {
-          store.ingestStatementCovers(uri.toString(), [...existing, ...stmts]);
-        } else {
-          store.ingestStatementCovers(uri.toString(), stmts);
-        }
-      }
+      if (uri) {}
     }
   }
killedBy: loadJacocoIntoStore parses JaCoCo XML and ingests line coverage into store
statusReason: expected undefined to be defined
